# -*- coding: utf-8 -*-
"""
-------------------------------------------------
  File Name：   province
  date：     2020/7/2
  Author :    jack
  Description :    利用jieba分词后进行省市匹配,省市数据来自2020年国家统计局
-------------------------------------------------  
"""
import re
import jieba
import jieba.posseg as pseg  # 词性标注


ALL_CITYS = {"河源市", "阿拉尔市", "商洛市", "四平市", "咸阳市", "徐州市", "嘉兴市", "鹤壁市", "漳州市", "玉林市", "玉溪市", "眉山市", "安庆市", "张掖市", "汕头市",
             "克拉玛依市", "临高县", "温州市", "阳江市", "保亭黎族苗族自治县", "钦州市", "肇庆市", "三门峡市", "屯昌县", "文山壮族苗族自治州", "唐山市", "丹东市", "洛阳市",
             "桂林市", "乐山市", "宁波市", "晋中市", "邵阳市", "张家口市", "雅安市", "邢台市", "绥化市", "阜阳市", "潜江市", "六盘水市", "酒泉市", "盐城市", "通辽市",
             "扬州市", "福州市", "铜仁市", "吉林市", "中卫市", "菏泽市", "揭阳市", "周口市", "琼中黎族苗族自治县", "柳州市", "云浮市", "凉山彝族自治州", "德宏傣族景颇族自治州",
             "广安市", "香港特别行政区", "果洛藏族自治州", "沈阳市", "山南市", "乐东黎族自治县", "萍乡市", "惠州市", "兰州市", "鞍山市", "石河子市", "嘉峪关市", "三沙市",
             "深圳市", "五家渠市", "新乡市", "阿里地区", "宿迁市", "德州市", "五指山市", "西安市", "晋城市", "盘锦市", "绍兴市", "益阳市", "海北藏族自治州", "日喀则市",
             "鹤岗市", "哈尔滨市", "七台河市", "迪庆藏族自治州", "合肥市", "株洲市", "德阳市", "仙桃市", "西双版纳傣族自治州", "珠海市", "神农架林区", "定安县", "宁德市",
             "上饶市", "三亚市", "海东市", "湘西土家族苗族自治州", "丽江市", "台州市", "天津市", "六安市", "许昌市", "昌都市", "宜宾市", "石嘴山市", "昌江黎族自治县",
             "南充市", "衡阳市", "潮州市", "承德市", "大理白族自治州", "朔州市", "定西市", "武威市", "巴中市", "佳木斯市", "北海市", "铁门关市", "和田地区", "江门市",
             "广元市", "烟台市", "昭通市", "阿克苏地区", "佛山市", "河池市", "遵义市", "东营市", "大兴安岭地区", "吉安市", "图木舒克市", "邯郸市", "宝鸡市", "武汉市",
             "新余市", "黄山市", "黄南藏族自治州", "安顺市", "马鞍山市", "大连市", "包头市", "大同市", "淮南市", "天水市", "伊春市", "北京市", "长治市", "芜湖市",
             "阿拉善盟", "济南市", "茂名市", "重庆市", "怒江傈僳族自治州", "长沙市", "铁岭市", "金华市", "常德市", "秦皇岛市", "海口市", "淄博市", "葫芦岛市", "天门市",
             "宿州市", "辽源市", "辽阳市", "南宁市", "厦门市", "临沧市", "陵水黎族自治县", "兴安盟", "南京市", "丽水市", "滁州市", "忻州市", "防城港市", "湛江市",
             "保山市", "莆田市", "娄底市", "百色市", "黑河市", "内江市", "澳门特别行政区", "淮北市", "来宾市", "澄迈县", "南昌市", "陇南市", "南平市", "乌鲁木齐市",
             "湖州市", "景德镇市", "黔西南布依族苗族自治州", "楚雄彝族自治州", "博尔塔拉蒙古自治州", "营口市", "中山市", "东莞市", "信阳市", "自贡市", "咸宁市", "锡林郭勒盟",
             "临夏回族自治州", "遂宁市", "沧州市", "日照市", "泰州市", "泰安市", "清远市", "延安市", "宜昌市", "潍坊市", "呼和浩特市", "哈密市", "赣州市", "池州市",
             "孝感市", "乌兰察布市", "通化市", "南阳市", "吕梁市", "本溪市", "郴州市", "乌海市", "玉树藏族自治州", "镇江市", "鄂州市", "襄阳市", "普洱市",
             "海西蒙古族藏族自治州", "平凉市", "青岛市", "漯河市", "巴彦淖尔市", "开封市", "荆门市", "庆阳市", "白山市", "衢州市", "松原市", "渭南市", "十堰市", "杭州市",
             "汉中市", "安康市", "绵阳市", "常州市", "商丘市", "抚州市", "廊坊市", "黄石市", "铜陵市", "运城市", "白城市", "喀什地区", "东方市", "呼伦贝尔市", "濮阳市",
             "滨州市", "吴忠市", "阳泉市", "岳阳市", "临汾市", "抚顺市", "黔南布依族苗族自治州", "拉萨市", "文昌市", "牡丹江市", "梅州市", "崇左市", "安阳市", "塔城地区",
             "枣庄市", "鹰潭市", "临沂市", "银川市", "毕节市", "榆林市", "双鸭山市", "衡水市", "亳州市", "龙岩市", "鄂尔多斯市", "九江市", "贵港市", "恩施土家族苗族自治州",
             "太原市", "白沙黎族自治县", "鸡西市", "聊城市", "甘南藏族自治州", "吐鲁番市", "苏州市", "甘孜藏族自治州", "驻马店市", "大庆市", "巴音郭楞蒙古自治州", "湘潭市",
             "朝阳市", "固原市", "永州市", "梧州市", "连云港市", "石家庄市", "宜春市", "齐齐哈尔市", "荆州市", "济源市", "无锡市", "上海市", "淮安市", "昆明市",
             "威海市", "三明市", "济宁市", "保定市", "昌吉回族自治州", "泉州市", "攀枝花市", "儋州市", "泸州市", "韶关市", "郑州市", "延边朝鲜族自治州", "黔东南苗族侗族自治州",
             "林芝市", "张家界市", "琼海市", "铜川市", "阿坝藏族羌族自治州", "贺州市", "那曲市", "长春市", "随州市", "万宁市", "蚌埠市", "广州市", "舟山市", "贵阳市",
             "克孜勒苏柯尔克孜自治州", "海南藏族自治州", "阿勒泰地区", "平顶山市", "达州市", "怀化市", "资阳市", "伊犁哈萨克自治州", "南通市", "汕尾市", "黄冈市", "西宁市",
             "赤峰市", "金昌市", "锦州市", "红河哈尼族彝族自治州", "焦作市", "白银市", "曲靖市", "成都市", "宣城市", "阜新市", "台北市", "新北市", "桃园市", "台中市",
             "台南市", "高雄市", "基隆市", "新竹市", "嘉义市"}

ALL_PROVINCES = {'湖南省', '河南省', '北京市', '重庆市', '云南省', '宁夏回族自治区', '江西省', '黑龙江省', '福建省', '广西壮族自治区', '吉林省', '湖北省', '贵州省',
                 '山东省', '台湾', '新疆维吾尔自治区', '浙江省', '安徽省', '陕西省', '内蒙古自治区', '江苏省', '甘肃省', '海南省', '西藏自治区', '天津市', '山西省',
                 '辽宁省', '青海省', '四川省', '河北省', '上海市', '香港', '澳门', '广东省'}

CITY_TO_PROVINCE = {"北京市": "北京市", "上海市": "上海市", "重庆市": "重庆市", "天津市": "天津市", "台湾": "台湾", "台北市": "台湾", "新北市": "台湾",
                    "桃园市": "台湾", "台中市": "台湾", "台南市": "台湾", "高雄市": "台湾", "基隆市": "台湾", "新竹市": "台湾",
                    "嘉义市": "台湾", "香港": "香港", "东城区": "北京市",
                    "西城区": "北京市", "朝阳区": "北京市", "丰台区": "北京市", "石景山区": "北京市", "海淀区": "北京市", "门头沟区": "北京市",
                    "房山区": "北京市", "通州区": "北京市", "顺义区": "北京市", "昌平区": "北京市", "大兴区": "北京市", "怀柔区": "北京市", "平谷区": "北京市",
                    "密云区": "北京市", "延庆区": "北京市", "和平区": "天津市", "河东区": "天津市", "河西区": "天津市", "南开区": "天津市", "河北区": "天津市",
                    "红桥区": "天津市", "东丽区": "天津市", "西青区": "天津市", "津南区": "天津市", "北辰区": "天津市", "武清区": "天津市", "宝坻区": "天津市",
                    "滨海新区": "天津市", "宁河区": "天津市", "静海区": "天津市", "蓟州区": "天津市", "石家庄市": "河北省", "唐山市": "河北省", "秦皇岛市": "河北省",
                    "邯郸市": "河北省", "邢台市": "河北省", "保定市": "河北省", "张家口市": "河北省", "承德市": "河北省", "沧州市": "河北省", "廊坊市": "河北省",
                    "衡水市": "河北省", "太原市": "山西省", "大同市": "山西省", "阳泉市": "山西省", "长治市": "山西省", "晋城市": "山西省", "朔州市": "山西省",
                    "晋中市": "山西省", "运城市": "山西省", "忻州市": "山西省", "临汾市": "山西省", "吕梁市": "山西省", "呼和浩特市": "内蒙古自治区",
                    "包头市": "内蒙古自治区", "乌海市": "内蒙古自治区", "赤峰市": "内蒙古自治区", "通辽市": "内蒙古自治区", "鄂尔多斯市": "内蒙古自治区",
                    "呼伦贝尔市": "内蒙古自治区", "巴彦淖尔市": "内蒙古自治区", "乌兰察布市": "内蒙古自治区", "兴安盟": "内蒙古自治区", "锡林郭勒盟": "内蒙古自治区",
                    "阿拉善盟": "内蒙古自治区", "沈阳市": "辽宁省", "大连市": "辽宁省", "鞍山市": "辽宁省", "抚顺市": "辽宁省", "本溪市": "辽宁省",
                    "丹东市": "辽宁省", "锦州市": "辽宁省", "营口市": "辽宁省", "阜新市": "辽宁省", "辽阳市": "辽宁省", "盘锦市": "辽宁省", "铁岭市": "辽宁省",
                    "朝阳市": "辽宁省", "葫芦岛市": "辽宁省", "长春市": "吉林省", "吉林市": "吉林省", "四平市": "吉林省", "辽源市": "吉林省", "通化市": "吉林省",
                    "白山市": "吉林省", "松原市": "吉林省", "白城市": "吉林省", "延边朝鲜族自治州": "吉林省", "哈尔滨市": "黑龙江省", "齐齐哈尔市": "黑龙江省",
                    "鸡西市": "黑龙江省", "鹤岗市": "黑龙江省", "双鸭山市": "黑龙江省", "大庆市": "黑龙江省", "伊春市": "黑龙江省", "佳木斯市": "黑龙江省",
                    "七台河市": "黑龙江省", "牡丹江市": "黑龙江省", "黑河市": "黑龙江省", "绥化市": "黑龙江省", "大兴安岭地区": "黑龙江省", "黄浦区": "上海市",
                    "徐汇区": "上海市", "长宁区": "上海市", "静安区": "上海市", "普陀区": "上海市", "虹口区": "上海市", "杨浦区": "上海市", "闵行区": "上海市",
                    "宝山区": "上海市", "嘉定区": "上海市", "浦东新区": "上海市", "金山区": "上海市", "松江区": "上海市", "青浦区": "上海市", "奉贤区": "上海市",
                    "崇明区": "上海市", "南京市": "江苏省", "无锡市": "江苏省", "徐州市": "江苏省", "常州市": "江苏省", "苏州市": "江苏省", "南通市": "江苏省",
                    "连云港市": "江苏省", "淮安市": "江苏省", "盐城市": "江苏省", "扬州市": "江苏省", "镇江市": "江苏省", "泰州市": "江苏省", "宿迁市": "江苏省",
                    "杭州市": "浙江省", "宁波市": "浙江省", "温州市": "浙江省", "嘉兴市": "浙江省", "湖州市": "浙江省", "绍兴市": "浙江省", "金华市": "浙江省",
                    "衢州市": "浙江省", "舟山市": "浙江省", "台州市": "浙江省", "丽水市": "浙江省", "合肥市": "安徽省", "芜湖市": "安徽省", "蚌埠市": "安徽省",
                    "淮南市": "安徽省", "马鞍山市": "安徽省", "淮北市": "安徽省", "铜陵市": "安徽省", "安庆市": "安徽省", "黄山市": "安徽省", "滁州市": "安徽省",
                    "阜阳市": "安徽省", "宿州市": "安徽省", "六安市": "安徽省", "亳州市": "安徽省", "池州市": "安徽省", "宣城市": "安徽省", "福州市": "福建省",
                    "厦门市": "福建省", "莆田市": "福建省", "三明市": "福建省", "泉州市": "福建省", "漳州市": "福建省", "南平市": "福建省", "龙岩市": "福建省",
                    "宁德市": "福建省", "南昌市": "江西省", "景德镇市": "江西省", "萍乡市": "江西省", "九江市": "江西省", "新余市": "江西省", "鹰潭市": "江西省",
                    "赣州市": "江西省", "吉安市": "江西省", "宜春市": "江西省", "抚州市": "江西省", "上饶市": "江西省", "济南市": "山东省", "青岛市": "山东省",
                    "淄博市": "山东省", "枣庄市": "山东省", "东营市": "山东省", "烟台市": "山东省", "潍坊市": "山东省", "济宁市": "山东省", "泰安市": "山东省",
                    "威海市": "山东省", "日照市": "山东省", "临沂市": "山东省", "德州市": "山东省", "聊城市": "山东省", "滨州市": "山东省", "菏泽市": "山东省",
                    "郑州市": "河南省", "开封市": "河南省", "洛阳市": "河南省", "平顶山市": "河南省", "安阳市": "河南省", "鹤壁市": "河南省", "新乡市": "河南省",
                    "焦作市": "河南省", "濮阳市": "河南省", "许昌市": "河南省", "漯河市": "河南省", "三门峡市": "河南省", "南阳市": "河南省", "商丘市": "河南省",
                    "信阳市": "河南省", "周口市": "河南省", "驻马店市": "河南省", "济源市": "河南省", "武汉市": "湖北省", "黄石市": "湖北省", "十堰市": "湖北省",
                    "宜昌市": "湖北省", "襄阳市": "湖北省", "鄂州市": "湖北省", "荆门市": "湖北省", "孝感市": "湖北省", "荆州市": "湖北省", "黄冈市": "湖北省",
                    "咸宁市": "湖北省", "随州市": "湖北省", "恩施土家族苗族自治州": "湖北省", "仙桃市": "湖北省", "潜江市": "湖北省", "天门市": "湖北省",
                    "神农架林区": "湖北省", "长沙市": "湖南省", "株洲市": "湖南省", "湘潭市": "湖南省", "衡阳市": "湖南省", "邵阳市": "湖南省", "岳阳市": "湖南省",
                    "常德市": "湖南省", "张家界市": "湖南省", "益阳市": "湖南省", "郴州市": "湖南省", "永州市": "湖南省", "怀化市": "湖南省", "娄底市": "湖南省",
                    "湘西土家族苗族自治州": "湖南省", "广州市": "广东省", "韶关市": "广东省", "深圳市": "广东省", "珠海市": "广东省", "汕头市": "广东省",
                    "佛山市": "广东省", "江门市": "广东省", "湛江市": "广东省", "茂名市": "广东省", "肇庆市": "广东省", "惠州市": "广东省", "梅州市": "广东省",
                    "汕尾市": "广东省", "河源市": "广东省", "阳江市": "广东省", "清远市": "广东省", "东莞市": "广东省", "中山市": "广东省", "潮州市": "广东省",
                    "揭阳市": "广东省", "云浮市": "广东省", "南宁市": "广西壮族自治区", "柳州市": "广西壮族自治区", "桂林市": "广西壮族自治区", "梧州市": "广西壮族自治区",
                    "北海市": "广西壮族自治区", "防城港市": "广西壮族自治区", "钦州市": "广西壮族自治区", "贵港市": "广西壮族自治区", "玉林市": "广西壮族自治区",
                    "百色市": "广西壮族自治区", "贺州市": "广西壮族自治区", "河池市": "广西壮族自治区", "来宾市": "广西壮族自治区", "崇左市": "广西壮族自治区",
                    "海口市": "海南省", "三亚市": "海南省", "三沙市": "海南省", "儋州市": "海南省", "五指山市": "海南省", "琼海市": "海南省", "文昌市": "海南省",
                    "万宁市": "海南省", "东方市": "海南省", "定安县": "海南省", "屯昌县": "海南省", "澄迈县": "海南省", "临高县": "海南省",
                    "白沙黎族自治县": "海南省", "昌江黎族自治县": "海南省", "乐东黎族自治县": "海南省", "陵水黎族自治县": "海南省", "保亭黎族苗族自治县": "海南省",
                    "琼中黎族苗族自治县": "海南省", "万州区": "重庆市", "涪陵区": "重庆市", "渝中区": "重庆市", "大渡口区": "重庆市", "江北区": "重庆市",
                    "沙坪坝区": "重庆市", "九龙坡区": "重庆市", "南岸区": "重庆市", "北碚区": "重庆市", "綦江区": "重庆市", "大足区": "重庆市", "渝北区": "重庆市",
                    "巴南区": "重庆市", "黔江区": "重庆市", "长寿区": "重庆市", "江津区": "重庆市", "合川区": "重庆市", "永川区": "重庆市", "南川区": "重庆市",
                    "璧山区": "重庆市", "铜梁区": "重庆市", "潼南区": "重庆市", "荣昌区": "重庆市", "开州区": "重庆市", "梁平区": "重庆市", "武隆区": "重庆市",
                    "城口县": "重庆市", "丰都县": "重庆市", "垫江县": "重庆市", "忠县": "重庆市", "云阳县": "重庆市", "奉节县": "重庆市", "巫山县": "重庆市",
                    "巫溪县": "重庆市", "石柱土家族自治县": "重庆市", "秀山土家族苗族自治县": "重庆市", "酉阳土家族苗族自治县": "重庆市", "彭水苗族土家族自治县": "重庆市",
                    "成都市": "四川省", "自贡市": "四川省", "攀枝花市": "四川省", "泸州市": "四川省", "德阳市": "四川省", "绵阳市": "四川省", "广元市": "四川省",
                    "遂宁市": "四川省", "内江市": "四川省", "乐山市": "四川省", "南充市": "四川省", "眉山市": "四川省", "宜宾市": "四川省", "广安市": "四川省",
                    "达州市": "四川省", "雅安市": "四川省", "巴中市": "四川省", "资阳市": "四川省", "阿坝藏族羌族自治州": "四川省", "甘孜藏族自治州": "四川省",
                    "凉山彝族自治州": "四川省", "贵阳市": "贵州省", "六盘水市": "贵州省", "遵义市": "贵州省", "安顺市": "贵州省", "毕节市": "贵州省",
                    "铜仁市": "贵州省", "黔西南布依族苗族自治州": "贵州省", "黔东南苗族侗族自治州": "贵州省", "黔南布依族苗族自治州": "贵州省", "昆明市": "云南省",
                    "曲靖市": "云南省", "玉溪市": "云南省", "保山市": "云南省", "昭通市": "云南省", "丽江市": "云南省", "普洱市": "云南省", "临沧市": "云南省",
                    "楚雄彝族自治州": "云南省", "红河哈尼族彝族自治州": "云南省", "文山壮族苗族自治州": "云南省", "西双版纳傣族自治州": "云南省", "大理白族自治州": "云南省",
                    "德宏傣族景颇族自治州": "云南省", "怒江傈僳族自治州": "云南省", "迪庆藏族自治州": "云南省", "拉萨市": "西藏自治区", "日喀则市": "西藏自治区",
                    "昌都市": "西藏自治区", "林芝市": "西藏自治区", "山南市": "西藏自治区", "那曲市": "西藏自治区", "阿里地区": "西藏自治区", "西安市": "陕西省",
                    "铜川市": "陕西省", "宝鸡市": "陕西省", "咸阳市": "陕西省", "渭南市": "陕西省", "延安市": "陕西省", "汉中市": "陕西省", "榆林市": "陕西省",
                    "安康市": "陕西省", "商洛市": "陕西省", "兰州市": "甘肃省", "嘉峪关市": "甘肃省", "金昌市": "甘肃省", "白银市": "甘肃省", "天水市": "甘肃省",
                    "武威市": "甘肃省", "张掖市": "甘肃省", "平凉市": "甘肃省", "酒泉市": "甘肃省", "庆阳市": "甘肃省", "定西市": "甘肃省", "陇南市": "甘肃省",
                    "临夏回族自治州": "甘肃省", "甘南藏族自治州": "甘肃省", "西宁市": "青海省", "海东市": "青海省", "海北藏族自治州": "青海省", "黄南藏族自治州": "青海省",
                    "海南藏族自治州": "青海省", "果洛藏族自治州": "青海省", "玉树藏族自治州": "青海省", "海西蒙古族藏族自治州": "青海省", "银川市": "宁夏回族自治区",
                    "石嘴山市": "宁夏回族自治区", "吴忠市": "宁夏回族自治区", "固原市": "宁夏回族自治区", "中卫市": "宁夏回族自治区", "乌鲁木齐市": "新疆维吾尔自治区",
                    "克拉玛依市": "新疆维吾尔自治区", "吐鲁番市": "新疆维吾尔自治区", "哈密市": "新疆维吾尔自治区", "昌吉回族自治州": "新疆维吾尔自治区",
                    "博尔塔拉蒙古自治州": "新疆维吾尔自治区", "巴音郭楞蒙古自治州": "新疆维吾尔自治区", "阿克苏地区": "新疆维吾尔自治区", "克孜勒苏柯尔克孜自治州": "新疆维吾尔自治区",
                    "喀什地区": "新疆维吾尔自治区", "和田地区": "新疆维吾尔自治区", "伊犁哈萨克自治州": "新疆维吾尔自治区", "塔城地区": "新疆维吾尔自治区",
                    "阿勒泰地区": "新疆维吾尔自治区", "石河子市": "新疆维吾尔自治区", "阿拉尔市": "新疆维吾尔自治区", "图木舒克市": "新疆维吾尔自治区",
                    "五家渠市": "新疆维吾尔自治区", "铁门关市": "新疆维吾尔自治区", "香港特别行政区": "香港", "澳门特别行政区": "澳门"}

# 地区路径
AREA_PATH = {"东城区": [["北京市", "北京市"]], "西城区": [["北京市", "北京市"]], "朝阳区": [["北京市", "北京市"], ["长春市", "吉林省"]],
             "丰台区": [["北京市", "北京市"]], "石景山区": [["北京市", "北京市"]], "海淀区": [["北京市", "北京市"]], "门头沟区": [["北京市", "北京市"]],
             "房山区": [["北京市", "北京市"]], "通州区": [["北京市", "北京市"], ["南通市", "江苏省"]], "顺义区": [["北京市", "北京市"]],
             "昌平区": [["北京市", "北京市"]], "大兴区": [["北京市", "北京市"]], "怀柔区": [["北京市", "北京市"]], "平谷区": [["北京市", "北京市"]],
             "密云区": [["北京市", "北京市"]], "延庆区": [["北京市", "北京市"]], "和平区": [["天津市", "天津市"], ["沈阳市", "辽宁省"]],
             "河东区": [["天津市", "天津市"], ["临沂市", "山东省"]], "河西区": [["天津市", "天津市"]], "南开区": [["天津市", "天津市"]],
             "河北区": [["天津市", "天津市"]], "红桥区": [["天津市", "天津市"]], "东丽区": [["天津市", "天津市"]], "西青区": [["天津市", "天津市"]],
             "津南区": [["天津市", "天津市"]], "北辰区": [["天津市", "天津市"]], "武清区": [["天津市", "天津市"]], "宝坻区": [["天津市", "天津市"]],
             "滨海新区": [["天津市", "天津市"]], "宁河区": [["天津市", "天津市"]], "静海区": [["天津市", "天津市"]], "蓟州区": [["天津市", "天津市"]],
             "长安区": [["石家庄市", "河北省"], ["西安市", "陕西省"]], "桥西区": [["石家庄市", "河北省"], ["邢台市", "河北省"], ["张家口市", "河北省"]],
             "新华区": [["石家庄市", "河北省"], ["沧州市", "河北省"], ["平顶山市", "河南省"]], "井陉矿区": [["石家庄市", "河北省"]],
             "裕华区": [["石家庄市", "河北省"]], "藁城区": [["石家庄市", "河北省"]], "鹿泉区": [["石家庄市", "河北省"]], "栾城区": [["石家庄市", "河北省"]],
             "井陉县": [["石家庄市", "河北省"]], "正定县": [["石家庄市", "河北省"]], "行唐县": [["石家庄市", "河北省"]], "灵寿县": [["石家庄市", "河北省"]],
             "高邑县": [["石家庄市", "河北省"]], "深泽县": [["石家庄市", "河北省"]], "赞皇县": [["石家庄市", "河北省"]], "无极县": [["石家庄市", "河北省"]],
             "平山县": [["石家庄市", "河北省"]], "元氏县": [["石家庄市", "河北省"]], "赵县": [["石家庄市", "河北省"]],
             "石家庄高新技术产业开发区": [["石家庄市", "河北省"]], "石家庄循环化工园区": [["石家庄市", "河北省"]], "辛集市": [["石家庄市", "河北省"]],
             "晋州市": [["石家庄市", "河北省"]], "新乐市": [["石家庄市", "河北省"]], "路南区": [["唐山市", "河北省"]], "路北区": [["唐山市", "河北省"]],
             "古冶区": [["唐山市", "河北省"]], "开平区": [["唐山市", "河北省"]], "丰南区": [["唐山市", "河北省"]], "丰润区": [["唐山市", "河北省"]],
             "曹妃甸区": [["唐山市", "河北省"]], "滦南县": [["唐山市", "河北省"]], "乐亭县": [["唐山市", "河北省"]], "迁西县": [["唐山市", "河北省"]],
             "玉田县": [["唐山市", "河北省"]], "河北唐山芦台经济开发区": [["唐山市", "河北省"]], "唐山市汉沽管理区": [["唐山市", "河北省"]],
             "唐山高新技术产业开发区": [["唐山市", "河北省"]], "河北唐山海港经济开发区": [["唐山市", "河北省"]], "遵化市": [["唐山市", "河北省"]],
             "迁安市": [["唐山市", "河北省"]], "滦县": [["唐山市", "河北省"]], "滦州市": [["唐山市", "河北省"]], "海港区": [["秦皇岛市", "河北省"]],
             "山海关区": [["秦皇岛市", "河北省"]],
             "北戴河区": [["秦皇岛市", "河北省"]], "抚宁区": [["秦皇岛市", "河北省"]], "青龙县": [["秦皇岛市", "河北省"]],"青龙满族自治县": [["秦皇岛市", "河北省"]],
             "昌黎县": [["秦皇岛市", "河北省"]], "卢龙县": [["秦皇岛市", "河北省"]], "秦皇岛市经济技术开发区": [["秦皇岛市", "河北省"]],
             "北戴河新区": [["秦皇岛市", "河北省"]], "邯山区": [["邯郸市", "河北省"]], "丛台区": [["邯郸市", "河北省"]], "复兴区": [["邯郸市", "河北省"]],
             "峰峰矿区": [["邯郸市", "河北省"]], "肥乡区": [["邯郸市", "河北省"]], "永年区": [["邯郸市", "河北省"]], "临漳县": [["邯郸市", "河北省"]],
             "成安县": [["邯郸市", "河北省"]], "大名县": [["邯郸市", "河北省"]], "涉县": [["邯郸市", "河北省"]], "磁县": [["邯郸市", "河北省"]],
             "邱县": [["邯郸市", "河北省"]], "鸡泽县": [["邯郸市", "河北省"]], "广平县": [["邯郸市", "河北省"]], "馆陶县": [["邯郸市", "河北省"]],
             "魏县": [["邯郸市", "河北省"]], "曲周县": [["邯郸市", "河北省"]], "邯郸经济技术开发区": [["邯郸市", "河北省"]], "邯郸冀南新区": [["邯郸市", "河北省"]],
             "武安市": [["邯郸市", "河北省"]], "桥东区": [["邢台市", "河北省"], ["张家口市", "河北省"]], "邢台县": [["邢台市", "河北省"]],
             "临城县": [["邢台市", "河北省"]], "内丘县": [["邢台市", "河北省"]], "柏乡县": [["邢台市", "河北省"]], "隆尧县": [["邢台市", "河北省"]],
             "任县": [["邢台市", "河北省"]], "南和县": [["邢台市", "河北省"]], "宁晋县": [["邢台市", "河北省"]], "巨鹿县": [["邢台市", "河北省"]],
             "新河县": [["邢台市", "河北省"]], "广宗县": [["邢台市", "河北省"]], "平乡县": [["邢台市", "河北省"]], "威县": [["邢台市", "河北省"]],
             "清河县": [["邢台市", "河北省"]], "临西县": [["邢台市", "河北省"]], "河北邢台经济开发区": [["邢台市", "河北省"]], "南宫市": [["邢台市", "河北省"]],
             "沙河市": [["邢台市", "河北省"]], "竞秀区": [["保定市", "河北省"]], "莲池区": [["保定市", "河北省"]], "满城区": [["保定市", "河北省"]],
             "清苑区": [["保定市", "河北省"]], "徐水区": [["保定市", "河北省"]], "涞水县": [["保定市", "河北省"]], "阜平县": [["保定市", "河北省"]],
             "定兴县": [["保定市", "河北省"]], "唐县": [["保定市", "河北省"]], "高阳县": [["保定市", "河北省"]], "容城县": [["保定市", "河北省"]],
             "涞源县": [["保定市", "河北省"]], "望都县": [["保定市", "河北省"]], "安新县": [["保定市", "河北省"]], "易县": [["保定市", "河北省"]],
             "曲阳县": [["保定市", "河北省"]], "蠡县": [["保定市", "河北省"]], "顺平县": [["保定市", "河北省"]], "博野县": [["保定市", "河北省"]],
             "雄县": [["保定市", "河北省"]], "保定高新技术产业开发区": [["保定市", "河北省"]], "保定白沟新城": [["保定市", "河北省"]],
             "涿州市": [["保定市", "河北省"]], "定州市": [["保定市", "河北省"]], "安国市": [["保定市", "河北省"]], "高碑店市": [["保定市", "河北省"]],
             "宣化区": [["张家口市", "河北省"]], "下花园区": [["张家口市", "河北省"]], "万全区": [["张家口市", "河北省"]], "崇礼区": [["张家口市", "河北省"]],
             "张北县": [["张家口市", "河北省"]], "康保县": [["张家口市", "河北省"]], "沽源县": [["张家口市", "河北省"]], "尚义县": [["张家口市", "河北省"]],
             "蔚县": [["张家口市", "河北省"]], "阳原县": [["张家口市", "河北省"]], "怀安县": [["张家口市", "河北省"]], "怀来县": [["张家口市", "河北省"]],
             "涿鹿县": [["张家口市", "河北省"]], "赤城县": [["张家口市", "河北省"]], "张家口经济开发区": [["张家口市", "河北省"]],
             "张家口市察北管理区": [["张家口市", "河北省"]], "张家口市塞北管理区": [["张家口市", "河北省"]], "双桥区": [["承德市", "河北省"]],
             "双滦区": [["承德市", "河北省"]], "鹰手营子矿区": [["承德市", "河北省"]], "承德县": [["承德市", "河北省"]], "兴隆县": [["承德市", "河北省"]],
             "滦平县": [["承德市", "河北省"]], "隆化县": [["承德市", "河北省"]],"丰宁县": [["承德市", "河北省"]], "丰宁满族自治县": [["承德市", "河北省"]], "宽城县": [["承德市", "河北省"]],"宽城满族自治县": [["承德市", "河北省"]],
             "围场县": [["承德市", "河北省"]],"围场满族蒙古族自治县": [["承德市", "河北省"]], "承德高新技术产业开发区": [["承德市", "河北省"]], "平泉市": [["承德市", "河北省"]],
             "运河区": [["沧州市", "河北省"]], "沧县": [["沧州市", "河北省"]], "青县": [["沧州市", "河北省"]], "东光县": [["沧州市", "河北省"]],
             "海兴县": [["沧州市", "河北省"]], "盐山县": [["沧州市", "河北省"]], "肃宁县": [["沧州市", "河北省"]], "南皮县": [["沧州市", "河北省"]],
             "吴桥县": [["沧州市", "河北省"]], "献县": [["沧州市", "河北省"]],"孟村县": [["沧州市", "河北省"]], "孟村回族自治县": [["沧州市", "河北省"]],
             "河北沧州经济开发区": [["沧州市", "河北省"]], "沧州高新技术产业开发区": [["沧州市", "河北省"]], "沧州渤海新区": [["沧州市", "河北省"]],
             "泊头市": [["沧州市", "河北省"]], "任丘市": [["沧州市", "河北省"]], "黄骅市": [["沧州市", "河北省"]], "河间市": [["沧州市", "河北省"]],
             "安次区": [["廊坊市", "河北省"]], "广阳区": [["廊坊市", "河北省"]], "固安县": [["廊坊市", "河北省"]], "永清县": [["廊坊市", "河北省"]],
             "香河县": [["廊坊市", "河北省"]], "大城县": [["廊坊市", "河北省"]], "文安县": [["廊坊市", "河北省"]],"大厂县": [["廊坊市", "河北省"]], "大厂回族自治县": [["廊坊市", "河北省"]],
             "廊坊经济技术开发区": [["廊坊市", "河北省"]], "霸州市": [["廊坊市", "河北省"]], "三河市": [["廊坊市", "河北省"]], "桃城区": [["衡水市", "河北省"]],
             "冀州区": [["衡水市", "河北省"]], "枣强县": [["衡水市", "河北省"]], "武邑县": [["衡水市", "河北省"]], "武强县": [["衡水市", "河北省"]],
             "饶阳县": [["衡水市", "河北省"]], "安平县": [["衡水市", "河北省"]], "故城县": [["衡水市", "河北省"]], "景县": [["衡水市", "河北省"]],
             "阜城县": [["衡水市", "河北省"]], "河北衡水高新技术产业开发区": [["衡水市", "河北省"]], "衡水滨湖新区": [["衡水市", "河北省"]],
             "深州市": [["衡水市", "河北省"]], "小店区": [["太原市", "山西省"]], "迎泽区": [["太原市", "山西省"]], "杏花岭区": [["太原市", "山西省"]],
             "尖草坪区": [["太原市", "山西省"]], "万柏林区": [["太原市", "山西省"]], "晋源区": [["太原市", "山西省"]], "清徐县": [["太原市", "山西省"]],
             "阳曲县": [["太原市", "山西省"]], "娄烦县": [["太原市", "山西省"]], "山西转型综合改革示范区": [["太原市", "山西省"]], "古交市": [["太原市", "山西省"]],
             "新荣区": [["大同市", "山西省"]], "平城区": [["大同市", "山西省"]], "云冈区": [["大同市", "山西省"]], "云州区": [["大同市", "山西省"]],
             "阳高县": [["大同市", "山西省"]], "天镇县": [["大同市", "山西省"]], "广灵县": [["大同市", "山西省"]], "灵丘县": [["大同市", "山西省"]],
             "浑源县": [["大同市", "山西省"]], "左云县": [["大同市", "山西省"]], "山西大同经济开发区": [["大同市", "山西省"]],
             "城区": [["阳泉市", "山西省"], ["晋城市", "山西省"], ["汕尾市", "广东省"]], "矿区": [["阳泉市", "山西省"]],
             "郊区": [["阳泉市", "山西省"], ["佳木斯市", "黑龙江省"], ["铜陵市", "安徽省"]], "平定县": [["阳泉市", "山西省"]], "盂县": [["阳泉市", "山西省"]],
             "潞州区": [["长治市", "山西省"]], "上党区": [["长治市", "山西省"]], "屯留区": [["长治市", "山西省"]], "潞城区": [["长治市", "山西省"]],
             "襄垣县": [["长治市", "山西省"]], "平顺县": [["长治市", "山西省"]], "黎城县": [["长治市", "山西省"]], "壶关县": [["长治市", "山西省"]],
             "长子县": [["长治市", "山西省"]], "武乡县": [["长治市", "山西省"]], "沁县": [["长治市", "山西省"]], "沁源县": [["长治市", "山西省"]],
             "山西长治高新技术产业园区": [["长治市", "山西省"]], "沁水县": [["晋城市", "山西省"]], "阳城县": [["晋城市", "山西省"]],
             "陵川县": [["晋城市", "山西省"]], "泽州县": [["晋城市", "山西省"]], "高平市": [["晋城市", "山西省"]], "朔城区": [["朔州市", "山西省"]],
             "平鲁区": [["朔州市", "山西省"]], "山阴县": [["朔州市", "山西省"]], "应县": [["朔州市", "山西省"]], "右玉县": [["朔州市", "山西省"]],
             "山西朔州经济开发区": [["朔州市", "山西省"]], "怀仁市": [["朔州市", "山西省"]], "榆次区": [["晋中市", "山西省"]], "榆社县": [["晋中市", "山西省"]],
             "左权县": [["晋中市", "山西省"]], "和顺县": [["晋中市", "山西省"]], "昔阳县": [["晋中市", "山西省"]], "寿阳县": [["晋中市", "山西省"]],
             "太谷县": [["晋中市", "山西省"]], "祁县": [["晋中市", "山西省"]], "平遥县": [["晋中市", "山西省"]], "灵石县": [["晋中市", "山西省"]],
             "介休市": [["晋中市", "山西省"]], "盐湖区": [["运城市", "山西省"]], "临猗县": [["运城市", "山西省"]], "万荣县": [["运城市", "山西省"]],
             "闻喜县": [["运城市", "山西省"]], "稷山县": [["运城市", "山西省"]], "新绛县": [["运城市", "山西省"]], "绛县": [["运城市", "山西省"]],
             "垣曲县": [["运城市", "山西省"]], "夏县": [["运城市", "山西省"]], "平陆县": [["运城市", "山西省"]], "芮城县": [["运城市", "山西省"]],
             "永济市": [["运城市", "山西省"]], "河津市": [["运城市", "山西省"]], "忻府区": [["忻州市", "山西省"]], "定襄县": [["忻州市", "山西省"]],
             "五台县": [["忻州市", "山西省"]], "代县": [["忻州市", "山西省"]], "繁峙县": [["忻州市", "山西省"]], "宁武县": [["忻州市", "山西省"]],
             "静乐县": [["忻州市", "山西省"]], "神池县": [["忻州市", "山西省"]], "五寨县": [["忻州市", "山西省"]], "岢岚县": [["忻州市", "山西省"]],
             "河曲县": [["忻州市", "山西省"]], "保德县": [["忻州市", "山西省"]], "偏关县": [["忻州市", "山西省"]], "五台山风景名胜区": [["忻州市", "山西省"]],
             "原平市": [["忻州市", "山西省"]], "尧都区": [["临汾市", "山西省"]], "曲沃县": [["临汾市", "山西省"]], "翼城县": [["临汾市", "山西省"]],
             "襄汾县": [["临汾市", "山西省"]], "洪洞县": [["临汾市", "山西省"]], "古县": [["临汾市", "山西省"]], "安泽县": [["临汾市", "山西省"]],
             "浮山县": [["临汾市", "山西省"]], "吉县": [["临汾市", "山西省"]], "乡宁县": [["临汾市", "山西省"]], "大宁县": [["临汾市", "山西省"]],
             "隰县": [["临汾市", "山西省"]], "永和县": [["临汾市", "山西省"]], "蒲县": [["临汾市", "山西省"]], "汾西县": [["临汾市", "山西省"]],
             "侯马市": [["临汾市", "山西省"]], "霍州市": [["临汾市", "山西省"]], "离石区": [["吕梁市", "山西省"]], "文水县": [["吕梁市", "山西省"]],
             "交城县": [["吕梁市", "山西省"]], "兴县": [["吕梁市", "山西省"]], "临县": [["吕梁市", "山西省"]], "柳林县": [["吕梁市", "山西省"]],
             "石楼县": [["吕梁市", "山西省"]], "岚县": [["吕梁市", "山西省"]], "方山县": [["吕梁市", "山西省"]], "中阳县": [["吕梁市", "山西省"]],
             "交口县": [["吕梁市", "山西省"]], "孝义市": [["吕梁市", "山西省"]], "汾阳市": [["吕梁市", "山西省"]],
             "新城区": [["呼和浩特市", "内蒙古自治区"], ["西安市", "陕西省"]], "回民区": [["呼和浩特市", "内蒙古自治区"]], "玉泉区": [["呼和浩特市", "内蒙古自治区"]],
             "赛罕区": [["呼和浩特市", "内蒙古自治区"]], "土默特左旗": [["呼和浩特市", "内蒙古自治区"]], "托克托县": [["呼和浩特市", "内蒙古自治区"]],
             "和林格尔县": [["呼和浩特市", "内蒙古自治区"]], "清水河县": [["呼和浩特市", "内蒙古自治区"]], "武川县": [["呼和浩特市", "内蒙古自治区"]],
             "呼和浩特金海工业园区": [["呼和浩特市", "内蒙古自治区"]], "呼和浩特经济技术开发区": [["呼和浩特市", "内蒙古自治区"]], "东河区": [["包头市", "内蒙古自治区"]],
             "昆都仑区": [["包头市", "内蒙古自治区"]], "青山区": [["包头市", "内蒙古自治区"], ["武汉市", "湖北省"]], "石拐区": [["包头市", "内蒙古自治区"]],
             "白云鄂博矿区": [["包头市", "内蒙古自治区"]], "九原区": [["包头市", "内蒙古自治区"]], "土默特右旗": [["包头市", "内蒙古自治区"]],
             "固阳县": [["包头市", "内蒙古自治区"]], "达尔罕茂明安联合旗": [["包头市", "内蒙古自治区"]], "包头稀土高新技术产业开发区": [["包头市", "内蒙古自治区"]],
             "海勃湾区": [["乌海市", "内蒙古自治区"]], "海南区": [["乌海市", "内蒙古自治区"]], "乌达区": [["乌海市", "内蒙古自治区"]],
             "红山区": [["赤峰市", "内蒙古自治区"]], "元宝山区": [["赤峰市", "内蒙古自治区"]], "松山区": [["赤峰市", "内蒙古自治区"]],
             "阿鲁科尔沁旗": [["赤峰市", "内蒙古自治区"]], "巴林左旗": [["赤峰市", "内蒙古自治区"]], "巴林右旗": [["赤峰市", "内蒙古自治区"]],
             "林西县": [["赤峰市", "内蒙古自治区"]], "克什克腾旗": [["赤峰市", "内蒙古自治区"]], "翁牛特旗": [["赤峰市", "内蒙古自治区"]],
             "喀喇沁旗": [["赤峰市", "内蒙古自治区"]], "宁城县": [["赤峰市", "内蒙古自治区"]], "敖汉旗": [["赤峰市", "内蒙古自治区"]],
             "科尔沁区": [["通辽市", "内蒙古自治区"]], "科尔沁左翼中旗": [["通辽市", "内蒙古自治区"]], "科尔沁左翼后旗": [["通辽市", "内蒙古自治区"]],
             "开鲁县": [["通辽市", "内蒙古自治区"]], "库伦旗": [["通辽市", "内蒙古自治区"]], "奈曼旗": [["通辽市", "内蒙古自治区"]],
             "扎鲁特旗": [["通辽市", "内蒙古自治区"]], "通辽经济技术开发区": [["通辽市", "内蒙古自治区"]], "霍林郭勒市": [["通辽市", "内蒙古自治区"]],
             "东胜区": [["鄂尔多斯市", "内蒙古自治区"]], "康巴什区": [["鄂尔多斯市", "内蒙古自治区"]], "达拉特旗": [["鄂尔多斯市", "内蒙古自治区"]],
             "准格尔旗": [["鄂尔多斯市", "内蒙古自治区"]], "鄂托克前旗": [["鄂尔多斯市", "内蒙古自治区"]], "鄂托克旗": [["鄂尔多斯市", "内蒙古自治区"]],
             "杭锦旗": [["鄂尔多斯市", "内蒙古自治区"]], "乌审旗": [["鄂尔多斯市", "内蒙古自治区"]], "伊金霍洛旗": [["鄂尔多斯市", "内蒙古自治区"]],
             "海拉尔区": [["呼伦贝尔市", "内蒙古自治区"]], "扎赉诺尔区": [["呼伦贝尔市", "内蒙古自治区"]], "阿荣旗": [["呼伦贝尔市", "内蒙古自治区"]],
             "莫力达瓦达斡尔族自治旗": [["呼伦贝尔市", "内蒙古自治区"]], "鄂伦春自治旗": [["呼伦贝尔市", "内蒙古自治区"]], "鄂温克族自治旗": [["呼伦贝尔市", "内蒙古自治区"]],
             "陈巴尔虎旗": [["呼伦贝尔市", "内蒙古自治区"]], "新巴尔虎左旗": [["呼伦贝尔市", "内蒙古自治区"]], "新巴尔虎右旗": [["呼伦贝尔市", "内蒙古自治区"]],
             "满洲里市": [["呼伦贝尔市", "内蒙古自治区"]], "牙克石市": [["呼伦贝尔市", "内蒙古自治区"]], "扎兰屯市": [["呼伦贝尔市", "内蒙古自治区"]],
             "额尔古纳市": [["呼伦贝尔市", "内蒙古自治区"]], "根河市": [["呼伦贝尔市", "内蒙古自治区"]], "临河区": [["巴彦淖尔市", "内蒙古自治区"]],
             "五原县": [["巴彦淖尔市", "内蒙古自治区"]], "磴口县": [["巴彦淖尔市", "内蒙古自治区"]], "乌拉特前旗": [["巴彦淖尔市", "内蒙古自治区"]],
             "乌拉特中旗": [["巴彦淖尔市", "内蒙古自治区"]], "乌拉特后旗": [["巴彦淖尔市", "内蒙古自治区"]], "杭锦后旗": [["巴彦淖尔市", "内蒙古自治区"]],
             "集宁区": [["乌兰察布市", "内蒙古自治区"]], "卓资县": [["乌兰察布市", "内蒙古自治区"]], "化德县": [["乌兰察布市", "内蒙古自治区"]],
             "商都县": [["乌兰察布市", "内蒙古自治区"]], "兴和县": [["乌兰察布市", "内蒙古自治区"]], "凉城县": [["乌兰察布市", "内蒙古自治区"]],
             "察哈尔右翼前旗": [["乌兰察布市", "内蒙古自治区"]], "察哈尔右翼中旗": [["乌兰察布市", "内蒙古自治区"]], "察哈尔右翼后旗": [["乌兰察布市", "内蒙古自治区"]],
             "四子王旗": [["乌兰察布市", "内蒙古自治区"]], "丰镇市": [["乌兰察布市", "内蒙古自治区"]], "乌兰浩特市": [["兴安盟", "内蒙古自治区"]],
             "阿尔山市": [["兴安盟", "内蒙古自治区"]], "科尔沁右翼前旗": [["兴安盟", "内蒙古自治区"]], "科尔沁右翼中旗": [["兴安盟", "内蒙古自治区"]],
             "扎赉特旗": [["兴安盟", "内蒙古自治区"]], "突泉县": [["兴安盟", "内蒙古自治区"]], "二连浩特市": [["锡林郭勒盟", "内蒙古自治区"]],
             "锡林浩特市": [["锡林郭勒盟", "内蒙古自治区"]], "阿巴嘎旗": [["锡林郭勒盟", "内蒙古自治区"]], "苏尼特左旗": [["锡林郭勒盟", "内蒙古自治区"]],
             "苏尼特右旗": [["锡林郭勒盟", "内蒙古自治区"]], "东乌珠穆沁旗": [["锡林郭勒盟", "内蒙古自治区"]], "西乌珠穆沁旗": [["锡林郭勒盟", "内蒙古自治区"]],
             "太仆寺旗": [["锡林郭勒盟", "内蒙古自治区"]], "镶黄旗": [["锡林郭勒盟", "内蒙古自治区"]], "正镶白旗": [["锡林郭勒盟", "内蒙古自治区"]],
             "正蓝旗": [["锡林郭勒盟", "内蒙古自治区"]], "多伦县": [["锡林郭勒盟", "内蒙古自治区"]], "乌拉盖管委会": [["锡林郭勒盟", "内蒙古自治区"]],
             "阿拉善左旗": [["阿拉善盟", "内蒙古自治区"]], "阿拉善右旗": [["阿拉善盟", "内蒙古自治区"]], "额济纳旗": [["阿拉善盟", "内蒙古自治区"]],
             "内蒙古阿拉善经济开发区": [["阿拉善盟", "内蒙古自治区"]], "沈河区": [["沈阳市", "辽宁省"]], "大东区": [["沈阳市", "辽宁省"]],
             "皇姑区": [["沈阳市", "辽宁省"]], "铁西区": [["沈阳市", "辽宁省"], ["鞍山市", "辽宁省"], ["四平市", "吉林省"]], "苏家屯区": [["沈阳市", "辽宁省"]],
             "浑南区": [["沈阳市", "辽宁省"]], "沈北新区": [["沈阳市", "辽宁省"]], "于洪区": [["沈阳市", "辽宁省"]], "辽中区": [["沈阳市", "辽宁省"]],
             "康平县": [["沈阳市", "辽宁省"]], "法库县": [["沈阳市", "辽宁省"]], "新民市": [["沈阳市", "辽宁省"]], "中山区": [["大连市", "辽宁省"]],
             "西岗区": [["大连市", "辽宁省"]], "沙河口区": [["大连市", "辽宁省"]], "甘井子区": [["大连市", "辽宁省"]], "旅顺口区": [["大连市", "辽宁省"]],
             "金州区": [["大连市", "辽宁省"]], "普兰店区": [["大连市", "辽宁省"]], "长海县": [["大连市", "辽宁省"]], "瓦房店市": [["大连市", "辽宁省"]],
             "庄河市": [["大连市", "辽宁省"]], "铁东区": [["鞍山市", "辽宁省"], ["四平市", "吉林省"]], "立山区": [["鞍山市", "辽宁省"]],
             "千山区": [["鞍山市", "辽宁省"]], "台安县": [["鞍山市", "辽宁省"]],"岫岩县": [["鞍山市", "辽宁省"]], "岫岩满族自治县": [["鞍山市", "辽宁省"]], "海城市": [["鞍山市", "辽宁省"]],
             "新抚区": [["抚顺市", "辽宁省"]], "东洲区": [["抚顺市", "辽宁省"]], "望花区": [["抚顺市", "辽宁省"]], "顺城区": [["抚顺市", "辽宁省"]],
             "抚顺县": [["抚顺市", "辽宁省"]],"新宾县": [["抚顺市", "辽宁省"]],  "新宾满族自治县": [["抚顺市", "辽宁省"]],"清原县": [["抚顺市", "辽宁省"]], "清原满族自治县": [["抚顺市", "辽宁省"]], "平山区": [["本溪市", "辽宁省"]],
             "溪湖区": [["本溪市", "辽宁省"]], "明山区": [["本溪市", "辽宁省"]], "南芬区": [["本溪市", "辽宁省"]],"本溪县": [["本溪市", "辽宁省"]], "本溪满族自治县": [["本溪市", "辽宁省"]],
             "桓仁县": [["本溪市", "辽宁省"]],"桓仁满族自治县": [["本溪市", "辽宁省"]], "元宝区": [["丹东市", "辽宁省"]], "振兴区": [["丹东市", "辽宁省"]], "振安区": [["丹东市", "辽宁省"]],
             "宽甸县": [["丹东市", "辽宁省"]],"宽甸满族自治县": [["丹东市", "辽宁省"]], "东港市": [["丹东市", "辽宁省"]], "凤城市": [["丹东市", "辽宁省"]], "古塔区": [["锦州市", "辽宁省"]],
             "凌河区": [["锦州市", "辽宁省"]], "太和区": [["锦州市", "辽宁省"]], "黑山县": [["锦州市", "辽宁省"]], "义县": [["锦州市", "辽宁省"]],
             "凌海市": [["锦州市", "辽宁省"]], "北镇市": [["锦州市", "辽宁省"]], "站前区": [["营口市", "辽宁省"]], "西市区": [["营口市", "辽宁省"]],
             "鲅鱼圈区": [["营口市", "辽宁省"]], "老边区": [["营口市", "辽宁省"]], "盖州市": [["营口市", "辽宁省"]], "大石桥市": [["营口市", "辽宁省"]],
             "海州区": [["阜新市", "辽宁省"], ["连云港市", "江苏省"]], "新邱区": [["阜新市", "辽宁省"]], "太平区": [["阜新市", "辽宁省"]],
             "清河门区": [["阜新市", "辽宁省"]], "细河区": [["阜新市", "辽宁省"]],"阜新县": [["阜新市", "辽宁省"]], "阜新蒙古族自治县": [["阜新市", "辽宁省"]], "彰武县": [["阜新市", "辽宁省"]],
             "白塔区": [["辽阳市", "辽宁省"]], "文圣区": [["辽阳市", "辽宁省"]], "宏伟区": [["辽阳市", "辽宁省"]], "弓长岭区": [["辽阳市", "辽宁省"]],
             "太子河区": [["辽阳市", "辽宁省"]], "辽阳县": [["辽阳市", "辽宁省"]], "灯塔市": [["辽阳市", "辽宁省"]], "双台子区": [["盘锦市", "辽宁省"]],
             "兴隆台区": [["盘锦市", "辽宁省"]], "大洼区": [["盘锦市", "辽宁省"]], "盘山县": [["盘锦市", "辽宁省"]], "银州区": [["铁岭市", "辽宁省"]],
             "清河区": [["铁岭市", "辽宁省"]], "铁岭县": [["铁岭市", "辽宁省"]], "西丰县": [["铁岭市", "辽宁省"]], "昌图县": [["铁岭市", "辽宁省"]],
             "调兵山市": [["铁岭市", "辽宁省"]], "开原市": [["铁岭市", "辽宁省"]], "双塔区": [["朝阳市", "辽宁省"]], "龙城区": [["朝阳市", "辽宁省"]],
             "朝阳县": [["朝阳市", "辽宁省"]], "建平县": [["朝阳市", "辽宁省"]],"喀喇沁县": [["朝阳市", "辽宁省"]], "喀喇沁左翼蒙古族自治县": [["朝阳市", "辽宁省"]], "北票市": [["朝阳市", "辽宁省"]],
             "凌源市": [["朝阳市", "辽宁省"]], "连山区": [["葫芦岛市", "辽宁省"]], "龙港区": [["葫芦岛市", "辽宁省"]], "南票区": [["葫芦岛市", "辽宁省"]],
             "绥中县": [["葫芦岛市", "辽宁省"]], "建昌县": [["葫芦岛市", "辽宁省"]], "兴城市": [["葫芦岛市", "辽宁省"]], "南关区": [["长春市", "吉林省"]],
             "宽城区": [["长春市", "吉林省"]], "二道区": [["长春市", "吉林省"]], "绿园区": [["长春市", "吉林省"]], "双阳区": [["长春市", "吉林省"]],
             "九台区": [["长春市", "吉林省"]], "农安县": [["长春市", "吉林省"]], "长春经济技术开发区": [["长春市", "吉林省"]],
             "长春净月高新技术产业开发区": [["长春市", "吉林省"]], "长春高新技术产业开发区": [["长春市", "吉林省"]], "长春汽车经济技术开发区": [["长春市", "吉林省"]],
             "榆树市": [["长春市", "吉林省"]], "德惠市": [["长春市", "吉林省"]], "昌邑区": [["吉林市", "吉林省"]], "龙潭区": [["吉林市", "吉林省"]],
             "船营区": [["吉林市", "吉林省"]], "丰满区": [["吉林市", "吉林省"]], "永吉县": [["吉林市", "吉林省"]], "吉林经济开发区": [["吉林市", "吉林省"]],
             "吉林高新技术产业开发区": [["吉林市", "吉林省"]], "吉林中国新加坡食品区": [["吉林市", "吉林省"]], "蛟河市": [["吉林市", "吉林省"]],
             "桦甸市": [["吉林市", "吉林省"]], "舒兰市": [["吉林市", "吉林省"]], "磐石市": [["吉林市", "吉林省"]], "梨树县": [["四平市", "吉林省"]],
             "伊通县": [["四平市", "吉林省"]],"伊通满族自治县": [["四平市", "吉林省"]], "公主岭市": [["四平市", "吉林省"]], "双辽市": [["四平市", "吉林省"]], "龙山区": [["辽源市", "吉林省"]],
             "西安区": [["辽源市", "吉林省"], ["牡丹江市", "黑龙江省"]], "东丰县": [["辽源市", "吉林省"]], "东辽县": [["辽源市", "吉林省"]],
             "东昌区": [["通化市", "吉林省"]], "二道江区": [["通化市", "吉林省"]], "通化县": [["通化市", "吉林省"]], "辉南县": [["通化市", "吉林省"]],
             "柳河县": [["通化市", "吉林省"]], "梅河口市": [["通化市", "吉林省"]], "集安市": [["通化市", "吉林省"]], "浑江区": [["白山市", "吉林省"]],
             "江源区": [["白山市", "吉林省"]], "抚松县": [["白山市", "吉林省"]], "靖宇县": [["白山市", "吉林省"]],"长白县": [["白山市", "吉林省"]], "长白朝鲜族自治县": [["白山市", "吉林省"]],
             "临江市": [["白山市", "吉林省"]], "宁江区": [["松原市", "吉林省"]],"前郭尔罗斯": [["松原市", "吉林省"]], "前郭尔罗斯蒙古族自治县": [["松原市", "吉林省"]], "长岭县": [["松原市", "吉林省"]],
             "乾安县": [["松原市", "吉林省"]], "吉林松原经济开发区": [["松原市", "吉林省"]], "扶余市": [["松原市", "吉林省"]], "洮北区": [["白城市", "吉林省"]],
             "镇赉县": [["白城市", "吉林省"]], "通榆县": [["白城市", "吉林省"]], "吉林白城经济开发区": [["白城市", "吉林省"]], "洮南市": [["白城市", "吉林省"]],
             "大安市": [["白城市", "吉林省"]], "延吉市": [["延边朝鲜族自治州", "吉林省"]], "图们市": [["延边朝鲜族自治州", "吉林省"]],
             "敦化市": [["延边朝鲜族自治州", "吉林省"]], "珲春市": [["延边朝鲜族自治州", "吉林省"]], "龙井市": [["延边朝鲜族自治州", "吉林省"]],
             "和龙市": [["延边朝鲜族自治州", "吉林省"]], "汪清县": [["延边朝鲜族自治州", "吉林省"]], "安图县": [["延边朝鲜族自治州", "吉林省"]],
             "道里区": [["哈尔滨市", "黑龙江省"]], "南岗区": [["哈尔滨市", "黑龙江省"]], "道外区": [["哈尔滨市", "黑龙江省"]], "平房区": [["哈尔滨市", "黑龙江省"]],
             "松北区": [["哈尔滨市", "黑龙江省"]], "香坊区": [["哈尔滨市", "黑龙江省"]], "呼兰区": [["哈尔滨市", "黑龙江省"]], "阿城区": [["哈尔滨市", "黑龙江省"]],
             "双城区": [["哈尔滨市", "黑龙江省"]], "依兰县": [["哈尔滨市", "黑龙江省"]], "方正县": [["哈尔滨市", "黑龙江省"]], "宾县": [["哈尔滨市", "黑龙江省"]],
             "巴彦县": [["哈尔滨市", "黑龙江省"]], "木兰县": [["哈尔滨市", "黑龙江省"]], "通河县": [["哈尔滨市", "黑龙江省"]], "延寿县": [["哈尔滨市", "黑龙江省"]],
             "尚志市": [["哈尔滨市", "黑龙江省"]], "五常市": [["哈尔滨市", "黑龙江省"]], "龙沙区": [["齐齐哈尔市", "黑龙江省"]],
             "建华区": [["齐齐哈尔市", "黑龙江省"]], "铁锋区": [["齐齐哈尔市", "黑龙江省"]], "昂昂溪区": [["齐齐哈尔市", "黑龙江省"]],
             "富拉尔基区": [["齐齐哈尔市", "黑龙江省"]], "碾子山区": [["齐齐哈尔市", "黑龙江省"]], "梅里斯达斡尔族区": [["齐齐哈尔市", "黑龙江省"]],
             "龙江县": [["齐齐哈尔市", "黑龙江省"]], "依安县": [["齐齐哈尔市", "黑龙江省"]], "泰来县": [["齐齐哈尔市", "黑龙江省"]],
             "甘南县": [["齐齐哈尔市", "黑龙江省"]], "富裕县": [["齐齐哈尔市", "黑龙江省"]], "克山县": [["齐齐哈尔市", "黑龙江省"]],
             "克东县": [["齐齐哈尔市", "黑龙江省"]], "拜泉县": [["齐齐哈尔市", "黑龙江省"]], "讷河市": [["齐齐哈尔市", "黑龙江省"]],
             "鸡冠区": [["鸡西市", "黑龙江省"]], "恒山区": [["鸡西市", "黑龙江省"]], "滴道区": [["鸡西市", "黑龙江省"]], "梨树区": [["鸡西市", "黑龙江省"]],
             "城子河区": [["鸡西市", "黑龙江省"]], "麻山区": [["鸡西市", "黑龙江省"]], "鸡东县": [["鸡西市", "黑龙江省"]], "虎林市": [["鸡西市", "黑龙江省"]],
             "密山市": [["鸡西市", "黑龙江省"]], "向阳区": [["鹤岗市", "黑龙江省"], ["佳木斯市", "黑龙江省"]], "工农区": [["鹤岗市", "黑龙江省"]],
             "南山区": [["鹤岗市", "黑龙江省"], ["深圳市", "广东省"]], "兴安区": [["鹤岗市", "黑龙江省"]], "东山区": [["鹤岗市", "黑龙江省"]],
             "兴山区": [["鹤岗市", "黑龙江省"]], "萝北县": [["鹤岗市", "黑龙江省"]], "绥滨县": [["鹤岗市", "黑龙江省"]], "尖山区": [["双鸭山市", "黑龙江省"]],
             "岭东区": [["双鸭山市", "黑龙江省"]], "四方台区": [["双鸭山市", "黑龙江省"]], "宝山区": [["双鸭山市", "黑龙江省"], ["上海市", "上海市"]],
             "集贤县": [["双鸭山市", "黑龙江省"]], "友谊县": [["双鸭山市", "黑龙江省"]], "宝清县": [["双鸭山市", "黑龙江省"]], "饶河县": [["双鸭山市", "黑龙江省"]],
             "萨尔图区": [["大庆市", "黑龙江省"]], "龙凤区": [["大庆市", "黑龙江省"]], "让胡路区": [["大庆市", "黑龙江省"]], "红岗区": [["大庆市", "黑龙江省"]],
             "大同区": [["大庆市", "黑龙江省"]], "肇州县": [["大庆市", "黑龙江省"]], "肇源县": [["大庆市", "黑龙江省"]], "林甸县": [["大庆市", "黑龙江省"]],
             "杜尔伯特县": [["大庆市", "黑龙江省"]],"杜尔伯特蒙古族自治县": [["大庆市", "黑龙江省"]], "大庆高新技术产业开发区": [["大庆市", "黑龙江省"]], "伊美区": [["伊春市", "黑龙江省"]],
             "乌翠区": [["伊春市", "黑龙江省"]], "友好区": [["伊春市", "黑龙江省"]], "嘉荫县": [["伊春市", "黑龙江省"]], "汤旺县": [["伊春市", "黑龙江省"]],
             "丰林县": [["伊春市", "黑龙江省"]], "大箐山县": [["伊春市", "黑龙江省"]], "南岔县": [["伊春市", "黑龙江省"]], "金林区": [["伊春市", "黑龙江省"]],
             "铁力市": [["伊春市", "黑龙江省"]], "前进区": [["佳木斯市", "黑龙江省"]], "东风区": [["佳木斯市", "黑龙江省"]], "桦南县": [["佳木斯市", "黑龙江省"]],
             "桦川县": [["佳木斯市", "黑龙江省"]], "汤原县": [["佳木斯市", "黑龙江省"]], "同江市": [["佳木斯市", "黑龙江省"]], "富锦市": [["佳木斯市", "黑龙江省"]],
             "抚远市": [["佳木斯市", "黑龙江省"]], "新兴区": [["七台河市", "黑龙江省"]], "桃山区": [["七台河市", "黑龙江省"]],
             "茄子河区": [["七台河市", "黑龙江省"]], "勃利县": [["七台河市", "黑龙江省"]], "东安区": [["牡丹江市", "黑龙江省"]],
             "阳明区": [["牡丹江市", "黑龙江省"]], "爱民区": [["牡丹江市", "黑龙江省"]], "林口县": [["牡丹江市", "黑龙江省"]],
             "牡丹江经济技术开发区": [["牡丹江市", "黑龙江省"]], "绥芬河市": [["牡丹江市", "黑龙江省"]], "海林市": [["牡丹江市", "黑龙江省"]],
             "宁安市": [["牡丹江市", "黑龙江省"]], "穆棱市": [["牡丹江市", "黑龙江省"]], "东宁市": [["牡丹江市", "黑龙江省"]], "爱辉区": [["黑河市", "黑龙江省"]],
             "逊克县": [["黑河市", "黑龙江省"]], "孙吴县": [["黑河市", "黑龙江省"]], "北安市": [["黑河市", "黑龙江省"]], "五大连池市": [["黑河市", "黑龙江省"]],
             "嫩江市": [["黑河市", "黑龙江省"]], "北林区": [["绥化市", "黑龙江省"]], "望奎县": [["绥化市", "黑龙江省"]], "兰西县": [["绥化市", "黑龙江省"]],
             "青冈县": [["绥化市", "黑龙江省"]], "庆安县": [["绥化市", "黑龙江省"]], "明水县": [["绥化市", "黑龙江省"]], "绥棱县": [["绥化市", "黑龙江省"]],
             "安达市": [["绥化市", "黑龙江省"]], "肇东市": [["绥化市", "黑龙江省"]], "海伦市": [["绥化市", "黑龙江省"]], "漠河市": [["大兴安岭地区", "黑龙江省"]],
             "呼玛县": [["大兴安岭地区", "黑龙江省"]], "塔河县": [["大兴安岭地区", "黑龙江省"]], "加格达奇区": [["大兴安岭地区", "黑龙江省"]],
             "松岭区": [["大兴安岭地区", "黑龙江省"]], "新林区": [["大兴安岭地区", "黑龙江省"]], "呼中区": [["大兴安岭地区", "黑龙江省"]],
             "黄浦区": [["上海市", "上海市"]], "徐汇区": [["上海市", "上海市"]], "长宁区": [["上海市", "上海市"]], "静安区": [["上海市", "上海市"]],
             "普陀区": [["上海市", "上海市"], ["舟山市", "浙江省"]], "虹口区": [["上海市", "上海市"]], "杨浦区": [["上海市", "上海市"]],
             "闵行区": [["上海市", "上海市"]], "嘉定区": [["上海市", "上海市"]], "浦东新区": [["上海市", "上海市"]], "金山区": [["上海市", "上海市"]],
             "松江区": [["上海市", "上海市"]], "青浦区": [["上海市", "上海市"]], "奉贤区": [["上海市", "上海市"]], "崇明区": [["上海市", "上海市"]],
             "玄武区": [["南京市", "江苏省"]], "秦淮区": [["南京市", "江苏省"]], "建邺区": [["南京市", "江苏省"]],
             "鼓楼区": [["南京市", "江苏省"], ["徐州市", "江苏省"], ["福州市", "福建省"], ["开封市", "河南省"]], "浦口区": [["南京市", "江苏省"]],
             "栖霞区": [["南京市", "江苏省"]], "雨花台区": [["南京市", "江苏省"]], "江宁区": [["南京市", "江苏省"]], "六合区": [["南京市", "江苏省"]],
             "溧水区": [["南京市", "江苏省"]], "高淳区": [["南京市", "江苏省"]], "锡山区": [["无锡市", "江苏省"]], "惠山区": [["无锡市", "江苏省"]],
             "滨湖区": [["无锡市", "江苏省"]], "梁溪区": [["无锡市", "江苏省"]], "新吴区": [["无锡市", "江苏省"]], "江阴市": [["无锡市", "江苏省"]],
             "宜兴市": [["无锡市", "江苏省"]], "云龙区": [["徐州市", "江苏省"]], "贾汪区": [["徐州市", "江苏省"]], "泉山区": [["徐州市", "江苏省"]],
             "铜山区": [["徐州市", "江苏省"]], "丰县": [["徐州市", "江苏省"]], "沛县": [["徐州市", "江苏省"]], "睢宁县": [["徐州市", "江苏省"]],
             "徐州经济技术开发区": [["徐州市", "江苏省"]], "新沂市": [["徐州市", "江苏省"]], "邳州市": [["徐州市", "江苏省"]], "天宁区": [["常州市", "江苏省"]],
             "钟楼区": [["常州市", "江苏省"]], "新北区": [["常州市", "江苏省"]], "武进区": [["常州市", "江苏省"]], "金坛区": [["常州市", "江苏省"]],
             "溧阳市": [["常州市", "江苏省"]], "虎丘区": [["苏州市", "江苏省"]], "吴中区": [["苏州市", "江苏省"]], "相城区": [["苏州市", "江苏省"]],
             "姑苏区": [["苏州市", "江苏省"]], "吴江区": [["苏州市", "江苏省"]], "苏州工业园区": [["苏州市", "江苏省"]], "常熟市": [["苏州市", "江苏省"]],
             "张家港市": [["苏州市", "江苏省"]], "昆山市": [["苏州市", "江苏省"]], "太仓市": [["苏州市", "江苏省"]], "崇川区": [["南通市", "江苏省"]],
             "港闸区": [["南通市", "江苏省"]], "如东县": [["南通市", "江苏省"]], "南通经济技术开发区": [["南通市", "江苏省"]], "启东市": [["南通市", "江苏省"]],
             "如皋市": [["南通市", "江苏省"]], "海门市": [["南通市", "江苏省"]], "海安县": [["南通市", "江苏省"]], "海安市": [["南通市", "江苏省"]],
             "连云区": [["连云港市", "江苏省"]],
             "赣榆区": [["连云港市", "江苏省"]], "东海县": [["连云港市", "江苏省"]], "灌云县": [["连云港市", "江苏省"]], "灌南县": [["连云港市", "江苏省"]],
             "连云港经济技术开发区": [["连云港市", "江苏省"]], "连云港高新技术产业开发区": [["连云港市", "江苏省"]], "淮安区": [["淮安市", "江苏省"]],
             "淮阴区": [["淮安市", "江苏省"]], "清江浦区": [["淮安市", "江苏省"]], "洪泽区": [["淮安市", "江苏省"]], "涟水县": [["淮安市", "江苏省"]],
             "盱眙县": [["淮安市", "江苏省"]], "金湖县": [["淮安市", "江苏省"]], "淮安经济技术开发区": [["淮安市", "江苏省"]], "亭湖区": [["盐城市", "江苏省"]],
             "盐都区": [["盐城市", "江苏省"]], "大丰区": [["盐城市", "江苏省"]], "响水县": [["盐城市", "江苏省"]], "滨海县": [["盐城市", "江苏省"]],
             "阜宁县": [["盐城市", "江苏省"]], "射阳县": [["盐城市", "江苏省"]], "建湖县": [["盐城市", "江苏省"]], "盐城经济技术开发区": [["盐城市", "江苏省"]],
             "东台市": [["盐城市", "江苏省"]], "广陵区": [["扬州市", "江苏省"]], "邗江区": [["扬州市", "江苏省"]], "江都区": [["扬州市", "江苏省"]],
             "宝应县": [["扬州市", "江苏省"]], "扬州经济技术开发区": [["扬州市", "江苏省"]], "仪征市": [["扬州市", "江苏省"]], "高邮市": [["扬州市", "江苏省"]],
             "京口区": [["镇江市", "江苏省"]], "润州区": [["镇江市", "江苏省"]], "丹徒区": [["镇江市", "江苏省"]], "镇江新区": [["镇江市", "江苏省"]],
             "丹阳市": [["镇江市", "江苏省"]], "扬中市": [["镇江市", "江苏省"]], "句容市": [["镇江市", "江苏省"]], "海陵区": [["泰州市", "江苏省"]],
             "高港区": [["泰州市", "江苏省"]], "姜堰区": [["泰州市", "江苏省"]], "泰州医药高新技术产业开发区": [["泰州市", "江苏省"]],
             "兴化市": [["泰州市", "江苏省"]], "靖江市": [["泰州市", "江苏省"]], "泰兴市": [["泰州市", "江苏省"]], "宿城区": [["宿迁市", "江苏省"]],
             "宿豫区": [["宿迁市", "江苏省"]], "沭阳县": [["宿迁市", "江苏省"]], "泗阳县": [["宿迁市", "江苏省"]], "泗洪县": [["宿迁市", "江苏省"]],
             "宿迁经济技术开发区": [["宿迁市", "江苏省"]], "上城区": [["杭州市", "浙江省"]], "下城区": [["杭州市", "浙江省"]], "江干区": [["杭州市", "浙江省"]],
             "拱墅区": [["杭州市", "浙江省"]], "西湖区": [["杭州市", "浙江省"], ["南昌市", "江西省"]], "滨江区": [["杭州市", "浙江省"]],
             "萧山区": [["杭州市", "浙江省"]], "余杭区": [["杭州市", "浙江省"]], "富阳区": [["杭州市", "浙江省"]], "临安区": [["杭州市", "浙江省"]],
             "桐庐县": [["杭州市", "浙江省"]], "淳安县": [["杭州市", "浙江省"]], "建德市": [["杭州市", "浙江省"]], "海曙区": [["宁波市", "浙江省"]],
             "江北区": [["宁波市", "浙江省"], ["重庆市", "重庆市"]], "北仑区": [["宁波市", "浙江省"]], "镇海区": [["宁波市", "浙江省"]],
             "鄞州区": [["宁波市", "浙江省"]], "奉化区": [["宁波市", "浙江省"]], "象山县": [["宁波市", "浙江省"]], "宁海县": [["宁波市", "浙江省"]],
             "余姚市": [["宁波市", "浙江省"]], "慈溪市": [["宁波市", "浙江省"]], "鹿城区": [["温州市", "浙江省"]], "龙湾区": [["温州市", "浙江省"]],
             "瓯海区": [["温州市", "浙江省"]], "洞头区": [["温州市", "浙江省"]], "永嘉县": [["温州市", "浙江省"]], "平阳县": [["温州市", "浙江省"]],
             "苍南县": [["温州市", "浙江省"]], "文成县": [["温州市", "浙江省"]], "泰顺县": [["温州市", "浙江省"]], "温州经济技术开发区": [["温州市", "浙江省"]],
             "瑞安市": [["温州市", "浙江省"]], "乐清市": [["温州市", "浙江省"]], "龙港市": [["温州市", "浙江省"]], "南湖区": [["嘉兴市", "浙江省"]],
             "秀洲区": [["嘉兴市", "浙江省"]], "嘉善县": [["嘉兴市", "浙江省"]], "海盐县": [["嘉兴市", "浙江省"]], "海宁市": [["嘉兴市", "浙江省"]],
             "平湖市": [["嘉兴市", "浙江省"]], "桐乡市": [["嘉兴市", "浙江省"]], "吴兴区": [["湖州市", "浙江省"]], "南浔区": [["湖州市", "浙江省"]],
             "德清县": [["湖州市", "浙江省"]], "长兴县": [["湖州市", "浙江省"]], "安吉县": [["湖州市", "浙江省"]], "越城区": [["绍兴市", "浙江省"]],
             "柯桥区": [["绍兴市", "浙江省"]], "上虞区": [["绍兴市", "浙江省"]], "新昌县": [["绍兴市", "浙江省"]], "诸暨市": [["绍兴市", "浙江省"]],
             "嵊州市": [["绍兴市", "浙江省"]], "婺城区": [["金华市", "浙江省"]], "金东区": [["金华市", "浙江省"]], "武义县": [["金华市", "浙江省"]],
             "浦江县": [["金华市", "浙江省"]], "磐安县": [["金华市", "浙江省"]], "兰溪市": [["金华市", "浙江省"]], "义乌市": [["金华市", "浙江省"]],
             "东阳市": [["金华市", "浙江省"]], "永康市": [["金华市", "浙江省"]], "柯城区": [["衢州市", "浙江省"]], "衢江区": [["衢州市", "浙江省"]],
             "常山县": [["衢州市", "浙江省"]], "开化县": [["衢州市", "浙江省"]], "龙游县": [["衢州市", "浙江省"]], "江山市": [["衢州市", "浙江省"]],
             "定海区": [["舟山市", "浙江省"]], "岱山县": [["舟山市", "浙江省"]], "嵊泗县": [["舟山市", "浙江省"]], "椒江区": [["台州市", "浙江省"]],
             "黄岩区": [["台州市", "浙江省"]], "路桥区": [["台州市", "浙江省"]], "三门县": [["台州市", "浙江省"]], "天台县": [["台州市", "浙江省"]],
             "仙居县": [["台州市", "浙江省"]], "温岭市": [["台州市", "浙江省"]], "临海市": [["台州市", "浙江省"]], "玉环市": [["台州市", "浙江省"]],
             "莲都区": [["丽水市", "浙江省"]], "青田县": [["丽水市", "浙江省"]], "缙云县": [["丽水市", "浙江省"]], "遂昌县": [["丽水市", "浙江省"]],
             "松阳县": [["丽水市", "浙江省"]], "云和县": [["丽水市", "浙江省"]], "庆元县": [["丽水市", "浙江省"]], "景宁县": [["丽水市", "浙江省"]],"景宁畲族自治县": [["丽水市", "浙江省"]],
             "龙泉市": [["丽水市", "浙江省"]], "瑶海区": [["合肥市", "安徽省"]], "庐阳区": [["合肥市", "安徽省"]], "蜀山区": [["合肥市", "安徽省"]],
             "包河区": [["合肥市", "安徽省"]], "长丰县": [["合肥市", "安徽省"]], "肥东县": [["合肥市", "安徽省"]], "肥西县": [["合肥市", "安徽省"]],
             "庐江县": [["合肥市", "安徽省"]], "合肥高新技术产业开发区": [["合肥市", "安徽省"]], "合肥经济技术开发区": [["合肥市", "安徽省"]],
             "合肥新站高新技术产业开发区": [["合肥市", "安徽省"]], "巢湖市": [["合肥市", "安徽省"]], "镜湖区": [["芜湖市", "安徽省"]],
             "弋江区": [["芜湖市", "安徽省"]], "鸠江区": [["芜湖市", "安徽省"]], "三山区": [["芜湖市", "安徽省"]], "芜湖县": [["芜湖市", "安徽省"]],
             "繁昌县": [["芜湖市", "安徽省"]], "南陵县": [["芜湖市", "安徽省"]], "无为县": [["芜湖市", "安徽省"]], "芜湖经济技术开发区": [["芜湖市", "安徽省"]],
             "安徽芜湖长江大桥经济开发区": [["芜湖市", "安徽省"]], "龙子湖区": [["蚌埠市", "安徽省"]], "蚌山区": [["蚌埠市", "安徽省"]],
             "禹会区": [["蚌埠市", "安徽省"]], "淮上区": [["蚌埠市", "安徽省"]], "怀远县": [["蚌埠市", "安徽省"]], "五河县": [["蚌埠市", "安徽省"]],
             "固镇县": [["蚌埠市", "安徽省"]], "蚌埠市高新技术开发区": [["蚌埠市", "安徽省"]], "蚌埠市经济开发区": [["蚌埠市", "安徽省"]],
             "大通区": [["淮南市", "安徽省"]], "田家庵区": [["淮南市", "安徽省"]], "谢家集区": [["淮南市", "安徽省"]], "八公山区": [["淮南市", "安徽省"]],
             "潘集区": [["淮南市", "安徽省"]], "凤台县": [["淮南市", "安徽省"]], "寿县": [["淮南市", "安徽省"]], "花山区": [["马鞍山市", "安徽省"]],
             "雨山区": [["马鞍山市", "安徽省"]], "博望区": [["马鞍山市", "安徽省"]], "当涂县": [["马鞍山市", "安徽省"]], "含山县": [["马鞍山市", "安徽省"]],
             "和县": [["马鞍山市", "安徽省"]], "杜集区": [["淮北市", "安徽省"]], "相山区": [["淮北市", "安徽省"]], "烈山区": [["淮北市", "安徽省"]],
             "濉溪县": [["淮北市", "安徽省"]], "铜官区": [["铜陵市", "安徽省"]], "义安区": [["铜陵市", "安徽省"]], "枞阳县": [["铜陵市", "安徽省"]],
             "迎江区": [["安庆市", "安徽省"]], "大观区": [["安庆市", "安徽省"]], "宜秀区": [["安庆市", "安徽省"]], "怀宁县": [["安庆市", "安徽省"]],
             "太湖县": [["安庆市", "安徽省"]], "宿松县": [["安庆市", "安徽省"]], "望江县": [["安庆市", "安徽省"]], "岳西县": [["安庆市", "安徽省"]],
             "安徽安庆经济开发区": [["安庆市", "安徽省"]], "桐城市": [["安庆市", "安徽省"]], "潜山县": [["安庆市", "安徽省"]], "潜山市": [["安庆市", "安徽省"]],
             "屯溪区": [["黄山市", "安徽省"]],
             "黄山区": [["黄山市", "安徽省"]], "徽州区": [["黄山市", "安徽省"]], "歙县": [["黄山市", "安徽省"]], "休宁县": [["黄山市", "安徽省"]],
             "黟县": [["黄山市", "安徽省"]], "祁门县": [["黄山市", "安徽省"]], "琅琊区": [["滁州市", "安徽省"]], "南谯区": [["滁州市", "安徽省"]],
             "来安县": [["滁州市", "安徽省"]], "全椒县": [["滁州市", "安徽省"]], "定远县": [["滁州市", "安徽省"]], "凤阳县": [["滁州市", "安徽省"]],
             "苏滁现代产业园": [["滁州市", "安徽省"]], "滁州经济技术开发区": [["滁州市", "安徽省"]], "天长市": [["滁州市", "安徽省"]],
             "明光市": [["滁州市", "安徽省"]], "颍州区": [["阜阳市", "安徽省"]], "颍东区": [["阜阳市", "安徽省"]], "颍泉区": [["阜阳市", "安徽省"]],
             "临泉县": [["阜阳市", "安徽省"]], "太和县": [["阜阳市", "安徽省"]], "阜南县": [["阜阳市", "安徽省"]], "颍上县": [["阜阳市", "安徽省"]],
             "阜阳合肥现代产业园区": [["阜阳市", "安徽省"]], "阜阳经济技术开发区": [["阜阳市", "安徽省"]], "界首市": [["阜阳市", "安徽省"]],
             "埇桥区": [["宿州市", "安徽省"]], "砀山县": [["宿州市", "安徽省"]], "萧县": [["宿州市", "安徽省"]], "灵璧县": [["宿州市", "安徽省"]],
             "泗县": [["宿州市", "安徽省"]], "宿州马鞍山现代产业园区": [["宿州市", "安徽省"]], "宿州经济技术开发区": [["宿州市", "安徽省"]],
             "金安区": [["六安市", "安徽省"]], "裕安区": [["六安市", "安徽省"]], "叶集区": [["六安市", "安徽省"]], "霍邱县": [["六安市", "安徽省"]],
             "舒城县": [["六安市", "安徽省"]], "金寨县": [["六安市", "安徽省"]], "霍山县": [["六安市", "安徽省"]], "谯城区": [["亳州市", "安徽省"]],
             "涡阳县": [["亳州市", "安徽省"]], "蒙城县": [["亳州市", "安徽省"]], "利辛县": [["亳州市", "安徽省"]], "贵池区": [["池州市", "安徽省"]],
             "东至县": [["池州市", "安徽省"]], "石台县": [["池州市", "安徽省"]], "青阳县": [["池州市", "安徽省"]], "宣州区": [["宣城市", "安徽省"]],
             "郎溪县": [["宣城市", "安徽省"]], "泾县": [["宣城市", "安徽省"]], "绩溪县": [["宣城市", "安徽省"]], "旌德县": [["宣城市", "安徽省"]],
             "宣城市经济开发区": [["宣城市", "安徽省"]], "宁国市": [["宣城市", "安徽省"]], "广德县": [["宣城市", "安徽省"]], "广德市": [["宣城市", "安徽省"]],
             "台江区": [["福州市", "福建省"]],
             "仓山区": [["福州市", "福建省"]], "马尾区": [["福州市", "福建省"]], "晋安区": [["福州市", "福建省"]], "长乐区": [["福州市", "福建省"]],
             "闽侯县": [["福州市", "福建省"]], "连江县": [["福州市", "福建省"]], "罗源县": [["福州市", "福建省"]], "闽清县": [["福州市", "福建省"]],
             "永泰县": [["福州市", "福建省"]], "平潭县": [["福州市", "福建省"]], "福清市": [["福州市", "福建省"]], "思明区": [["厦门市", "福建省"]],
             "海沧区": [["厦门市", "福建省"]], "湖里区": [["厦门市", "福建省"]], "集美区": [["厦门市", "福建省"]], "同安区": [["厦门市", "福建省"]],
             "翔安区": [["厦门市", "福建省"]], "城厢区": [["莆田市", "福建省"]], "涵江区": [["莆田市", "福建省"]], "荔城区": [["莆田市", "福建省"]],
             "秀屿区": [["莆田市", "福建省"]], "仙游县": [["莆田市", "福建省"]], "梅列区": [["三明市", "福建省"]], "三元区": [["三明市", "福建省"]],
             "明溪县": [["三明市", "福建省"]], "清流县": [["三明市", "福建省"]], "宁化县": [["三明市", "福建省"]], "大田县": [["三明市", "福建省"]],
             "尤溪县": [["三明市", "福建省"]], "沙县": [["三明市", "福建省"]], "将乐县": [["三明市", "福建省"]], "泰宁县": [["三明市", "福建省"]],
             "建宁县": [["三明市", "福建省"]], "永安市": [["三明市", "福建省"]], "鲤城区": [["泉州市", "福建省"]], "丰泽区": [["泉州市", "福建省"]],
             "洛江区": [["泉州市", "福建省"]], "泉港区": [["泉州市", "福建省"]], "惠安县": [["泉州市", "福建省"]], "安溪县": [["泉州市", "福建省"]],
             "永春县": [["泉州市", "福建省"]], "德化县": [["泉州市", "福建省"]], "石狮市": [["泉州市", "福建省"]], "晋江市": [["泉州市", "福建省"]],
             "南安市": [["泉州市", "福建省"]], "芗城区": [["漳州市", "福建省"]], "龙文区": [["漳州市", "福建省"]], "云霄县": [["漳州市", "福建省"]],
             "漳浦县": [["漳州市", "福建省"]], "诏安县": [["漳州市", "福建省"]], "长泰县": [["漳州市", "福建省"]], "东山县": [["漳州市", "福建省"]],
             "南靖县": [["漳州市", "福建省"]], "平和县": [["漳州市", "福建省"]], "华安县": [["漳州市", "福建省"]], "龙海市": [["漳州市", "福建省"]],
             "延平区": [["南平市", "福建省"]], "建阳区": [["南平市", "福建省"]], "顺昌县": [["南平市", "福建省"]], "浦城县": [["南平市", "福建省"]],
             "光泽县": [["南平市", "福建省"]], "松溪县": [["南平市", "福建省"]], "政和县": [["南平市", "福建省"]], "邵武市": [["南平市", "福建省"]],
             "武夷山市": [["南平市", "福建省"]], "建瓯市": [["南平市", "福建省"]], "新罗区": [["龙岩市", "福建省"]],
             "永定区": [["龙岩市", "福建省"], ["张家界市", "湖南省"]], "长汀县": [["龙岩市", "福建省"]], "上杭县": [["龙岩市", "福建省"]],
             "武平县": [["龙岩市", "福建省"]], "连城县": [["龙岩市", "福建省"]], "漳平市": [["龙岩市", "福建省"]], "蕉城区": [["宁德市", "福建省"]],
             "霞浦县": [["宁德市", "福建省"]], "古田县": [["宁德市", "福建省"]], "屏南县": [["宁德市", "福建省"]], "寿宁县": [["宁德市", "福建省"]],
             "周宁县": [["宁德市", "福建省"]], "柘荣县": [["宁德市", "福建省"]], "福安市": [["宁德市", "福建省"]], "福鼎市": [["宁德市", "福建省"]],
             "东湖区": [["南昌市", "江西省"]], "青云谱区": [["南昌市", "江西省"]], "湾里区": [["南昌市", "江西省"]], "青山湖区": [["南昌市", "江西省"]],
             "新建区": [["南昌市", "江西省"]], "南昌县": [["南昌市", "江西省"]], "安义县": [["南昌市", "江西省"]], "进贤县": [["南昌市", "江西省"]],
             "昌江区": [["景德镇市", "江西省"]], "珠山区": [["景德镇市", "江西省"]], "浮梁县": [["景德镇市", "江西省"]], "乐平市": [["景德镇市", "江西省"]],
             "安源区": [["萍乡市", "江西省"]], "湘东区": [["萍乡市", "江西省"]], "莲花县": [["萍乡市", "江西省"]], "上栗县": [["萍乡市", "江西省"]],
             "芦溪县": [["萍乡市", "江西省"]], "濂溪区": [["九江市", "江西省"]], "浔阳区": [["九江市", "江西省"]], "柴桑区": [["九江市", "江西省"]],
             "武宁县": [["九江市", "江西省"]], "修水县": [["九江市", "江西省"]], "永修县": [["九江市", "江西省"]], "德安县": [["九江市", "江西省"]],
             "都昌县": [["九江市", "江西省"]], "湖口县": [["九江市", "江西省"]], "彭泽县": [["九江市", "江西省"]], "瑞昌市": [["九江市", "江西省"]],
             "共青城市": [["九江市", "江西省"]], "庐山市": [["九江市", "江西省"]], "渝水区": [["新余市", "江西省"]], "分宜县": [["新余市", "江西省"]],
             "月湖区": [["鹰潭市", "江西省"]], "余江区": [["鹰潭市", "江西省"]], "贵溪市": [["鹰潭市", "江西省"]], "章贡区": [["赣州市", "江西省"]],
             "南康区": [["赣州市", "江西省"]], "赣县区": [["赣州市", "江西省"]], "信丰县": [["赣州市", "江西省"]], "大余县": [["赣州市", "江西省"]],
             "上犹县": [["赣州市", "江西省"]], "崇义县": [["赣州市", "江西省"]], "安远县": [["赣州市", "江西省"]], "龙南县": [["赣州市", "江西省"]],
             "定南县": [["赣州市", "江西省"]], "全南县": [["赣州市", "江西省"]], "宁都县": [["赣州市", "江西省"]], "于都县": [["赣州市", "江西省"]],
             "兴国县": [["赣州市", "江西省"]], "会昌县": [["赣州市", "江西省"]], "寻乌县": [["赣州市", "江西省"]], "石城县": [["赣州市", "江西省"]],
             "瑞金市": [["赣州市", "江西省"]], "吉州区": [["吉安市", "江西省"]], "青原区": [["吉安市", "江西省"]], "吉安县": [["吉安市", "江西省"]],
             "吉水县": [["吉安市", "江西省"]], "峡江县": [["吉安市", "江西省"]], "新干县": [["吉安市", "江西省"]], "永丰县": [["吉安市", "江西省"]],
             "泰和县": [["吉安市", "江西省"]], "遂川县": [["吉安市", "江西省"]], "万安县": [["吉安市", "江西省"]], "安福县": [["吉安市", "江西省"]],
             "永新县": [["吉安市", "江西省"]], "井冈山市": [["吉安市", "江西省"]], "袁州区": [["宜春市", "江西省"]], "奉新县": [["宜春市", "江西省"]],
             "万载县": [["宜春市", "江西省"]], "上高县": [["宜春市", "江西省"]], "宜丰县": [["宜春市", "江西省"]], "靖安县": [["宜春市", "江西省"]],
             "铜鼓县": [["宜春市", "江西省"]], "丰城市": [["宜春市", "江西省"]], "樟树市": [["宜春市", "江西省"]], "高安市": [["宜春市", "江西省"]],
             "临川区": [["抚州市", "江西省"]], "东乡区": [["抚州市", "江西省"]], "南城县": [["抚州市", "江西省"]], "黎川县": [["抚州市", "江西省"]],
             "南丰县": [["抚州市", "江西省"]], "崇仁县": [["抚州市", "江西省"]], "乐安县": [["抚州市", "江西省"]], "宜黄县": [["抚州市", "江西省"]],
             "金溪县": [["抚州市", "江西省"]], "资溪县": [["抚州市", "江西省"]], "广昌县": [["抚州市", "江西省"]], "信州区": [["上饶市", "江西省"]],
             "广丰区": [["上饶市", "江西省"]], "广信区": [["上饶市", "江西省"]], "玉山县": [["上饶市", "江西省"]], "铅山县": [["上饶市", "江西省"]],
             "横峰县": [["上饶市", "江西省"]], "弋阳县": [["上饶市", "江西省"]], "余干县": [["上饶市", "江西省"]], "鄱阳县": [["上饶市", "江西省"]],
             "万年县": [["上饶市", "江西省"]], "婺源县": [["上饶市", "江西省"]], "德兴市": [["上饶市", "江西省"]], "历下区": [["济南市", "山东省"]],
             "市中区": [["济南市", "山东省"], ["枣庄市", "山东省"], ["内江市", "四川省"], ["乐山市", "四川省"]], "槐荫区": [["济南市", "山东省"]],
             "天桥区": [["济南市", "山东省"]], "历城区": [["济南市", "山东省"]], "长清区": [["济南市", "山东省"]], "章丘区": [["济南市", "山东省"]],
             "济阳区": [["济南市", "山东省"]], "莱芜市": [["济南市", "山东省"]], "莱芜区": [["济南市", "山东省"]], "钢城区": [["济南市", "山东省"]],
             "平阴县": [["济南市", "山东省"]],
             "商河县": [["济南市", "山东省"]], "济南高新技术产业开发区": [["济南市", "山东省"]], "市南区": [["青岛市", "山东省"]], "市北区": [["青岛市", "山东省"]],
             "黄岛区": [["青岛市", "山东省"]], "崂山区": [["青岛市", "山东省"]], "李沧区": [["青岛市", "山东省"]], "城阳区": [["青岛市", "山东省"]],
             "即墨区": [["青岛市", "山东省"]], "青岛高新技术产业开发区": [["青岛市", "山东省"]], "胶州市": [["青岛市", "山东省"]], "平度市": [["青岛市", "山东省"]],
             "莱西市": [["青岛市", "山东省"]], "淄川区": [["淄博市", "山东省"]], "张店区": [["淄博市", "山东省"]], "博山区": [["淄博市", "山东省"]],
             "临淄区": [["淄博市", "山东省"]], "周村区": [["淄博市", "山东省"]], "桓台县": [["淄博市", "山东省"]], "高青县": [["淄博市", "山东省"]],
             "沂源县": [["淄博市", "山东省"]], "薛城区": [["枣庄市", "山东省"]], "峄城区": [["枣庄市", "山东省"]], "台儿庄区": [["枣庄市", "山东省"]],
             "山亭区": [["枣庄市", "山东省"]], "滕州市": [["枣庄市", "山东省"]], "东营区": [["东营市", "山东省"]], "河口区": [["东营市", "山东省"]],
             "垦利区": [["东营市", "山东省"]], "利津县": [["东营市", "山东省"]], "广饶县": [["东营市", "山东省"]], "东营经济技术开发区": [["东营市", "山东省"]],
             "东营港经济开发区": [["东营市", "山东省"]], "芝罘区": [["烟台市", "山东省"]], "福山区": [["烟台市", "山东省"]], "牟平区": [["烟台市", "山东省"]],
             "莱山区": [["烟台市", "山东省"]], "长岛县": [["烟台市", "山东省"]], "烟台高新技术产业开发区": [["烟台市", "山东省"]],
             "烟台经济技术开发区": [["烟台市", "山东省"]], "龙口市": [["烟台市", "山东省"]], "莱阳市": [["烟台市", "山东省"]], "莱州市": [["烟台市", "山东省"]],
             "蓬莱市": [["烟台市", "山东省"]], "招远市": [["烟台市", "山东省"]], "栖霞市": [["烟台市", "山东省"]], "海阳市": [["烟台市", "山东省"]],
             "潍城区": [["潍坊市", "山东省"]], "寒亭区": [["潍坊市", "山东省"]], "坊子区": [["潍坊市", "山东省"]], "奎文区": [["潍坊市", "山东省"]],
             "临朐县": [["潍坊市", "山东省"]], "昌乐县": [["潍坊市", "山东省"]], "潍坊滨海经济技术开发区": [["潍坊市", "山东省"]], "青州市": [["潍坊市", "山东省"]],
             "诸城市": [["潍坊市", "山东省"]], "寿光市": [["潍坊市", "山东省"]], "安丘市": [["潍坊市", "山东省"]], "高密市": [["潍坊市", "山东省"]],
             "昌邑市": [["潍坊市", "山东省"]], "任城区": [["济宁市", "山东省"]], "兖州区": [["济宁市", "山东省"]], "微山县": [["济宁市", "山东省"]],
             "鱼台县": [["济宁市", "山东省"]], "金乡县": [["济宁市", "山东省"]], "嘉祥县": [["济宁市", "山东省"]], "汶上县": [["济宁市", "山东省"]],
             "泗水县": [["济宁市", "山东省"]], "梁山县": [["济宁市", "山东省"]], "济宁高新技术产业开发区": [["济宁市", "山东省"]], "曲阜市": [["济宁市", "山东省"]],
             "邹城市": [["济宁市", "山东省"]], "泰山区": [["泰安市", "山东省"]], "岱岳区": [["泰安市", "山东省"]], "宁阳县": [["泰安市", "山东省"]],
             "东平县": [["泰安市", "山东省"]], "新泰市": [["泰安市", "山东省"]], "肥城市": [["泰安市", "山东省"]], "环翠区": [["威海市", "山东省"]],
             "文登区": [["威海市", "山东省"]], "威海火炬高技术产业开发区": [["威海市", "山东省"]], "威海经济技术开发区": [["威海市", "山东省"]],
             "威海临港经济技术开发区": [["威海市", "山东省"]], "荣成市": [["威海市", "山东省"]], "乳山市": [["威海市", "山东省"]], "东港区": [["日照市", "山东省"]],
             "岚山区": [["日照市", "山东省"]], "五莲县": [["日照市", "山东省"]], "莒县": [["日照市", "山东省"]], "日照经济技术开发区": [["日照市", "山东省"]],
             "兰山区": [["临沂市", "山东省"]], "罗庄区": [["临沂市", "山东省"]], "沂南县": [["临沂市", "山东省"]], "郯城县": [["临沂市", "山东省"]],
             "沂水县": [["临沂市", "山东省"]], "兰陵县": [["临沂市", "山东省"]], "费县": [["临沂市", "山东省"]], "平邑县": [["临沂市", "山东省"]],
             "莒南县": [["临沂市", "山东省"]], "蒙阴县": [["临沂市", "山东省"]], "临沭县": [["临沂市", "山东省"]], "临沂高新技术产业开发区": [["临沂市", "山东省"]],
             "临沂经济技术开发区": [["临沂市", "山东省"]], "临沂临港经济开发区": [["临沂市", "山东省"]], "德城区": [["德州市", "山东省"]],
             "陵城区": [["德州市", "山东省"]], "宁津县": [["德州市", "山东省"]], "庆云县": [["德州市", "山东省"]], "临邑县": [["德州市", "山东省"]],
             "齐河县": [["德州市", "山东省"]], "平原县": [["德州市", "山东省"]], "夏津县": [["德州市", "山东省"]], "武城县": [["德州市", "山东省"]],
             "德州经济技术开发区": [["德州市", "山东省"]], "德州运河经济开发区": [["德州市", "山东省"]], "乐陵市": [["德州市", "山东省"]],
             "禹城市": [["德州市", "山东省"]], "东昌府区": [["聊城市", "山东省"]], "茌平区": [["聊城市", "山东省"]], "阳谷县": [["聊城市", "山东省"]],
             "莘县": [["聊城市", "山东省"]], "东阿县": [["聊城市", "山东省"]], "冠县": [["聊城市", "山东省"]], "高唐县": [["聊城市", "山东省"]],
             "临清市": [["聊城市", "山东省"]], "滨城区": [["滨州市", "山东省"]], "沾化区": [["滨州市", "山东省"]], "惠民县": [["滨州市", "山东省"]],
             "阳信县": [["滨州市", "山东省"]], "无棣县": [["滨州市", "山东省"]], "博兴县": [["滨州市", "山东省"]], "邹平市": [["滨州市", "山东省"]],
             "牡丹区": [["菏泽市", "山东省"]], "定陶区": [["菏泽市", "山东省"]], "曹县": [["菏泽市", "山东省"]], "单县": [["菏泽市", "山东省"]],
             "成武县": [["菏泽市", "山东省"]], "巨野县": [["菏泽市", "山东省"]], "郓城县": [["菏泽市", "山东省"]], "鄄城县": [["菏泽市", "山东省"]],
             "东明县": [["菏泽市", "山东省"]], "菏泽经济技术开发区": [["菏泽市", "山东省"]], "菏泽高新技术开发区": [["菏泽市", "山东省"]],
             "中原区": [["郑州市", "河南省"]], "二七区": [["郑州市", "河南省"]], "管城回族区": [["郑州市", "河南省"]], "金水区": [["郑州市", "河南省"]],
             "上街区": [["郑州市", "河南省"]], "惠济区": [["郑州市", "河南省"]], "中牟县": [["郑州市", "河南省"]], "郑州经济技术开发区": [["郑州市", "河南省"]],
             "郑州高新技术产业开发区": [["郑州市", "河南省"]], "郑州航空港经济综合实验区": [["郑州市", "河南省"]], "巩义市": [["郑州市", "河南省"]],
             "荥阳市": [["郑州市", "河南省"]], "新密市": [["郑州市", "河南省"]], "新郑市": [["郑州市", "河南省"]], "登封市": [["郑州市", "河南省"]],
             "龙亭区": [["开封市", "河南省"]], "顺河回族区": [["开封市", "河南省"]], "禹王台区": [["开封市", "河南省"]], "祥符区": [["开封市", "河南省"]],
             "杞县": [["开封市", "河南省"]], "通许县": [["开封市", "河南省"]], "尉氏县": [["开封市", "河南省"]], "兰考县": [["开封市", "河南省"]],
             "老城区": [["洛阳市", "河南省"]], "西工区": [["洛阳市", "河南省"]], "瀍河回族区": [["洛阳市", "河南省"]], "涧西区": [["洛阳市", "河南省"]],
             "吉利区": [["洛阳市", "河南省"]], "洛龙区": [["洛阳市", "河南省"]], "孟津县": [["洛阳市", "河南省"]], "新安县": [["洛阳市", "河南省"]],
             "栾川县": [["洛阳市", "河南省"]], "嵩县": [["洛阳市", "河南省"]], "汝阳县": [["洛阳市", "河南省"]], "宜阳县": [["洛阳市", "河南省"]],
             "洛宁县": [["洛阳市", "河南省"]], "伊川县": [["洛阳市", "河南省"]], "洛阳高新技术产业开发区": [["洛阳市", "河南省"]], "偃师市": [["洛阳市", "河南省"]],
             "卫东区": [["平顶山市", "河南省"]], "石龙区": [["平顶山市", "河南省"]], "湛河区": [["平顶山市", "河南省"]], "宝丰县": [["平顶山市", "河南省"]],
             "叶县": [["平顶山市", "河南省"]], "鲁山县": [["平顶山市", "河南省"]], "郏县": [["平顶山市", "河南省"]],
             "平顶山高新技术产业开发区": [["平顶山市", "河南省"]], "平顶山市城乡一体化示范区": [["平顶山市", "河南省"]], "舞钢市": [["平顶山市", "河南省"]],
             "汝州市": [["平顶山市", "河南省"]], "文峰区": [["安阳市", "河南省"]], "北关区": [["安阳市", "河南省"]], "殷都区": [["安阳市", "河南省"]],
             "龙安区": [["安阳市", "河南省"]], "安阳县": [["安阳市", "河南省"]], "汤阴县": [["安阳市", "河南省"]], "滑县": [["安阳市", "河南省"]],
             "内黄县": [["安阳市", "河南省"]], "安阳高新技术产业开发区": [["安阳市", "河南省"]], "林州市": [["安阳市", "河南省"]], "鹤山区": [["鹤壁市", "河南省"]],
             "山城区": [["鹤壁市", "河南省"]], "淇滨区": [["鹤壁市", "河南省"]], "浚县": [["鹤壁市", "河南省"]], "淇县": [["鹤壁市", "河南省"]],
             "鹤壁经济技术开发区": [["鹤壁市", "河南省"]], "红旗区": [["新乡市", "河南省"]], "卫滨区": [["新乡市", "河南省"]], "凤泉区": [["新乡市", "河南省"]],
             "牧野区": [["新乡市", "河南省"]], "新乡县": [["新乡市", "河南省"]], "获嘉县": [["新乡市", "河南省"]], "原阳县": [["新乡市", "河南省"]],
             "延津县": [["新乡市", "河南省"]], "封丘县": [["新乡市", "河南省"]], "新乡高新技术产业开发区": [["新乡市", "河南省"]],
             "新乡经济技术开发区": [["新乡市", "河南省"]], "新乡市平原城乡一体化示范区": [["新乡市", "河南省"]], "卫辉市": [["新乡市", "河南省"]],
             "辉县市": [["新乡市", "河南省"]], "长垣市": [["新乡市", "河南省"]], "解放区": [["焦作市", "河南省"]], "中站区": [["焦作市", "河南省"]],
             "马村区": [["焦作市", "河南省"]], "山阳区": [["焦作市", "河南省"]], "修武县": [["焦作市", "河南省"]], "博爱县": [["焦作市", "河南省"]],
             "武陟县": [["焦作市", "河南省"]], "温县": [["焦作市", "河南省"]], "焦作城乡一体化示范区": [["焦作市", "河南省"]], "沁阳市": [["焦作市", "河南省"]],
             "孟州市": [["焦作市", "河南省"]], "华龙区": [["濮阳市", "河南省"]], "清丰县": [["濮阳市", "河南省"]], "南乐县": [["濮阳市", "河南省"]],
             "范县": [["濮阳市", "河南省"]], "台前县": [["濮阳市", "河南省"]], "濮阳县": [["濮阳市", "河南省"]], "河南濮阳工业园区": [["濮阳市", "河南省"]],
             "濮阳经济技术开发区": [["濮阳市", "河南省"]], "魏都区": [["许昌市", "河南省"]], "建安区": [["许昌市", "河南省"]], "鄢陵县": [["许昌市", "河南省"]],
             "襄城县": [["许昌市", "河南省"]], "许昌经济技术开发区": [["许昌市", "河南省"]], "禹州市": [["许昌市", "河南省"]], "长葛市": [["许昌市", "河南省"]],
             "源汇区": [["漯河市", "河南省"]], "郾城区": [["漯河市", "河南省"]], "召陵区": [["漯河市", "河南省"]], "舞阳县": [["漯河市", "河南省"]],
             "临颍县": [["漯河市", "河南省"]], "漯河经济技术开发区": [["漯河市", "河南省"]], "湖滨区": [["三门峡市", "河南省"]], "陕州区": [["三门峡市", "河南省"]],
             "渑池县": [["三门峡市", "河南省"]], "卢氏县": [["三门峡市", "河南省"]], "河南三门峡经济开发区": [["三门峡市", "河南省"]],
             "义马市": [["三门峡市", "河南省"]], "灵宝市": [["三门峡市", "河南省"]], "宛城区": [["南阳市", "河南省"]], "卧龙区": [["南阳市", "河南省"]],
             "南召县": [["南阳市", "河南省"]], "方城县": [["南阳市", "河南省"]], "西峡县": [["南阳市", "河南省"]], "镇平县": [["南阳市", "河南省"]],
             "内乡县": [["南阳市", "河南省"]], "淅川县": [["南阳市", "河南省"]], "社旗县": [["南阳市", "河南省"]], "唐河县": [["南阳市", "河南省"]],
             "新野县": [["南阳市", "河南省"]], "桐柏县": [["南阳市", "河南省"]], "南阳高新技术产业开发区": [["南阳市", "河南省"]],
             "南阳市城乡一体化示范区": [["南阳市", "河南省"]], "邓州市": [["南阳市", "河南省"]], "梁园区": [["商丘市", "河南省"]], "睢阳区": [["商丘市", "河南省"]],
             "民权县": [["商丘市", "河南省"]], "睢县": [["商丘市", "河南省"]], "宁陵县": [["商丘市", "河南省"]], "柘城县": [["商丘市", "河南省"]],
             "虞城县": [["商丘市", "河南省"]], "夏邑县": [["商丘市", "河南省"]], "豫东综合物流产业聚集区": [["商丘市", "河南省"]],
             "河南商丘经济开发区": [["商丘市", "河南省"]], "永城市": [["商丘市", "河南省"]], "浉河区": [["信阳市", "河南省"]], "平桥区": [["信阳市", "河南省"]],
             "罗山县": [["信阳市", "河南省"]], "光山县": [["信阳市", "河南省"]], "新县": [["信阳市", "河南省"]], "商城县": [["信阳市", "河南省"]],
             "固始县": [["信阳市", "河南省"]], "潢川县": [["信阳市", "河南省"]], "淮滨县": [["信阳市", "河南省"]], "息县": [["信阳市", "河南省"]],
             "信阳高新技术产业开发区": [["信阳市", "河南省"]], "川汇区": [["周口市", "河南省"]], "淮阳区": [["周口市", "河南省"]], "扶沟县": [["周口市", "河南省"]],
             "西华县": [["周口市", "河南省"]], "商水县": [["周口市", "河南省"]], "沈丘县": [["周口市", "河南省"]], "郸城县": [["周口市", "河南省"]],
             "太康县": [["周口市", "河南省"]], "鹿邑县": [["周口市", "河南省"]], "河南周口经济开发区": [["周口市", "河南省"]], "项城市": [["周口市", "河南省"]],
             "驿城区": [["驻马店市", "河南省"]], "西平县": [["驻马店市", "河南省"]], "上蔡县": [["驻马店市", "河南省"]], "平舆县": [["驻马店市", "河南省"]],
             "正阳县": [["驻马店市", "河南省"]], "确山县": [["驻马店市", "河南省"]], "泌阳县": [["驻马店市", "河南省"]], "汝南县": [["驻马店市", "河南省"]],
             "遂平县": [["驻马店市", "河南省"]], "新蔡县": [["驻马店市", "河南省"]], "河南驻马店经济开发区": [["驻马店市", "河南省"]],
             "济源市沁园街道": [["济源市", "河南省"]], "济源市济水街道": [["济源市", "河南省"]], "济源市北海街道": [["济源市", "河南省"]],
             "济源市天坛街道": [["济源市", "河南省"]], "济源市玉泉街道": [["济源市", "河南省"]], "济源市克井镇": [["济源市", "河南省"]],
             "济源市五龙口镇": [["济源市", "河南省"]], "济源市轵城镇": [["济源市", "河南省"]], "济源市承留镇": [["济源市", "河南省"]],
             "济源市邵原镇": [["济源市", "河南省"]], "济源市坡头镇": [["济源市", "河南省"]], "济源市梨林镇": [["济源市", "河南省"]],
             "济源市大峪镇": [["济源市", "河南省"]], "济源市思礼镇": [["济源市", "河南省"]], "济源市王屋镇": [["济源市", "河南省"]],
             "济源市下冶镇": [["济源市", "河南省"]], "江岸区": [["武汉市", "湖北省"]], "江汉区": [["武汉市", "湖北省"]], "硚口区": [["武汉市", "湖北省"]],
             "汉阳区": [["武汉市", "湖北省"]], "武昌区": [["武汉市", "湖北省"]], "洪山区": [["武汉市", "湖北省"]], "东西湖区": [["武汉市", "湖北省"]],
             "汉南区": [["武汉市", "湖北省"]], "蔡甸区": [["武汉市", "湖北省"]], "江夏区": [["武汉市", "湖北省"]], "黄陂区": [["武汉市", "湖北省"]],
             "新洲区": [["武汉市", "湖北省"]], "黄石港区": [["黄石市", "湖北省"]], "西塞山区": [["黄石市", "湖北省"]], "下陆区": [["黄石市", "湖北省"]],
             "铁山区": [["黄石市", "湖北省"]], "阳新县": [["黄石市", "湖北省"]], "大冶市": [["黄石市", "湖北省"]], "茅箭区": [["十堰市", "湖北省"]],
             "张湾区": [["十堰市", "湖北省"]], "郧阳区": [["十堰市", "湖北省"]], "郧西县": [["十堰市", "湖北省"]], "竹山县": [["十堰市", "湖北省"]],
             "竹溪县": [["十堰市", "湖北省"]], "房县": [["十堰市", "湖北省"]], "丹江口市": [["十堰市", "湖北省"]], "西陵区": [["宜昌市", "湖北省"]],
             "伍家岗区": [["宜昌市", "湖北省"]], "点军区": [["宜昌市", "湖北省"]], "猇亭区": [["宜昌市", "湖北省"]], "夷陵区": [["宜昌市", "湖北省"]],
             "远安县": [["宜昌市", "湖北省"]], "兴山县": [["宜昌市", "湖北省"]], "秭归县": [["宜昌市", "湖北省"]], "长阳县": [["宜昌市", "湖北省"]],"长阳土家族自治县": [["宜昌市", "湖北省"]],
             "五峰县": [["宜昌市", "湖北省"]], "五峰土家族自治县": [["宜昌市", "湖北省"]], "宜都市": [["宜昌市", "湖北省"]], "当阳市": [["宜昌市", "湖北省"]],
             "枝江市": [["宜昌市", "湖北省"]],
             "襄城区": [["襄阳市", "湖北省"]], "樊城区": [["襄阳市", "湖北省"]], "襄州区": [["襄阳市", "湖北省"]], "南漳县": [["襄阳市", "湖北省"]],
             "谷城县": [["襄阳市", "湖北省"]], "保康县": [["襄阳市", "湖北省"]], "老河口市": [["襄阳市", "湖北省"]], "枣阳市": [["襄阳市", "湖北省"]],
             "宜城市": [["襄阳市", "湖北省"]], "梁子湖区": [["鄂州市", "湖北省"]], "华容区": [["鄂州市", "湖北省"]], "鄂城区": [["鄂州市", "湖北省"]],
             "东宝区": [["荆门市", "湖北省"]], "掇刀区": [["荆门市", "湖北省"]], "沙洋县": [["荆门市", "湖北省"]], "钟祥市": [["荆门市", "湖北省"]],
             "京山市": [["荆门市", "湖北省"]], "孝南区": [["孝感市", "湖北省"]], "孝昌县": [["孝感市", "湖北省"]], "大悟县": [["孝感市", "湖北省"]],
             "云梦县": [["孝感市", "湖北省"]], "应城市": [["孝感市", "湖北省"]], "安陆市": [["孝感市", "湖北省"]], "汉川市": [["孝感市", "湖北省"]],
             "沙市区": [["荆州市", "湖北省"]], "荆州区": [["荆州市", "湖北省"]], "公安县": [["荆州市", "湖北省"]], "监利县": [["荆州市", "湖北省"]],
             "江陵县": [["荆州市", "湖北省"]], "荆州经济技术开发区": [["荆州市", "湖北省"]], "石首市": [["荆州市", "湖北省"]], "洪湖市": [["荆州市", "湖北省"]],
             "松滋市": [["荆州市", "湖北省"]], "黄州区": [["黄冈市", "湖北省"]], "团风县": [["黄冈市", "湖北省"]], "红安县": [["黄冈市", "湖北省"]],
             "罗田县": [["黄冈市", "湖北省"]], "英山县": [["黄冈市", "湖北省"]], "浠水县": [["黄冈市", "湖北省"]], "蕲春县": [["黄冈市", "湖北省"]],
             "黄梅县": [["黄冈市", "湖北省"]], "龙感湖管理区": [["黄冈市", "湖北省"]], "麻城市": [["黄冈市", "湖北省"]], "武穴市": [["黄冈市", "湖北省"]],
             "咸安区": [["咸宁市", "湖北省"]], "嘉鱼县": [["咸宁市", "湖北省"]], "通城县": [["咸宁市", "湖北省"]], "崇阳县": [["咸宁市", "湖北省"]],
             "通山县": [["咸宁市", "湖北省"]], "赤壁市": [["咸宁市", "湖北省"]], "曾都区": [["随州市", "湖北省"]], "随县": [["随州市", "湖北省"]],
             "广水市": [["随州市", "湖北省"]], "恩施市": [["恩施土家族苗族自治州", "湖北省"]], "利川市": [["恩施土家族苗族自治州", "湖北省"]],
             "建始县": [["恩施土家族苗族自治州", "湖北省"]], "巴东县": [["恩施土家族苗族自治州", "湖北省"]], "宣恩县": [["恩施土家族苗族自治州", "湖北省"]],
             "咸丰县": [["恩施土家族苗族自治州", "湖北省"]], "来凤县": [["恩施土家族苗族自治州", "湖北省"]], "鹤峰县": [["恩施土家族苗族自治州", "湖北省"]],
             "沙嘴街道": [["仙桃市", "湖北省"]], "干河街道": [["仙桃市", "湖北省"]], "龙华山街道": [["仙桃市", "湖北省"]], "郑场镇": [["仙桃市", "湖北省"]],
             "毛嘴镇": [["仙桃市", "湖北省"]], "豆河镇": [["仙桃市", "湖北省"]], "三伏潭镇": [["仙桃市", "湖北省"]], "胡场镇": [["仙桃市", "湖北省"]],
             "长倘口镇": [["仙桃市", "湖北省"]], "西流河镇": [["仙桃市", "湖北省"]], "沙湖镇": [["仙桃市", "湖北省"]], "杨林尾镇": [["仙桃市", "湖北省"]],
             "彭场镇": [["仙桃市", "湖北省"]], "张沟镇": [["仙桃市", "湖北省"]], "郭河镇": [["仙桃市", "湖北省"]], "沔城回族镇": [["仙桃市", "湖北省"]],
             "通海口镇": [["仙桃市", "湖北省"]], "陈场镇": [["仙桃市", "湖北省"]], "工业园区": [["仙桃市", "湖北省"], ["阿拉尔市", "新疆维吾尔自治区"]],
             "九合垸原种场": [["仙桃市", "湖北省"]], "沙湖原种场": [["仙桃市", "湖北省"]], "五湖渔场": [["仙桃市", "湖北省"]], "赵西垸林场": [["仙桃市", "湖北省"]],
             "畜禽良种场": [["仙桃市", "湖北省"]], "排湖风景区": [["仙桃市", "湖北省"]], "园林街道": [["潜江市", "湖北省"]], "杨市街道": [["潜江市", "湖北省"]],
             "周矶街道": [["潜江市", "湖北省"]], "广华街道": [["潜江市", "湖北省"]], "泰丰街道": [["潜江市", "湖北省"]], "高场街道": [["潜江市", "湖北省"]],
             "竹根滩镇": [["潜江市", "湖北省"]], "渔洋镇": [["潜江市", "湖北省"]], "王场镇": [["潜江市", "湖北省"]], "高石碑镇": [["潜江市", "湖北省"]],
             "熊口镇": [["潜江市", "湖北省"]], "老新镇": [["潜江市", "湖北省"]], "浩口镇": [["潜江市", "湖北省"]], "积玉口镇": [["潜江市", "湖北省"]],
             "张金镇": [["潜江市", "湖北省"]], "龙湾镇": [["潜江市", "湖北省"]], "江汉石油管理局": [["潜江市", "湖北省"]], "潜江经济开发区": [["潜江市", "湖北省"]],
             "周矶管理区": [["潜江市", "湖北省"]], "后湖管理区": [["潜江市", "湖北省"]], "熊口管理区": [["潜江市", "湖北省"]], "总口管理区": [["潜江市", "湖北省"]],
             "白鹭湖管理区": [["潜江市", "湖北省"]], "运粮湖管理区": [["潜江市", "湖北省"]], "浩口原种场": [["潜江市", "湖北省"]],
             "竟陵街道": [["天门市", "湖北省"]], "候口街道": [["天门市", "湖北省"]], "杨林街道": [["天门市", "湖北省"]], "多宝镇": [["天门市", "湖北省"]],
             "拖市镇": [["天门市", "湖北省"]], "张港镇": [["天门市", "湖北省"]], "蒋场镇": [["天门市", "湖北省"]], "汪场镇": [["天门市", "湖北省"]],
             "渔薪镇": [["天门市", "湖北省"]], "黄潭镇": [["天门市", "湖北省"]], "岳口镇": [["天门市", "湖北省"]], "横林镇": [["天门市", "湖北省"]],
             "彭市镇": [["天门市", "湖北省"]], "麻洋镇": [["天门市", "湖北省"]], "多祥镇": [["天门市", "湖北省"]], "干驿镇": [["天门市", "湖北省"]],
             "马湾镇": [["天门市", "湖北省"]], "卢市镇": [["天门市", "湖北省"]], "小板镇": [["天门市", "湖北省"]], "九真镇": [["天门市", "湖北省"]],
             "皂市镇": [["天门市", "湖北省"]], "胡市镇": [["天门市", "湖北省"]], "石家河镇": [["天门市", "湖北省"]], "佛子山镇": [["天门市", "湖北省"]],
             "净潭乡": [["天门市", "湖北省"]], "蒋湖农场": [["天门市", "湖北省"]], "白茅湖农场": [["天门市", "湖北省"]], "沉湖管委会": [["天门市", "湖北省"]],
             "松柏镇": [["神农架林区", "湖北省"]], "阳日镇": [["神农架林区", "湖北省"]], "木鱼镇": [["神农架林区", "湖北省"]], "红坪镇": [["神农架林区", "湖北省"]],
             "新华镇": [["神农架林区", "湖北省"]], "九湖镇": [["神农架林区", "湖北省"]], "宋洛乡": [["神农架林区", "湖北省"]],
             "下谷坪土家族乡": [["神农架林区", "湖北省"]], "芙蓉区": [["长沙市", "湖南省"]], "天心区": [["长沙市", "湖南省"]], "岳麓区": [["长沙市", "湖南省"]],
             "开福区": [["长沙市", "湖南省"]], "雨花区": [["长沙市", "湖南省"]], "望城区": [["长沙市", "湖南省"]], "长沙县": [["长沙市", "湖南省"]],
             "浏阳市": [["长沙市", "湖南省"]], "宁乡市": [["长沙市", "湖南省"]], "荷塘区": [["株洲市", "湖南省"]], "芦淞区": [["株洲市", "湖南省"]],
             "石峰区": [["株洲市", "湖南省"]], "天元区": [["株洲市", "湖南省"]], "渌口区": [["株洲市", "湖南省"]], "攸县": [["株洲市", "湖南省"]],
             "茶陵县": [["株洲市", "湖南省"]], "炎陵县": [["株洲市", "湖南省"]], "云龙示范区": [["株洲市", "湖南省"]], "醴陵市": [["株洲市", "湖南省"]],
             "雨湖区": [["湘潭市", "湖南省"]], "岳塘区": [["湘潭市", "湖南省"]], "湘潭县": [["湘潭市", "湖南省"]],
             "湖南湘潭高新技术产业园区": [["湘潭市", "湖南省"]], "湘潭昭山示范区": [["湘潭市", "湖南省"]], "湘潭九华示范区": [["湘潭市", "湖南省"]],
             "湘乡市": [["湘潭市", "湖南省"]], "韶山市": [["湘潭市", "湖南省"]], "珠晖区": [["衡阳市", "湖南省"]], "雁峰区": [["衡阳市", "湖南省"]],
             "石鼓区": [["衡阳市", "湖南省"]], "蒸湘区": [["衡阳市", "湖南省"]], "南岳区": [["衡阳市", "湖南省"]], "衡阳县": [["衡阳市", "湖南省"]],
             "衡南县": [["衡阳市", "湖南省"]], "衡山县": [["衡阳市", "湖南省"]], "衡东县": [["衡阳市", "湖南省"]], "祁东县": [["衡阳市", "湖南省"]],
             "衡阳综合保税区": [["衡阳市", "湖南省"]], "湖南衡阳高新技术产业园区": [["衡阳市", "湖南省"]], "湖南衡阳松木经济开发区": [["衡阳市", "湖南省"]],
             "耒阳市": [["衡阳市", "湖南省"]], "常宁市": [["衡阳市", "湖南省"]], "双清区": [["邵阳市", "湖南省"]], "大祥区": [["邵阳市", "湖南省"]],
             "北塔区": [["邵阳市", "湖南省"]], "新邵县": [["邵阳市", "湖南省"]], "邵阳县": [["邵阳市", "湖南省"]], "隆回县": [["邵阳市", "湖南省"]],
             "洞口县": [["邵阳市", "湖南省"]], "绥宁县": [["邵阳市", "湖南省"]], "新宁县": [["邵阳市", "湖南省"]], "城步县": [["邵阳市", "湖南省"]],"城步苗族自治县": [["邵阳市", "湖南省"]],
             "武冈市": [["邵阳市", "湖南省"]], "邵东市": [["邵阳市", "湖南省"]], "岳阳楼区": [["岳阳市", "湖南省"]], "云溪区": [["岳阳市", "湖南省"]],
             "君山区": [["岳阳市", "湖南省"]], "岳阳县": [["岳阳市", "湖南省"]], "华容县": [["岳阳市", "湖南省"]], "湘阴县": [["岳阳市", "湖南省"]],
             "平江县": [["岳阳市", "湖南省"]], "岳阳市屈原管理区": [["岳阳市", "湖南省"]], "汨罗市": [["岳阳市", "湖南省"]], "临湘市": [["岳阳市", "湖南省"]],
             "武陵区": [["常德市", "湖南省"]], "鼎城区": [["常德市", "湖南省"]], "安乡县": [["常德市", "湖南省"]], "汉寿县": [["常德市", "湖南省"]],
             "澧县": [["常德市", "湖南省"]], "临澧县": [["常德市", "湖南省"]], "桃源县": [["常德市", "湖南省"]], "石门县": [["常德市", "湖南省"]],
             "常德市西洞庭管理区": [["常德市", "湖南省"]], "津市市": [["常德市", "湖南省"]], "武陵源区": [["张家界市", "湖南省"]],
             "慈利县": [["张家界市", "湖南省"]], "桑植县": [["张家界市", "湖南省"]], "资阳区": [["益阳市", "湖南省"]], "赫山区": [["益阳市", "湖南省"]],
             "南县": [["益阳市", "湖南省"]], "桃江县": [["益阳市", "湖南省"]], "安化县": [["益阳市", "湖南省"]], "益阳市大通湖管理区": [["益阳市", "湖南省"]],
             "湖南益阳高新技术产业园区": [["益阳市", "湖南省"]], "沅江市": [["益阳市", "湖南省"]], "北湖区": [["郴州市", "湖南省"]],
             "苏仙区": [["郴州市", "湖南省"]], "桂阳县": [["郴州市", "湖南省"]], "宜章县": [["郴州市", "湖南省"]], "永兴县": [["郴州市", "湖南省"]],
             "嘉禾县": [["郴州市", "湖南省"]], "临武县": [["郴州市", "湖南省"]], "汝城县": [["郴州市", "湖南省"]], "桂东县": [["郴州市", "湖南省"]],
             "安仁县": [["郴州市", "湖南省"]], "资兴市": [["郴州市", "湖南省"]], "零陵区": [["永州市", "湖南省"]], "冷水滩区": [["永州市", "湖南省"]],
             "祁阳县": [["永州市", "湖南省"]], "东安县": [["永州市", "湖南省"]], "双牌县": [["永州市", "湖南省"]], "道县": [["永州市", "湖南省"]],
             "江永县": [["永州市", "湖南省"]], "宁远县": [["永州市", "湖南省"]], "蓝山县": [["永州市", "湖南省"]], "新田县": [["永州市", "湖南省"]],
             "江华县": [["永州市", "湖南省"]], "江华瑶族自治县": [["永州市", "湖南省"]], "永州经济技术开发区": [["永州市", "湖南省"]], "永州市金洞管理区": [["永州市", "湖南省"]],
             "永州市回龙圩管理区": [["永州市", "湖南省"]], "鹤城区": [["怀化市", "湖南省"]], "中方县": [["怀化市", "湖南省"]], "沅陵县": [["怀化市", "湖南省"]],
             "辰溪县": [["怀化市", "湖南省"]], "溆浦县": [["怀化市", "湖南省"]], "会同县": [["怀化市", "湖南省"]], "麻阳县": [["怀化市", "湖南省"]],"麻阳苗族自治县": [["怀化市", "湖南省"]],
             "新晃县": [["怀化市", "湖南省"]],"新晃侗族自治县": [["怀化市", "湖南省"]],"芷江县": [["怀化市", "湖南省"]],  "芷江侗族自治县": [["怀化市", "湖南省"]],"靖州县": [["怀化市", "湖南省"]], "靖州苗族侗族自治县": [["怀化市", "湖南省"]],
             "通道县": [["怀化市", "湖南省"]],"通道侗族自治县": [["怀化市", "湖南省"]], "怀化市洪江管理区": [["怀化市", "湖南省"]], "洪江市": [["怀化市", "湖南省"]],
             "娄星区": [["娄底市", "湖南省"]], "双峰县": [["娄底市", "湖南省"]], "新化县": [["娄底市", "湖南省"]], "冷水江市": [["娄底市", "湖南省"]],
             "涟源市": [["娄底市", "湖南省"]], "吉首市": [["湘西土家族苗族自治州", "湖南省"]], "泸溪县": [["湘西土家族苗族自治州", "湖南省"]],
             "凤凰县": [["湘西土家族苗族自治州", "湖南省"]], "花垣县": [["湘西土家族苗族自治州", "湖南省"]], "保靖县": [["湘西土家族苗族自治州", "湖南省"]],
             "古丈县": [["湘西土家族苗族自治州", "湖南省"]], "永顺县": [["湘西土家族苗族自治州", "湖南省"]], "龙山县": [["湘西土家族苗族自治州", "湖南省"]],
             "湖南永顺经济开发区": [["湘西土家族苗族自治州", "湖南省"]], "荔湾区": [["广州市", "广东省"]], "越秀区": [["广州市", "广东省"]],
             "海珠区": [["广州市", "广东省"]], "天河区": [["广州市", "广东省"]], "白云区": [["广州市", "广东省"], ["贵阳市", "贵州省"]],
             "黄埔区": [["广州市", "广东省"]], "番禺区": [["广州市", "广东省"]], "花都区": [["广州市", "广东省"]], "南沙区": [["广州市", "广东省"]],
             "从化区": [["广州市", "广东省"]], "增城区": [["广州市", "广东省"]], "武江区": [["韶关市", "广东省"]], "浈江区": [["韶关市", "广东省"]],
             "曲江区": [["韶关市", "广东省"]], "始兴县": [["韶关市", "广东省"]], "仁化县": [["韶关市", "广东省"]], "翁源县": [["韶关市", "广东省"]],
             "乳源县": [["韶关市", "广东省"]], "乳源瑶族自治县": [["韶关市", "广东省"]], "新丰县": [["韶关市", "广东省"]], "乐昌市": [["韶关市", "广东省"]], "南雄市": [["韶关市", "广东省"]],
             "罗湖区": [["深圳市", "广东省"]], "福田区": [["深圳市", "广东省"]], "宝安区": [["深圳市", "广东省"]], "龙岗区": [["深圳市", "广东省"]],
             "盐田区": [["深圳市", "广东省"]], "龙华区": [["深圳市", "广东省"], ["海口市", "海南省"]], "坪山区": [["深圳市", "广东省"]],
             "光明区": [["深圳市", "广东省"]], "香洲区": [["珠海市", "广东省"]], "斗门区": [["珠海市", "广东省"]], "金湾区": [["珠海市", "广东省"]],
             "龙湖区": [["汕头市", "广东省"]], "金平区": [["汕头市", "广东省"]], "濠江区": [["汕头市", "广东省"]], "潮阳区": [["汕头市", "广东省"]],
             "潮南区": [["汕头市", "广东省"]], "澄海区": [["汕头市", "广东省"]], "南澳县": [["汕头市", "广东省"]], "禅城区": [["佛山市", "广东省"]],
             "南海区": [["佛山市", "广东省"]], "顺德区": [["佛山市", "广东省"]], "三水区": [["佛山市", "广东省"]], "高明区": [["佛山市", "广东省"]],
             "蓬江区": [["江门市", "广东省"]], "江海区": [["江门市", "广东省"]], "新会区": [["江门市", "广东省"]], "台山市": [["江门市", "广东省"]],
             "开平市": [["江门市", "广东省"]], "鹤山市": [["江门市", "广东省"]], "恩平市": [["江门市", "广东省"]], "赤坎区": [["湛江市", "广东省"]],
             "霞山区": [["湛江市", "广东省"]], "坡头区": [["湛江市", "广东省"]], "麻章区": [["湛江市", "广东省"]], "遂溪县": [["湛江市", "广东省"]],
             "徐闻县": [["湛江市", "广东省"]], "廉江市": [["湛江市", "广东省"]], "雷州市": [["湛江市", "广东省"]], "吴川市": [["湛江市", "广东省"]],
             "茂南区": [["茂名市", "广东省"]], "电白区": [["茂名市", "广东省"]], "高州市": [["茂名市", "广东省"]], "化州市": [["茂名市", "广东省"]],
             "信宜市": [["茂名市", "广东省"]], "端州区": [["肇庆市", "广东省"]], "鼎湖区": [["肇庆市", "广东省"]], "高要区": [["肇庆市", "广东省"]],
             "广宁县": [["肇庆市", "广东省"]], "怀集县": [["肇庆市", "广东省"]], "封开县": [["肇庆市", "广东省"]], "德庆县": [["肇庆市", "广东省"]],
             "四会市": [["肇庆市", "广东省"]], "惠城区": [["惠州市", "广东省"]], "惠阳区": [["惠州市", "广东省"]], "博罗县": [["惠州市", "广东省"]],
             "惠东县": [["惠州市", "广东省"]], "龙门县": [["惠州市", "广东省"]], "梅江区": [["梅州市", "广东省"]], "梅县区": [["梅州市", "广东省"]],
             "大埔县": [["梅州市", "广东省"]], "丰顺县": [["梅州市", "广东省"]], "五华县": [["梅州市", "广东省"]], "平远县": [["梅州市", "广东省"]],
             "蕉岭县": [["梅州市", "广东省"]], "兴宁市": [["梅州市", "广东省"]], "海丰县": [["汕尾市", "广东省"]], "陆河县": [["汕尾市", "广东省"]],
             "陆丰市": [["汕尾市", "广东省"]], "源城区": [["河源市", "广东省"]], "紫金县": [["河源市", "广东省"]], "龙川县": [["河源市", "广东省"]],
             "连平县": [["河源市", "广东省"]], "和平县": [["河源市", "广东省"]], "东源县": [["河源市", "广东省"]], "江城区": [["阳江市", "广东省"]],
             "阳东区": [["阳江市", "广东省"]], "阳西县": [["阳江市", "广东省"]], "阳春市": [["阳江市", "广东省"]], "清城区": [["清远市", "广东省"]],
             "清新区": [["清远市", "广东省"]], "佛冈县": [["清远市", "广东省"]], "阳山县": [["清远市", "广东省"]], "连山县": [["清远市", "广东省"]],"连山壮族瑶族自治县": [["清远市", "广东省"]],
             "连南县": [["清远市", "广东省"]], "连南瑶族自治县": [["清远市", "广东省"]], "英德市": [["清远市", "广东省"]], "连州市": [["清远市", "广东省"]],
             "东城街道": [["东莞市", "广东省"], ["石河子市", "新疆维吾尔自治区"]], "南城街道": [["东莞市", "广东省"]], "万江街道": [["东莞市", "广东省"]],
             "莞城街道": [["东莞市", "广东省"]], "石碣镇": [["东莞市", "广东省"]], "石龙镇": [["东莞市", "广东省"]], "茶山镇": [["东莞市", "广东省"]],
             "石排镇": [["东莞市", "广东省"]], "企石镇": [["东莞市", "广东省"]], "横沥镇": [["东莞市", "广东省"]],
             "桥头镇": [["东莞市", "广东省"], ["澄迈县", "海南省"]], "谢岗镇": [["东莞市", "广东省"]], "东坑镇": [["东莞市", "广东省"]],
             "常平镇": [["东莞市", "广东省"]], "寮步镇": [["东莞市", "广东省"]], "樟木头镇": [["东莞市", "广东省"]], "大朗镇": [["东莞市", "广东省"]],
             "黄江镇": [["东莞市", "广东省"]], "清溪镇": [["东莞市", "广东省"]], "塘厦镇": [["东莞市", "广东省"]], "凤岗镇": [["东莞市", "广东省"]],
             "大岭山镇": [["东莞市", "广东省"]], "长安镇": [["东莞市", "广东省"]], "虎门镇": [["东莞市", "广东省"]], "厚街镇": [["东莞市", "广东省"]],
             "沙田镇": [["东莞市", "广东省"]], "道滘镇": [["东莞市", "广东省"]], "洪梅镇": [["东莞市", "广东省"]], "麻涌镇": [["东莞市", "广东省"]],
             "望牛墩镇": [["东莞市", "广东省"]], "中堂镇": [["东莞市", "广东省"]], "高埗镇": [["东莞市", "广东省"]], "松山湖": [["东莞市", "广东省"]],
             "东莞港": [["东莞市", "广东省"]], "东莞生态园": [["东莞市", "广东省"]], "石岐街道": [["中山市", "广东省"]], "东区街道": [["中山市", "广东省"]],
             "中山港街道": [["中山市", "广东省"]], "西区街道": [["中山市", "广东省"]], "南区街道": [["中山市", "广东省"]], "五桂山街道": [["中山市", "广东省"]],
             "小榄镇": [["中山市", "广东省"]], "黄圃镇": [["中山市", "广东省"]], "民众镇": [["中山市", "广东省"]], "东凤镇": [["中山市", "广东省"]],
             "东升镇": [["中山市", "广东省"]], "古镇镇": [["中山市", "广东省"]], "沙溪镇": [["中山市", "广东省"]], "坦洲镇": [["中山市", "广东省"]],
             "港口镇": [["中山市", "广东省"]], "三角镇": [["中山市", "广东省"]], "横栏镇": [["中山市", "广东省"]], "南头镇": [["中山市", "广东省"]],
             "阜沙镇": [["中山市", "广东省"]], "南朗镇": [["中山市", "广东省"]], "三乡镇": [["中山市", "广东省"]], "板芙镇": [["中山市", "广东省"]],
             "大涌镇": [["中山市", "广东省"]], "神湾镇": [["中山市", "广东省"]], "湘桥区": [["潮州市", "广东省"]], "潮安区": [["潮州市", "广东省"]],
             "饶平县": [["潮州市", "广东省"]], "榕城区": [["揭阳市", "广东省"]], "揭东区": [["揭阳市", "广东省"]], "揭西县": [["揭阳市", "广东省"]],
             "惠来县": [["揭阳市", "广东省"]], "普宁市": [["揭阳市", "广东省"]], "云城区": [["云浮市", "广东省"]], "云安区": [["云浮市", "广东省"]],
             "新兴县": [["云浮市", "广东省"]], "郁南县": [["云浮市", "广东省"]], "罗定市": [["云浮市", "广东省"]], "兴宁区": [["南宁市", "广西壮族自治区"]],
             "青秀区": [["南宁市", "广西壮族自治区"]], "江南区": [["南宁市", "广西壮族自治区"]], "西乡塘区": [["南宁市", "广西壮族自治区"]],
             "良庆区": [["南宁市", "广西壮族自治区"]], "邕宁县": [["南宁市", "广西壮族自治区"]], "邕宁区": [["南宁市", "广西壮族自治区"]],
             "武鸣区": [["南宁市", "广西壮族自治区"]],
             "隆安县": [["南宁市", "广西壮族自治区"]], "马山县": [["南宁市", "广西壮族自治区"]], "上林县": [["南宁市", "广西壮族自治区"]],
             "宾阳县": [["南宁市", "广西壮族自治区"]], "横县": [["南宁市", "广西壮族自治区"]], "城中区": [["柳州市", "广西壮族自治区"], ["西宁市", "青海省"]],
             "鱼峰区": [["柳州市", "广西壮族自治区"]], "柳南区": [["柳州市", "广西壮族自治区"]], "柳北区": [["柳州市", "广西壮族自治区"]],
             "柳江区": [["柳州市", "广西壮族自治区"]], "柳城县": [["柳州市", "广西壮族自治区"]], "鹿寨县": [["柳州市", "广西壮族自治区"]],
             "融安县": [["柳州市", "广西壮族自治区"]], "融水县": [["柳州市", "广西壮族自治区"]],"融水苗族自治县": [["柳州市", "广西壮族自治区"]],"三江县": [["柳州市", "广西壮族自治区"]], "三江侗族自治县": [["柳州市", "广西壮族自治区"]],
             "秀峰区": [["桂林市", "广西壮族自治区"]], "叠彩区": [["桂林市", "广西壮族自治区"]], "象山区": [["桂林市", "广西壮族自治区"]],
             "七星区": [["桂林市", "广西壮族自治区"]], "雁山区": [["桂林市", "广西壮族自治区"]], "临桂区": [["桂林市", "广西壮族自治区"]],
             "阳朔县": [["桂林市", "广西壮族自治区"]], "灵川县": [["桂林市", "广西壮族自治区"]], "全州县": [["桂林市", "广西壮族自治区"]],
             "兴安县": [["桂林市", "广西壮族自治区"]], "永福县": [["桂林市", "广西壮族自治区"]], "灌阳县": [["桂林市", "广西壮族自治区"]],
             "龙胜县": [["桂林市", "广西壮族自治区"]], "龙胜各族自治县": [["桂林市", "广西壮族自治区"]], "资源县": [["桂林市", "广西壮族自治区"]], "平乐县": [["桂林市", "广西壮族自治区"]],
             "恭城县": [["桂林市", "广西壮族自治区"]],"恭城瑶族自治县": [["桂林市", "广西壮族自治区"]], "荔浦县": [["桂林市", "广西壮族自治区"]], "荔浦市": [["桂林市", "广西壮族自治区"]],
             "万秀区": [["梧州市", "广西壮族自治区"]],
             "长洲区": [["梧州市", "广西壮族自治区"]], "龙圩区": [["梧州市", "广西壮族自治区"]], "苍梧县": [["梧州市", "广西壮族自治区"]],
             "藤县": [["梧州市", "广西壮族自治区"]], "蒙山县": [["梧州市", "广西壮族自治区"]], "岑溪市": [["梧州市", "广西壮族自治区"]],
             "海城区": [["北海市", "广西壮族自治区"]], "银海区": [["北海市", "广西壮族自治区"]], "铁山港区": [["北海市", "广西壮族自治区"]],
             "合浦县": [["北海市", "广西壮族自治区"]], "港口区": [["防城港市", "广西壮族自治区"]], "防城区": [["防城港市", "广西壮族自治区"]],
             "上思县": [["防城港市", "广西壮族自治区"]], "东兴市": [["防城港市", "广西壮族自治区"]], "钦南区": [["钦州市", "广西壮族自治区"]],
             "钦北区": [["钦州市", "广西壮族自治区"]], "灵山县": [["钦州市", "广西壮族自治区"]], "浦北县": [["钦州市", "广西壮族自治区"]],
             "港北区": [["贵港市", "广西壮族自治区"]], "港南区": [["贵港市", "广西壮族自治区"]], "覃塘区": [["贵港市", "广西壮族自治区"]],
             "平南县": [["贵港市", "广西壮族自治区"]], "桂平市": [["贵港市", "广西壮族自治区"]], "玉州区": [["玉林市", "广西壮族自治区"]],
             "福绵区": [["玉林市", "广西壮族自治区"]], "容县": [["玉林市", "广西壮族自治区"]], "陆川县": [["玉林市", "广西壮族自治区"]],
             "博白县": [["玉林市", "广西壮族自治区"]], "兴业县": [["玉林市", "广西壮族自治区"]], "北流市": [["玉林市", "广西壮族自治区"]],
             "右江区": [["百色市", "广西壮族自治区"]], "田阳区": [["百色市", "广西壮族自治区"]], "田东县": [["百色市", "广西壮族自治区"]],
             "平果县": [["百色市", "广西壮族自治区"]], "德保县": [["百色市", "广西壮族自治区"]], "那坡县": [["百色市", "广西壮族自治区"]],
             "凌云县": [["百色市", "广西壮族自治区"]], "乐业县": [["百色市", "广西壮族自治区"]], "田林县": [["百色市", "广西壮族自治区"]],
             "西林县": [["百色市", "广西壮族自治区"]], "隆林县": [["百色市", "广西壮族自治区"]],"隆林各族自治县": [["百色市", "广西壮族自治区"]], "靖西市": [["百色市", "广西壮族自治区"]],
             "八步区": [["贺州市", "广西壮族自治区"]], "平桂区": [["贺州市", "广西壮族自治区"]], "昭平县": [["贺州市", "广西壮族自治区"]],
             "钟山县": [["贺州市", "广西壮族自治区"]], "富川县": [["贺州市", "广西壮族自治区"]],"富川瑶族自治县": [["贺州市", "广西壮族自治区"]], "金城江区": [["河池市", "广西壮族自治区"]],
             "宜州区": [["河池市", "广西壮族自治区"]], "南丹县": [["河池市", "广西壮族自治区"]], "天峨县": [["河池市", "广西壮族自治区"]],
             "凤山县": [["河池市", "广西壮族自治区"]], "东兰县": [["河池市", "广西壮族自治区"]], "罗城县": [["河池市", "广西壮族自治区"]],"罗城仫佬族自治县": [["河池市", "广西壮族自治区"]],
             "环江县": [["河池市", "广西壮族自治区"]], "环江毛南族自治县": [["河池市", "广西壮族自治区"]],"巴马县": [["河池市", "广西壮族自治区"]], "巴马瑶族自治县": [["河池市", "广西壮族自治区"]], "都安瑶族自治县": [["河池市", "广西壮族自治区"]],
             "大化瑶族自治县": [["河池市", "广西壮族自治区"]], "兴宾区": [["来宾市", "广西壮族自治区"]], "忻城县": [["来宾市", "广西壮族自治区"]],
             "象州县": [["来宾市", "广西壮族自治区"]], "武宣县": [["来宾市", "广西壮族自治区"]], "金秀县": [["来宾市", "广西壮族自治区"]],"金秀瑶族自治县": [["来宾市", "广西壮族自治区"]],
             "合山市": [["来宾市", "广西壮族自治区"]], "江州区": [["崇左市", "广西壮族自治区"]], "扶绥县": [["崇左市", "广西壮族自治区"]],
             "宁明县": [["崇左市", "广西壮族自治区"]], "龙州县": [["崇左市", "广西壮族自治区"]], "大新县": [["崇左市", "广西壮族自治区"]],
             "天等县": [["崇左市", "广西壮族自治区"]], "凭祥市": [["崇左市", "广西壮族自治区"]], "秀英区": [["海口市", "海南省"]], "琼山区": [["海口市", "海南省"]],
             "美兰区": [["海口市", "海南省"]], "海棠区": [["三亚市", "海南省"]], "吉阳区": [["三亚市", "海南省"]], "天涯区": [["三亚市", "海南省"]],
             "崖州区": [["三亚市", "海南省"]], "西沙群岛": [["三沙市", "海南省"]], "南沙群岛": [["三沙市", "海南省"]],
             "中沙群岛的岛礁及其海域": [["三沙市", "海南省"]], "那大镇": [["儋州市", "海南省"]], "和庆镇": [["儋州市", "海南省"]], "南丰镇": [["儋州市", "海南省"]],
             "大成镇": [["儋州市", "海南省"]], "雅星镇": [["儋州市", "海南省"]], "兰洋镇": [["儋州市", "海南省"]], "光村镇": [["儋州市", "海南省"]],
             "木棠镇": [["儋州市", "海南省"]], "海头镇": [["儋州市", "海南省"]], "峨蔓镇": [["儋州市", "海南省"]], "王五镇": [["儋州市", "海南省"]],
             "白马井镇": [["儋州市", "海南省"]], "中和镇": [["儋州市", "海南省"]], "排浦镇": [["儋州市", "海南省"]], "东成镇": [["儋州市", "海南省"]],
             "新州镇": [["儋州市", "海南省"]], "洋浦经济开发区": [["儋州市", "海南省"]], "华南热作学院": [["儋州市", "海南省"]], "通什镇": [["五指山市", "海南省"]],
             "南圣镇": [["五指山市", "海南省"]], "毛阳镇": [["五指山市", "海南省"]], "番阳镇": [["五指山市", "海南省"]], "畅好乡": [["五指山市", "海南省"]],
             "毛道乡": [["五指山市", "海南省"]], "水满乡": [["五指山市", "海南省"]], "嘉积镇": [["琼海市", "海南省"]], "万泉镇": [["琼海市", "海南省"]],
             "石壁镇": [["琼海市", "海南省"]], "中原镇": [["琼海市", "海南省"]], "博鳌镇": [["琼海市", "海南省"]], "阳江镇": [["琼海市", "海南省"]],
             "龙江镇": [["琼海市", "海南省"]], "潭门镇": [["琼海市", "海南省"]], "塔洋镇": [["琼海市", "海南省"]], "长坡镇": [["琼海市", "海南省"]],
             "大路镇": [["琼海市", "海南省"]], "会山镇": [["琼海市", "海南省"]], "彬村山华侨农场": [["琼海市", "海南省"]], "文城镇": [["文昌市", "海南省"]],
             "重兴镇": [["文昌市", "海南省"]], "蓬莱镇": [["文昌市", "海南省"]], "会文镇": [["文昌市", "海南省"]], "东路镇": [["文昌市", "海南省"]],
             "潭牛镇": [["文昌市", "海南省"]], "东阁镇": [["文昌市", "海南省"]], "文教镇": [["文昌市", "海南省"]], "东郊镇": [["文昌市", "海南省"]],
             "龙楼镇": [["文昌市", "海南省"]], "昌洒镇": [["文昌市", "海南省"]], "翁田镇": [["文昌市", "海南省"]], "抱罗镇": [["文昌市", "海南省"]],
             "冯坡镇": [["文昌市", "海南省"]], "锦山镇": [["文昌市", "海南省"]], "铺前镇": [["文昌市", "海南省"]], "公坡镇": [["文昌市", "海南省"]],
             "万城镇": [["万宁市", "海南省"]], "龙滚镇": [["万宁市", "海南省"]], "和乐镇": [["万宁市", "海南省"]], "后安镇": [["万宁市", "海南省"]],
             "大茂镇": [["万宁市", "海南省"]], "东澳镇": [["万宁市", "海南省"]], "礼纪镇": [["万宁市", "海南省"]], "长丰镇": [["万宁市", "海南省"]],
             "山根镇": [["万宁市", "海南省"]], "北大镇": [["万宁市", "海南省"]], "南桥镇": [["万宁市", "海南省"]], "三更罗镇": [["万宁市", "海南省"]],
             "兴隆华侨农场": [["万宁市", "海南省"]], "地方国营六连林场": [["万宁市", "海南省"]], "八所镇": [["东方市", "海南省"]], "东河镇": [["东方市", "海南省"]],
             "大田镇": [["东方市", "海南省"]], "感城镇": [["东方市", "海南省"]], "板桥镇": [["东方市", "海南省"]], "三家镇": [["东方市", "海南省"]],
             "四更镇": [["东方市", "海南省"]], "新龙镇": [["东方市", "海南省"]], "天安乡": [["东方市", "海南省"]], "江边乡": [["东方市", "海南省"]],
             "东方华侨农场": [["东方市", "海南省"]], "定城镇": [["定安县", "海南省"]], "新竹镇": [["定安县", "海南省"]], "龙湖镇": [["定安县", "海南省"]],
             "黄竹镇": [["定安县", "海南省"]], "雷鸣镇": [["定安县", "海南省"]], "龙门镇": [["定安县", "海南省"]], "龙河镇": [["定安县", "海南省"]],
             "岭口镇": [["定安县", "海南省"]], "翰林镇": [["定安县", "海南省"]], "富文镇": [["定安县", "海南省"]], "屯城镇": [["屯昌县", "海南省"]],
             "新兴镇": [["屯昌县", "海南省"]], "枫木镇": [["屯昌县", "海南省"]], "乌坡镇": [["屯昌县", "海南省"]], "南吕镇": [["屯昌县", "海南省"]],
             "南坤镇": [["屯昌县", "海南省"]], "坡心镇": [["屯昌县", "海南省"]], "西昌镇": [["屯昌县", "海南省"]], "金江镇": [["澄迈县", "海南省"]],
             "老城镇": [["澄迈县", "海南省"]], "瑞溪镇": [["澄迈县", "海南省"]], "永发镇": [["澄迈县", "海南省"]], "加乐镇": [["澄迈县", "海南省"]],
             "文儒镇": [["澄迈县", "海南省"]], "中兴镇": [["澄迈县", "海南省"]], "仁兴镇": [["澄迈县", "海南省"]], "福山镇": [["澄迈县", "海南省"]],
             "大丰镇": [["澄迈县", "海南省"]], "国营金安农场": [["澄迈县", "海南省"]], "临城镇": [["临高县", "海南省"]], "波莲镇": [["临高县", "海南省"]],
             "东英镇": [["临高县", "海南省"]], "博厚镇": [["临高县", "海南省"]], "皇桐镇": [["临高县", "海南省"]], "多文镇": [["临高县", "海南省"]],
             "和舍镇": [["临高县", "海南省"]], "南宝镇": [["临高县", "海南省"]], "新盈镇": [["临高县", "海南省"]], "调楼镇": [["临高县", "海南省"]],
             "国营加来农场": [["临高县", "海南省"]], "牙叉镇": [["白沙黎族自治县", "海南省"]], "七坊镇": [["白沙黎族自治县", "海南省"]],
             "邦溪镇": [["白沙黎族自治县", "海南省"]], "打安镇": [["白沙黎族自治县", "海南省"]], "细水乡": [["白沙黎族自治县", "海南省"]],
             "元门乡": [["白沙黎族自治县", "海南省"]], "南开乡": [["白沙黎族自治县", "海南省"]], "阜龙乡": [["白沙黎族自治县", "海南省"]],
             "青松乡": [["白沙黎族自治县", "海南省"]], "金波乡": [["白沙黎族自治县", "海南省"]], "荣邦乡": [["白沙黎族自治县", "海南省"]],
             "石碌镇": [["昌江黎族自治县", "海南省"]], "叉河镇": [["昌江黎族自治县", "海南省"]], "十月田镇": [["昌江黎族自治县", "海南省"]],
             "乌烈镇": [["昌江黎族自治县", "海南省"]], "昌化镇": [["昌江黎族自治县", "海南省"]], "海尾镇": [["昌江黎族自治县", "海南省"]],
             "七叉镇": [["昌江黎族自治县", "海南省"]], "王下乡": [["昌江黎族自治县", "海南省"]], "国营霸王岭林场": [["昌江黎族自治县", "海南省"]],
             "抱由镇": [["乐东黎族自治县", "海南省"]], "万冲镇": [["乐东黎族自治县", "海南省"]], "大安镇": [["乐东黎族自治县", "海南省"]],
             "志仲镇": [["乐东黎族自治县", "海南省"]], "千家镇": [["乐东黎族自治县", "海南省"]], "九所镇": [["乐东黎族自治县", "海南省"]],
             "利国镇": [["乐东黎族自治县", "海南省"]], "黄流镇": [["乐东黎族自治县", "海南省"]], "佛罗镇": [["乐东黎族自治县", "海南省"]],
             "尖峰镇": [["乐东黎族自治县", "海南省"]], "莺歌海镇": [["乐东黎族自治县", "海南省"]], "国营尖峰岭林业公司": [["乐东黎族自治县", "海南省"]],
             "国营莺歌海盐场": [["乐东黎族自治县", "海南省"]], "椰林镇": [["陵水黎族自治县", "海南省"]], "光坡镇": [["陵水黎族自治县", "海南省"]],
             "三才镇": [["陵水黎族自治县", "海南省"]], "英州镇": [["陵水黎族自治县", "海南省"]], "隆广镇": [["陵水黎族自治县", "海南省"]],
             "文罗镇": [["陵水黎族自治县", "海南省"]], "本号镇": [["陵水黎族自治县", "海南省"]], "新村镇": [["陵水黎族自治县", "海南省"]],
             "黎安镇": [["陵水黎族自治县", "海南省"]], "提蒙乡": [["陵水黎族自治县", "海南省"]], "群英乡": [["陵水黎族自治县", "海南省"]],
             "国营吊罗山林业公司": [["陵水黎族自治县", "海南省"]], "保城镇": [["保亭黎族苗族自治县", "海南省"]], "什玲镇": [["保亭黎族苗族自治县", "海南省"]],
             "加茂镇": [["保亭黎族苗族自治县", "海南省"]], "响水镇": [["保亭黎族苗族自治县", "海南省"]], "新政镇": [["保亭黎族苗族自治县", "海南省"]],
             "三道镇": [["保亭黎族苗族自治县", "海南省"]], "六弓乡": [["保亭黎族苗族自治县", "海南省"]], "南林乡": [["保亭黎族苗族自治县", "海南省"]],
             "毛感乡": [["保亭黎族苗族自治县", "海南省"]], "营根镇": [["琼中黎族苗族自治县", "海南省"]], "湾岭镇": [["琼中黎族苗族自治县", "海南省"]],
             "黎母山镇": [["琼中黎族苗族自治县", "海南省"]], "和平镇": [["琼中黎族苗族自治县", "海南省"]], "长征镇": [["琼中黎族苗族自治县", "海南省"]],
             "红毛镇": [["琼中黎族苗族自治县", "海南省"]], "中平镇": [["琼中黎族苗族自治县", "海南省"]], "吊罗山乡": [["琼中黎族苗族自治县", "海南省"]],
             "上安乡": [["琼中黎族苗族自治县", "海南省"]], "什运乡": [["琼中黎族苗族自治县", "海南省"]], "万州区": [["重庆市", "重庆市"]],
             "涪陵区": [["重庆市", "重庆市"]], "渝中区": [["重庆市", "重庆市"]], "大渡口区": [["重庆市", "重庆市"]], "沙坪坝区": [["重庆市", "重庆市"]],
             "九龙坡区": [["重庆市", "重庆市"]], "南岸区": [["重庆市", "重庆市"]], "北碚区": [["重庆市", "重庆市"]], "綦江区": [["重庆市", "重庆市"]],
             "大足区": [["重庆市", "重庆市"]], "渝北区": [["重庆市", "重庆市"]], "巴南区": [["重庆市", "重庆市"]], "黔江区": [["重庆市", "重庆市"]],
             "长寿区": [["重庆市", "重庆市"]], "江津区": [["重庆市", "重庆市"]], "合川区": [["重庆市", "重庆市"]], "永川区": [["重庆市", "重庆市"]],
             "南川区": [["重庆市", "重庆市"]], "璧山区": [["重庆市", "重庆市"]], "铜梁区": [["重庆市", "重庆市"]], "潼南县": [["重庆市", "重庆市"]],
             "潼南区": [["重庆市", "重庆市"]],
             "荣昌区": [["重庆市", "重庆市"]], "开州区": [["重庆市", "重庆市"]], "梁平区": [["重庆市", "重庆市"]], "武隆区": [["重庆市", "重庆市"]],
             "城口县": [["重庆市", "重庆市"]], "丰都县": [["重庆市", "重庆市"]], "垫江县": [["重庆市", "重庆市"]], "忠县": [["重庆市", "重庆市"]],
             "云阳县": [["重庆市", "重庆市"]], "奉节县": [["重庆市", "重庆市"]], "巫山县": [["重庆市", "重庆市"]], "巫溪县": [["重庆市", "重庆市"]],
             "石柱县": [["重庆市", "重庆市"]],"石柱土家族自治县": [["重庆市", "重庆市"]],"秀山县": [["重庆市", "重庆市"]],  "秀山土家族苗族自治县": [["重庆市", "重庆市"]],"酉阳县": [["重庆市", "重庆市"]], "酉阳土家族苗族自治县": [["重庆市", "重庆市"]],
             "彭水县": [["重庆市", "重庆市"]],"彭水苗族土家族自治县": [["重庆市", "重庆市"]], "锦江区": [["成都市", "四川省"]], "青羊区": [["成都市", "四川省"]], "金牛区": [["成都市", "四川省"]],
             "武侯区": [["成都市", "四川省"]], "成华区": [["成都市", "四川省"]], "龙泉驿区": [["成都市", "四川省"]], "青白江区": [["成都市", "四川省"]],
             "新都区": [["成都市", "四川省"]], "温江区": [["成都市", "四川省"]], "双流区": [["成都市", "四川省"]], "郫都区": [["成都市", "四川省"]],
             "郫县": [["成都市", "四川省"]],
             "金堂县": [["成都市", "四川省"]], "大邑县": [["成都市", "四川省"]], "蒲江县": [["成都市", "四川省"]], "新津县": [["成都市", "四川省"]],
             "都江堰市": [["成都市", "四川省"]], "彭州市": [["成都市", "四川省"]], "邛崃市": [["成都市", "四川省"]], "崇州市": [["成都市", "四川省"]],
             "简阳市": [["成都市", "四川省"]], "自流井区": [["自贡市", "四川省"]], "贡井区": [["自贡市", "四川省"]], "大安区": [["自贡市", "四川省"]],
             "沿滩区": [["自贡市", "四川省"]], "荣县": [["自贡市", "四川省"]], "富顺县": [["自贡市", "四川省"]], "东区": [["攀枝花市", "四川省"]],
             "西区": [["攀枝花市", "四川省"]], "仁和区": [["攀枝花市", "四川省"]], "米易县": [["攀枝花市", "四川省"]], "盐边县": [["攀枝花市", "四川省"]],
             "江阳区": [["泸州市", "四川省"]], "纳溪区": [["泸州市", "四川省"]], "龙马潭区": [["泸州市", "四川省"]], "泸县": [["泸州市", "四川省"]],
             "合江县": [["泸州市", "四川省"]], "叙永县": [["泸州市", "四川省"]], "古蔺县": [["泸州市", "四川省"]], "旌阳区": [["德阳市", "四川省"]],
             "罗江区": [["德阳市", "四川省"]], "中江县": [["德阳市", "四川省"]], "广汉市": [["德阳市", "四川省"]], "什邡市": [["德阳市", "四川省"]],
             "绵竹市": [["德阳市", "四川省"]], "涪城区": [["绵阳市", "四川省"]], "游仙区": [["绵阳市", "四川省"]], "安州区": [["绵阳市", "四川省"]],
             "三台县": [["绵阳市", "四川省"]], "盐亭县": [["绵阳市", "四川省"]], "梓潼县": [["绵阳市", "四川省"]],"北川县": [["绵阳市", "四川省"]], "北川羌族自治县": [["绵阳市", "四川省"]],
             "平武县": [["绵阳市", "四川省"]], "江油市": [["绵阳市", "四川省"]], "利州区": [["广元市", "四川省"]], "昭化区": [["广元市", "四川省"]],
             "朝天区": [["广元市", "四川省"]], "旺苍县": [["广元市", "四川省"]], "青川县": [["广元市", "四川省"]], "剑阁县": [["广元市", "四川省"]],
             "苍溪县": [["广元市", "四川省"]], "船山区": [["遂宁市", "四川省"]], "安居区": [["遂宁市", "四川省"]], "蓬溪县": [["遂宁市", "四川省"]],
             "大英县": [["遂宁市", "四川省"]], "射洪市": [["遂宁市", "四川省"]], "东兴区": [["内江市", "四川省"]], "威远县": [["内江市", "四川省"]],
             "资中县": [["内江市", "四川省"]], "内江经济开发区": [["内江市", "四川省"]], "隆昌市": [["内江市", "四川省"]], "沙湾区": [["乐山市", "四川省"]],
             "五通桥区": [["乐山市", "四川省"]], "金口河区": [["乐山市", "四川省"]], "犍为县": [["乐山市", "四川省"]], "井研县": [["乐山市", "四川省"]],
             "夹江县": [["乐山市", "四川省"]], "沐川县": [["乐山市", "四川省"]],"峨边县": [["乐山市", "四川省"]], "峨边彝族自治县": [["乐山市", "四川省"]],"马边县": [["乐山市", "四川省"]], "马边彝族自治县": [["乐山市", "四川省"]],
             "峨眉山市": [["乐山市", "四川省"]], "顺庆区": [["南充市", "四川省"]], "高坪区": [["南充市", "四川省"]], "嘉陵区": [["南充市", "四川省"]],
             "南部县": [["南充市", "四川省"]], "营山县": [["南充市", "四川省"]], "蓬安县": [["南充市", "四川省"]], "仪陇县": [["南充市", "四川省"]],
             "西充县": [["南充市", "四川省"]], "阆中市": [["南充市", "四川省"]], "东坡区": [["眉山市", "四川省"]], "彭山区": [["眉山市", "四川省"]],
             "仁寿县": [["眉山市", "四川省"]], "洪雅县": [["眉山市", "四川省"]], "丹棱县": [["眉山市", "四川省"]], "青神县": [["眉山市", "四川省"]],
             "翠屏区": [["宜宾市", "四川省"]], "南溪区": [["宜宾市", "四川省"]], "叙州区": [["宜宾市", "四川省"]], "江安县": [["宜宾市", "四川省"]],
             "长宁县": [["宜宾市", "四川省"]], "高县": [["宜宾市", "四川省"]], "珙县": [["宜宾市", "四川省"]], "筠连县": [["宜宾市", "四川省"]],
             "兴文县": [["宜宾市", "四川省"]], "屏山县": [["宜宾市", "四川省"]], "广安区": [["广安市", "四川省"]], "前锋区": [["广安市", "四川省"]],
             "岳池县": [["广安市", "四川省"]], "武胜县": [["广安市", "四川省"]], "邻水县": [["广安市", "四川省"]], "华蓥市": [["广安市", "四川省"]],
             "通川区": [["达州市", "四川省"]], "达川区": [["达州市", "四川省"]], "宣汉县": [["达州市", "四川省"]], "开江县": [["达州市", "四川省"]],
             "大竹县": [["达州市", "四川省"]], "渠县": [["达州市", "四川省"]], "达州经济开发区": [["达州市", "四川省"]], "万源市": [["达州市", "四川省"]],
             "雨城区": [["雅安市", "四川省"]], "名山区": [["雅安市", "四川省"]], "荥经县": [["雅安市", "四川省"]], "汉源县": [["雅安市", "四川省"]],
             "石棉县": [["雅安市", "四川省"]], "天全县": [["雅安市", "四川省"]], "芦山县": [["雅安市", "四川省"]], "宝兴县": [["雅安市", "四川省"]],
             "巴州区": [["巴中市", "四川省"]], "恩阳区": [["巴中市", "四川省"]], "通江县": [["巴中市", "四川省"]], "南江县": [["巴中市", "四川省"]],
             "平昌县": [["巴中市", "四川省"]], "巴中经济开发区": [["巴中市", "四川省"]], "雁江区": [["资阳市", "四川省"]], "安岳县": [["资阳市", "四川省"]],
             "乐至县": [["资阳市", "四川省"]], "马尔康市": [["阿坝藏族羌族自治州", "四川省"]], "汶川县": [["阿坝藏族羌族自治州", "四川省"]],
             "理县": [["阿坝藏族羌族自治州", "四川省"]], "茂县": [["阿坝藏族羌族自治州", "四川省"]], "松潘县": [["阿坝藏族羌族自治州", "四川省"]],
             "九寨沟县": [["阿坝藏族羌族自治州", "四川省"]], "金川县": [["阿坝藏族羌族自治州", "四川省"]], "小金县": [["阿坝藏族羌族自治州", "四川省"]],
             "黑水县": [["阿坝藏族羌族自治州", "四川省"]], "壤塘县": [["阿坝藏族羌族自治州", "四川省"]], "阿坝县": [["阿坝藏族羌族自治州", "四川省"]],
             "若尔盖县": [["阿坝藏族羌族自治州", "四川省"]], "红原县": [["阿坝藏族羌族自治州", "四川省"]], "康定市": [["甘孜藏族自治州", "四川省"]],
             "泸定县": [["甘孜藏族自治州", "四川省"]], "丹巴县": [["甘孜藏族自治州", "四川省"]], "九龙县": [["甘孜藏族自治州", "四川省"]],
             "雅江县": [["甘孜藏族自治州", "四川省"]], "道孚县": [["甘孜藏族自治州", "四川省"]], "炉霍县": [["甘孜藏族自治州", "四川省"]],
             "甘孜县": [["甘孜藏族自治州", "四川省"]], "新龙县": [["甘孜藏族自治州", "四川省"]], "德格县": [["甘孜藏族自治州", "四川省"]],
             "白玉县": [["甘孜藏族自治州", "四川省"]], "石渠县": [["甘孜藏族自治州", "四川省"]], "色达县": [["甘孜藏族自治州", "四川省"]],
             "理塘县": [["甘孜藏族自治州", "四川省"]], "巴塘县": [["甘孜藏族自治州", "四川省"]], "乡城县": [["甘孜藏族自治州", "四川省"]],
             "稻城县": [["甘孜藏族自治州", "四川省"]], "得荣县": [["甘孜藏族自治州", "四川省"]], "西昌市": [["凉山彝族自治州", "四川省"]],
             "木里": [["凉山彝族自治州", "四川省"]],"木里县": [["凉山彝族自治州", "四川省"]], "木里藏族自治县": [["凉山彝族自治州", "四川省"]], "盐源县": [["凉山彝族自治州", "四川省"]],
             "德昌县": [["凉山彝族自治州", "四川省"]],
             "会理县": [["凉山彝族自治州", "四川省"]], "会东县": [["凉山彝族自治州", "四川省"]], "宁南县": [["凉山彝族自治州", "四川省"]],
             "普格县": [["凉山彝族自治州", "四川省"]], "布拖县": [["凉山彝族自治州", "四川省"]], "金阳县": [["凉山彝族自治州", "四川省"]],
             "昭觉县": [["凉山彝族自治州", "四川省"]], "喜德县": [["凉山彝族自治州", "四川省"]], "冕宁县": [["凉山彝族自治州", "四川省"]],
             "越西县": [["凉山彝族自治州", "四川省"]], "甘洛县": [["凉山彝族自治州", "四川省"]], "美姑县": [["凉山彝族自治州", "四川省"]],
             "雷波县": [["凉山彝族自治州", "四川省"]], "南明区": [["贵阳市", "贵州省"]], "云岩区": [["贵阳市", "贵州省"]], "花溪区": [["贵阳市", "贵州省"]],
             "乌当区": [["贵阳市", "贵州省"]], "观山湖区": [["贵阳市", "贵州省"]], "开阳县": [["贵阳市", "贵州省"]], "息烽县": [["贵阳市", "贵州省"]],
             "修文县": [["贵阳市", "贵州省"]], "清镇市": [["贵阳市", "贵州省"]], "钟山区": [["六盘水市", "贵州省"]], "六枝特区": [["六盘水市", "贵州省"]],
             "水城县": [["六盘水市", "贵州省"]], "盘县": [["六盘水市", "贵州省"]], "盘州市": [["六盘水市", "贵州省"]], "红花岗区": [["遵义市", "贵州省"]],
             "汇川区": [["遵义市", "贵州省"]],
             "播州区": [["遵义市", "贵州省"]], "桐梓县": [["遵义市", "贵州省"]], "绥阳县": [["遵义市", "贵州省"]], "正安县": [["遵义市", "贵州省"]],
             "道真县": [["遵义市", "贵州省"]],"道真仡佬族苗族自治县": [["遵义市", "贵州省"]], "务川县": [["遵义市", "贵州省"]],"务川仡佬族苗族自治县": [["遵义市", "贵州省"]], "凤冈县": [["遵义市", "贵州省"]],
             "湄潭县": [["遵义市", "贵州省"]], "余庆县": [["遵义市", "贵州省"]], "习水县": [["遵义市", "贵州省"]], "赤水市": [["遵义市", "贵州省"]],
             "仁怀市": [["遵义市", "贵州省"]], "西秀区": [["安顺市", "贵州省"]], "平坝区": [["安顺市", "贵州省"]], "普定县": [["安顺市", "贵州省"]],
             "镇宁县": [["安顺市", "贵州省"]],"镇宁布依族苗族自治县": [["安顺市", "贵州省"]],"关岭县": [["安顺市", "贵州省"]], "关岭布依族苗族自治县": [["安顺市", "贵州省"]],"紫云县": [["安顺市", "贵州省"]], "紫云苗族布依族自治县": [["安顺市", "贵州省"]],
             "七星关区": [["毕节市", "贵州省"]], "大方县": [["毕节市", "贵州省"]], "黔西县": [["毕节市", "贵州省"]], "金沙县": [["毕节市", "贵州省"]],
             "织金县": [["毕节市", "贵州省"]], "纳雍县": [["毕节市", "贵州省"]],"威宁县": [["毕节市", "贵州省"]], "威宁彝族回族苗族自治县": [["毕节市", "贵州省"]], "赫章县": [["毕节市", "贵州省"]],
             "碧江区": [["铜仁市", "贵州省"]], "万山区": [["铜仁市", "贵州省"]], "江口县": [["铜仁市", "贵州省"]],"玉屏县": [["铜仁市", "贵州省"]], "玉屏侗族自治县": [["铜仁市", "贵州省"]],
             "石阡县": [["铜仁市", "贵州省"]], "思南县": [["铜仁市", "贵州省"]],"印江县": [["铜仁市", "贵州省"]],  "印江土家族苗族自治县": [["铜仁市", "贵州省"]], "德江县": [["铜仁市", "贵州省"]],
             "沿河县": [["铜仁市", "贵州省"]],"沿河土家族自治县": [["铜仁市", "贵州省"]], "松桃县": [["铜仁市", "贵州省"]], "松桃苗族自治县": [["铜仁市", "贵州省"]], "兴义市": [["黔西南布依族苗族自治州", "贵州省"]],
             "兴仁市": [["黔西南布依族苗族自治州", "贵州省"]], "普安县": [["黔西南布依族苗族自治州", "贵州省"]], "晴隆县": [["黔西南布依族苗族自治州", "贵州省"]],
             "贞丰县": [["黔西南布依族苗族自治州", "贵州省"]], "望谟县": [["黔西南布依族苗族自治州", "贵州省"]], "册亨县": [["黔西南布依族苗族自治州", "贵州省"]],
             "安龙县": [["黔西南布依族苗族自治州", "贵州省"]], "凯里市": [["黔东南苗族侗族自治州", "贵州省"]], "黄平县": [["黔东南苗族侗族自治州", "贵州省"]],
             "施秉县": [["黔东南苗族侗族自治州", "贵州省"]], "三穗县": [["黔东南苗族侗族自治州", "贵州省"]], "镇远县": [["黔东南苗族侗族自治州", "贵州省"]],
             "岑巩县": [["黔东南苗族侗族自治州", "贵州省"]], "天柱县": [["黔东南苗族侗族自治州", "贵州省"]], "锦屏县": [["黔东南苗族侗族自治州", "贵州省"]],
             "剑河县": [["黔东南苗族侗族自治州", "贵州省"]], "台江县": [["黔东南苗族侗族自治州", "贵州省"]], "黎平县": [["黔东南苗族侗族自治州", "贵州省"]],
             "榕江县": [["黔东南苗族侗族自治州", "贵州省"]], "从江县": [["黔东南苗族侗族自治州", "贵州省"]], "雷山县": [["黔东南苗族侗族自治州", "贵州省"]],
             "麻江县": [["黔东南苗族侗族自治州", "贵州省"]], "丹寨县": [["黔东南苗族侗族自治州", "贵州省"]], "都匀市": [["黔南布依族苗族自治州", "贵州省"]],
             "福泉市": [["黔南布依族苗族自治州", "贵州省"]], "荔波县": [["黔南布依族苗族自治州", "贵州省"]], "贵定县": [["黔南布依族苗族自治州", "贵州省"]],
             "瓮安县": [["黔南布依族苗族自治州", "贵州省"]], "独山县": [["黔南布依族苗族自治州", "贵州省"]], "平塘县": [["黔南布依族苗族自治州", "贵州省"]],
             "罗甸县": [["黔南布依族苗族自治州", "贵州省"]], "长顺县": [["黔南布依族苗族自治州", "贵州省"]], "龙里县": [["黔南布依族苗族自治州", "贵州省"]],
             "惠水县": [["黔南布依族苗族自治州", "贵州省"]], "三都县": [["黔南布依族苗族自治州", "贵州省"]],"三都水族自治县": [["黔南布依族苗族自治州", "贵州省"]], "五华区": [["昆明市", "云南省"]],
             "盘龙区": [["昆明市", "云南省"]], "官渡区": [["昆明市", "云南省"]], "西山区": [["昆明市", "云南省"]], "东川区": [["昆明市", "云南省"]],
             "呈贡区": [["昆明市", "云南省"]], "晋宁区": [["昆明市", "云南省"]], "富民县": [["昆明市", "云南省"]], "宜良县": [["昆明市", "云南省"]],
             "石林县": [["昆明市", "云南省"]], "石林彝族自治县": [["昆明市", "云南省"]], "嵩明县": [["昆明市", "云南省"]], "禄劝县": [["昆明市", "云南省"]],"禄劝彝族苗族自治县": [["昆明市", "云南省"]],
             "寻甸县": [["昆明市", "云南省"]],"寻甸回族彝族自治县": [["昆明市", "云南省"]], "安宁市": [["昆明市", "云南省"]], "麒麟区": [["曲靖市", "云南省"]], "沾益县": [["曲靖市", "云南省"]],
             "沾益区": [["曲靖市", "云南省"]],
             "马龙区": [["曲靖市", "云南省"]], "陆良县": [["曲靖市", "云南省"]], "师宗县": [["曲靖市", "云南省"]], "罗平县": [["曲靖市", "云南省"]],
             "富源县": [["曲靖市", "云南省"]], "会泽县": [["曲靖市", "云南省"]], "宣威市": [["曲靖市", "云南省"]], "红塔区": [["玉溪市", "云南省"]],
             "江川县": [["玉溪市", "云南省"]], "江川区": [["玉溪市", "云南省"]], "澄江县": [["玉溪市", "云南省"]], "通海县": [["玉溪市", "云南省"]],
             "华宁县": [["玉溪市", "云南省"]],
             "易门县": [["玉溪市", "云南省"]], "峨山县": [["玉溪市", "云南省"]],"峨山彝族自治县": [["玉溪市", "云南省"]], "新平县": [["玉溪市", "云南省"]],"新平彝族傣族自治县": [["玉溪市", "云南省"]],
             "元江县": [["玉溪市", "云南省"]],"元江哈尼族彝族傣族自治县": [["玉溪市", "云南省"]], "隆阳区": [["保山市", "云南省"]], "施甸县": [["保山市", "云南省"]],
             "龙陵县": [["保山市", "云南省"]], "昌宁县": [["保山市", "云南省"]], "腾冲市": [["保山市", "云南省"]], "昭阳区": [["昭通市", "云南省"]],
             "鲁甸县": [["昭通市", "云南省"]], "巧家县": [["昭通市", "云南省"]], "盐津县": [["昭通市", "云南省"]], "大关县": [["昭通市", "云南省"]],
             "永善县": [["昭通市", "云南省"]], "绥江县": [["昭通市", "云南省"]], "镇雄县": [["昭通市", "云南省"]], "彝良县": [["昭通市", "云南省"]],
             "威信县": [["昭通市", "云南省"]], "水富市": [["昭通市", "云南省"]], "古城区": [["丽江市", "云南省"]],"玉龙县": [["丽江市", "云南省"]], "玉龙纳西族自治县": [["丽江市", "云南省"]],
             "永胜县": [["丽江市", "云南省"]], "华坪县": [["丽江市", "云南省"]],"宁蒗县": [["丽江市", "云南省"]], "宁蒗彝族自治县": [["丽江市", "云南省"]], "思茅区": [["普洱市", "云南省"]],
             "宁洱县": [["普洱市", "云南省"]],"宁洱哈尼族彝族自治县": [["普洱市", "云南省"]],"墨江县": [["普洱市", "云南省"]], "墨江哈尼族自治县": [["普洱市", "云南省"]],"景东县": [["普洱市", "云南省"]], "景东彝族自治县": [["普洱市", "云南省"]],
             "景谷县": [["普洱市", "云南省"]],"景谷傣族彝族自治县": [["普洱市", "云南省"]],"镇沅县": [["普洱市", "云南省"]], "镇沅彝族哈尼族拉祜族自治县": [["普洱市", "云南省"]],"江城县": [["普洱市", "云南省"]], "江城哈尼族彝族自治县": [["普洱市", "云南省"]],
             "孟连县": [["普洱市", "云南省"]], "孟连傣族拉祜族佤族自治县": [["普洱市", "云南省"]],"澜沧县": [["普洱市", "云南省"]], "澜沧拉祜族自治县": [["普洱市", "云南省"]], "西盟县": [["普洱市", "云南省"]], "西盟佤族自治县": [["普洱市", "云南省"]],
             "临翔区": [["临沧市", "云南省"]], "凤庆县": [["临沧市", "云南省"]], "云县": [["临沧市", "云南省"]], "永德县": [["临沧市", "云南省"]],
             "镇康县": [["临沧市", "云南省"]], "双江县": [["临沧市", "云南省"]],"双江拉祜族佤族布朗族傣族自治县": [["临沧市", "云南省"]], "耿马县": [["临沧市", "云南省"]],"耿马傣族佤族自治县": [["临沧市", "云南省"]],
             "沧源县": [["临沧市", "云南省"]],"沧源佤族自治县": [["临沧市", "云南省"]], "楚雄市": [["楚雄彝族自治州", "云南省"]], "双柏县": [["楚雄彝族自治州", "云南省"]],
             "牟定县": [["楚雄彝族自治州", "云南省"]], "南华县": [["楚雄彝族自治州", "云南省"]], "姚安县": [["楚雄彝族自治州", "云南省"]],
             "大姚县": [["楚雄彝族自治州", "云南省"]], "永仁县": [["楚雄彝族自治州", "云南省"]], "元谋县": [["楚雄彝族自治州", "云南省"]],
             "武定县": [["楚雄彝族自治州", "云南省"]], "禄丰县": [["楚雄彝族自治州", "云南省"]], "个旧市": [["红河哈尼族彝族自治州", "云南省"]],
             "开远市": [["红河哈尼族彝族自治州", "云南省"]], "蒙自市": [["红河哈尼族彝族自治州", "云南省"]], "弥勒市": [["红河哈尼族彝族自治州", "云南省"]],
             "屏边县": [["红河哈尼族彝族自治州", "云南省"]],"屏边苗族自治县": [["红河哈尼族彝族自治州", "云南省"]], "建水县": [["红河哈尼族彝族自治州", "云南省"]], "石屏县": [["红河哈尼族彝族自治州", "云南省"]],
             "泸西县": [["红河哈尼族彝族自治州", "云南省"]], "元阳县": [["红河哈尼族彝族自治州", "云南省"]], "红河县": [["红河哈尼族彝族自治州", "云南省"]],
             "金平县": [["红河哈尼族彝族自治州", "云南省"]],"金平苗族瑶族傣族自治县": [["红河哈尼族彝族自治州", "云南省"]], "绿春县": [["红河哈尼族彝族自治州", "云南省"]],  "河口县": [["红河哈尼族彝族自治州", "云南省"]],"河口瑶族自治县": [["红河哈尼族彝族自治州", "云南省"]],
             "文山市": [["文山壮族苗族自治州", "云南省"]], "砚山县": [["文山壮族苗族自治州", "云南省"]], "西畴县": [["文山壮族苗族自治州", "云南省"]],
             "麻栗坡县": [["文山壮族苗族自治州", "云南省"]], "马关县": [["文山壮族苗族自治州", "云南省"]], "丘北县": [["文山壮族苗族自治州", "云南省"]],
             "广南县": [["文山壮族苗族自治州", "云南省"]], "富宁县": [["文山壮族苗族自治州", "云南省"]], "景洪市": [["西双版纳傣族自治州", "云南省"]],
             "勐海县": [["西双版纳傣族自治州", "云南省"]], "勐腊县": [["西双版纳傣族自治州", "云南省"]], "大理市": [["大理白族自治州", "云南省"]],
             "漾濞县": [["大理白族自治州", "云南省"]],"漾濞彝族自治县": [["大理白族自治州", "云南省"]], "祥云县": [["大理白族自治州", "云南省"]], "宾川县": [["大理白族自治州", "云南省"]],
             "弥渡县": [["大理白族自治州", "云南省"]], "南涧县": [["大理白族自治州", "云南省"]],"南涧彝族自治县": [["大理白族自治州", "云南省"]], "巍山县": [["大理白族自治州", "云南省"]],"巍山彝族回族自治县": [["大理白族自治州", "云南省"]],
             "永平县": [["大理白族自治州", "云南省"]], "云龙县": [["大理白族自治州", "云南省"]], "洱源县": [["大理白族自治州", "云南省"]],
             "剑川县": [["大理白族自治州", "云南省"]], "鹤庆县": [["大理白族自治州", "云南省"]], "瑞丽市": [["德宏傣族景颇族自治州", "云南省"]],
             "芒市": [["德宏傣族景颇族自治州", "云南省"]], "梁河县": [["德宏傣族景颇族自治州", "云南省"]], "盈江县": [["德宏傣族景颇族自治州", "云南省"]],
             "陇川县": [["德宏傣族景颇族自治州", "云南省"]], "泸水市": [["怒江傈僳族自治州", "云南省"]], "福贡县": [["怒江傈僳族自治州", "云南省"]],
             "贡山县": [["怒江傈僳族自治州", "云南省"]],  "贡山独龙族怒族自治县": [["怒江傈僳族自治州", "云南省"]], "兰坪县": [["怒江傈僳族自治州", "云南省"]],
             "兰坪白族普米族自治县": [["怒江傈僳族自治州", "云南省"]], "香格里拉市": [["迪庆藏族自治州", "云南省"]],
             "德钦县": [["迪庆藏族自治州", "云南省"]], "维西县": [["迪庆藏族自治州", "云南省"]], "维西傈僳族自治县": [["迪庆藏族自治州", "云南省"]],
             "城关区": [["拉萨市", "西藏自治区"], ["兰州市", "甘肃省"]],
             "堆龙德庆区": [["拉萨市", "西藏自治区"]], "达孜区": [["拉萨市", "西藏自治区"]], "林周县": [["拉萨市", "西藏自治区"]],
             "当雄县": [["拉萨市", "西藏自治区"]], "尼木县": [["拉萨市", "西藏自治区"]], "曲水县": [["拉萨市", "西藏自治区"]],
             "墨竹工卡县": [["拉萨市", "西藏自治区"]], "格尔木藏青工业园区": [["拉萨市", "西藏自治区"]], "拉萨经济技术开发区": [["拉萨市", "西藏自治区"]],
             "西藏文化旅游创意园区": [["拉萨市", "西藏自治区"]], "达孜工业园区": [["拉萨市", "西藏自治区"]], "桑珠孜区": [["日喀则市", "西藏自治区"]],
             "南木林县": [["日喀则市", "西藏自治区"]], "江孜县": [["日喀则市", "西藏自治区"]], "定日县": [["日喀则市", "西藏自治区"]],
             "萨迦县": [["日喀则市", "西藏自治区"]], "拉孜县": [["日喀则市", "西藏自治区"]], "昂仁县": [["日喀则市", "西藏自治区"]],
             "谢通门县": [["日喀则市", "西藏自治区"]], "白朗县": [["日喀则市", "西藏自治区"]], "仁布县": [["日喀则市", "西藏自治区"]],
             "康马县": [["日喀则市", "西藏自治区"]], "定结县": [["日喀则市", "西藏自治区"]], "仲巴县": [["日喀则市", "西藏自治区"]],
             "亚东县": [["日喀则市", "西藏自治区"]], "吉隆县": [["日喀则市", "西藏自治区"]], "聂拉木县": [["日喀则市", "西藏自治区"]],
             "萨嘎县": [["日喀则市", "西藏自治区"]], "岗巴县": [["日喀则市", "西藏自治区"]], "卡若区": [["昌都市", "西藏自治区"]],
             "江达县": [["昌都市", "西藏自治区"]], "贡觉县": [["昌都市", "西藏自治区"]], "类乌齐县": [["昌都市", "西藏自治区"]],
             "丁青县": [["昌都市", "西藏自治区"]], "察雅县": [["昌都市", "西藏自治区"]], "八宿县": [["昌都市", "西藏自治区"]], "左贡县": [["昌都市", "西藏自治区"]],
             "芒康县": [["昌都市", "西藏自治区"]], "洛隆县": [["昌都市", "西藏自治区"]], "边坝县": [["昌都市", "西藏自治区"]], "巴宜区": [["林芝市", "西藏自治区"]],
             "工布江达县": [["林芝市", "西藏自治区"]], "米林县": [["林芝市", "西藏自治区"]], "墨脱县": [["林芝市", "西藏自治区"]],
             "波密县": [["林芝市", "西藏自治区"]], "察隅县": [["林芝市", "西藏自治区"]], "朗县": [["林芝市", "西藏自治区"]], "乃东区": [["山南市", "西藏自治区"]],
             "扎囊县": [["山南市", "西藏自治区"]], "贡嘎县": [["山南市", "西藏自治区"]], "桑日县": [["山南市", "西藏自治区"]], "琼结县": [["山南市", "西藏自治区"]],
             "曲松县": [["山南市", "西藏自治区"]], "措美县": [["山南市", "西藏自治区"]], "洛扎县": [["山南市", "西藏自治区"]], "加查县": [["山南市", "西藏自治区"]],
             "隆子县": [["山南市", "西藏自治区"]], "错那县": [["山南市", "西藏自治区"]], "浪卡子县": [["山南市", "西藏自治区"]],
             "色尼区": [["那曲市", "西藏自治区"]], "嘉黎县": [["那曲市", "西藏自治区"]], "比如县": [["那曲市", "西藏自治区"]], "聂荣县": [["那曲市", "西藏自治区"]],
             "安多县": [["那曲市", "西藏自治区"]], "申扎县": [["那曲市", "西藏自治区"]], "索县": [["那曲市", "西藏自治区"]], "班戈县": [["那曲市", "西藏自治区"]],
             "巴青县": [["那曲市", "西藏自治区"]], "尼玛县": [["那曲市", "西藏自治区"]], "双湖县": [["那曲市", "西藏自治区"]],
             "普兰县": [["阿里地区", "西藏自治区"]], "札达县": [["阿里地区", "西藏自治区"]], "噶尔县": [["阿里地区", "西藏自治区"]],
             "日土县": [["阿里地区", "西藏自治区"]], "革吉县": [["阿里地区", "西藏自治区"]], "改则县": [["阿里地区", "西藏自治区"]],
             "措勤县": [["阿里地区", "西藏自治区"]], "碑林区": [["西安市", "陕西省"]], "莲湖区": [["西安市", "陕西省"]], "灞桥区": [["西安市", "陕西省"]],
             "未央区": [["西安市", "陕西省"]], "雁塔区": [["西安市", "陕西省"]], "阎良区": [["西安市", "陕西省"]], "临潼区": [["西安市", "陕西省"]],
             "高陵区": [["西安市", "陕西省"]], "鄠邑区": [["西安市", "陕西省"]], "蓝田县": [["西安市", "陕西省"]], "周至县": [["西安市", "陕西省"]],
             "王益区": [["铜川市", "陕西省"]], "印台区": [["铜川市", "陕西省"]], "耀州区": [["铜川市", "陕西省"]], "宜君县": [["铜川市", "陕西省"]],
             "渭滨区": [["宝鸡市", "陕西省"]], "金台区": [["宝鸡市", "陕西省"]], "陈仓区": [["宝鸡市", "陕西省"]], "凤翔县": [["宝鸡市", "陕西省"]],
             "岐山县": [["宝鸡市", "陕西省"]], "扶风县": [["宝鸡市", "陕西省"]], "眉县": [["宝鸡市", "陕西省"]], "陇县": [["宝鸡市", "陕西省"]],
             "千阳县": [["宝鸡市", "陕西省"]], "麟游县": [["宝鸡市", "陕西省"]], "凤县": [["宝鸡市", "陕西省"]], "太白县": [["宝鸡市", "陕西省"]],
             "秦都区": [["咸阳市", "陕西省"]], "杨陵区": [["咸阳市", "陕西省"]], "渭城区": [["咸阳市", "陕西省"]], "三原县": [["咸阳市", "陕西省"]],
             "泾阳县": [["咸阳市", "陕西省"]], "乾县": [["咸阳市", "陕西省"]], "礼泉县": [["咸阳市", "陕西省"]], "永寿县": [["咸阳市", "陕西省"]],
             "长武县": [["咸阳市", "陕西省"]], "旬邑县": [["咸阳市", "陕西省"]], "淳化县": [["咸阳市", "陕西省"]], "武功县": [["咸阳市", "陕西省"]],
             "兴平市": [["咸阳市", "陕西省"]], "彬州市": [["咸阳市", "陕西省"]], "临渭区": [["渭南市", "陕西省"]], "华州区": [["渭南市", "陕西省"]],
             "潼关县": [["渭南市", "陕西省"]], "大荔县": [["渭南市", "陕西省"]], "合阳县": [["渭南市", "陕西省"]], "澄城县": [["渭南市", "陕西省"]],
             "蒲城县": [["渭南市", "陕西省"]], "白水县": [["渭南市", "陕西省"]], "富平县": [["渭南市", "陕西省"]], "韩城市": [["渭南市", "陕西省"]],
             "华阴市": [["渭南市", "陕西省"]], "宝塔区": [["延安市", "陕西省"]], "安塞区": [["延安市", "陕西省"]], "延长县": [["延安市", "陕西省"]],
             "延川县": [["延安市", "陕西省"]], "志丹县": [["延安市", "陕西省"]], "吴起县": [["延安市", "陕西省"]], "甘泉县": [["延安市", "陕西省"]],
             "富县": [["延安市", "陕西省"]], "洛川县": [["延安市", "陕西省"]], "宜川县": [["延安市", "陕西省"]], "黄龙县": [["延安市", "陕西省"]],
             "黄陵县": [["延安市", "陕西省"]], "子长市": [["延安市", "陕西省"]], "汉台区": [["汉中市", "陕西省"]], "南郑区": [["汉中市", "陕西省"]],
             "城固县": [["汉中市", "陕西省"]], "洋县": [["汉中市", "陕西省"]], "西乡县": [["汉中市", "陕西省"]], "勉县": [["汉中市", "陕西省"]],
             "宁强县": [["汉中市", "陕西省"]], "略阳县": [["汉中市", "陕西省"]], "镇巴县": [["汉中市", "陕西省"]], "留坝县": [["汉中市", "陕西省"]],
             "佛坪县": [["汉中市", "陕西省"]], "榆阳区": [["榆林市", "陕西省"]], "横山区": [["榆林市", "陕西省"]], "府谷县": [["榆林市", "陕西省"]],
             "靖边县": [["榆林市", "陕西省"]], "定边县": [["榆林市", "陕西省"]], "绥德县": [["榆林市", "陕西省"]], "米脂县": [["榆林市", "陕西省"]],
             "佳县": [["榆林市", "陕西省"]], "吴堡县": [["榆林市", "陕西省"]], "清涧县": [["榆林市", "陕西省"]], "子洲县": [["榆林市", "陕西省"]],
             "神木市": [["榆林市", "陕西省"]], "汉滨区": [["安康市", "陕西省"]], "汉阴县": [["安康市", "陕西省"]], "石泉县": [["安康市", "陕西省"]],
             "宁陕县": [["安康市", "陕西省"]], "紫阳县": [["安康市", "陕西省"]], "岚皋县": [["安康市", "陕西省"]], "平利县": [["安康市", "陕西省"]],
             "镇坪县": [["安康市", "陕西省"]], "旬阳县": [["安康市", "陕西省"]], "白河县": [["安康市", "陕西省"]], "商州区": [["商洛市", "陕西省"]],
             "洛南县": [["商洛市", "陕西省"]], "丹凤县": [["商洛市", "陕西省"]], "商南县": [["商洛市", "陕西省"]], "山阳县": [["商洛市", "陕西省"]],
             "镇安县": [["商洛市", "陕西省"]], "柞水县": [["商洛市", "陕西省"]], "七里河区": [["兰州市", "甘肃省"]], "西固区": [["兰州市", "甘肃省"]],
             "安宁区": [["兰州市", "甘肃省"]], "红古区": [["兰州市", "甘肃省"]], "永登县": [["兰州市", "甘肃省"]], "皋兰县": [["兰州市", "甘肃省"]],
             "榆中县": [["兰州市", "甘肃省"]], "兰州新区": [["兰州市", "甘肃省"]], "市辖区": [["嘉峪关市", "甘肃省"]], "金川区": [["金昌市", "甘肃省"]],
             "永昌县": [["金昌市", "甘肃省"]], "白银区": [["白银市", "甘肃省"]], "平川区": [["白银市", "甘肃省"]], "靖远县": [["白银市", "甘肃省"]],
             "会宁县": [["白银市", "甘肃省"]], "景泰县": [["白银市", "甘肃省"]], "秦州区": [["天水市", "甘肃省"]], "麦积区": [["天水市", "甘肃省"]],
             "清水县": [["天水市", "甘肃省"]], "秦安县": [["天水市", "甘肃省"]], "甘谷县": [["天水市", "甘肃省"]], "武山县": [["天水市", "甘肃省"]],
             "张家川县": [["天水市", "甘肃省"]], "张家川回族自治县": [["天水市", "甘肃省"]], "凉州区": [["武威市", "甘肃省"]], "民勤县": [["武威市", "甘肃省"]], "古浪县": [["武威市", "甘肃省"]],
             "天祝县": [["武威市", "甘肃省"]], "天祝藏族自治县": [["武威市", "甘肃省"]], "甘州区": [["张掖市", "甘肃省"]], "肃南县": [["张掖市", "甘肃省"]],"肃南裕固族自治县": [["张掖市", "甘肃省"]],
             "民乐县": [["张掖市", "甘肃省"]], "临泽县": [["张掖市", "甘肃省"]], "高台县": [["张掖市", "甘肃省"]], "山丹县": [["张掖市", "甘肃省"]],
             "崆峒区": [["平凉市", "甘肃省"]], "泾川县": [["平凉市", "甘肃省"]], "灵台县": [["平凉市", "甘肃省"]], "崇信县": [["平凉市", "甘肃省"]],
             "庄浪县": [["平凉市", "甘肃省"]], "静宁县": [["平凉市", "甘肃省"]], "华亭市": [["平凉市", "甘肃省"]], "肃州区": [["酒泉市", "甘肃省"]],
             "金塔县": [["酒泉市", "甘肃省"]], "瓜州县": [["酒泉市", "甘肃省"]],"肃北县": [["酒泉市", "甘肃省"]], "肃北蒙古族自治县": [["酒泉市", "甘肃省"]],
             "阿克塞县": [["酒泉市", "甘肃省"]],"阿克塞哈萨克族自治县": [["酒泉市", "甘肃省"]], "玉门市": [["酒泉市", "甘肃省"]], "敦煌市": [["酒泉市", "甘肃省"]], "西峰区": [["庆阳市", "甘肃省"]],
             "庆城县": [["庆阳市", "甘肃省"]], "环县": [["庆阳市", "甘肃省"]], "华池县": [["庆阳市", "甘肃省"]], "合水县": [["庆阳市", "甘肃省"]],
             "正宁县": [["庆阳市", "甘肃省"]], "宁县": [["庆阳市", "甘肃省"]], "镇原县": [["庆阳市", "甘肃省"]], "安定区": [["定西市", "甘肃省"]],
             "通渭县": [["定西市", "甘肃省"]], "陇西县": [["定西市", "甘肃省"]], "渭源县": [["定西市", "甘肃省"]], "临洮县": [["定西市", "甘肃省"]],
             "漳县": [["定西市", "甘肃省"]], "岷县": [["定西市", "甘肃省"]], "武都区": [["陇南市", "甘肃省"]], "成县": [["陇南市", "甘肃省"]],
             "文县": [["陇南市", "甘肃省"]], "宕昌县": [["陇南市", "甘肃省"]], "康县": [["陇南市", "甘肃省"]], "西和县": [["陇南市", "甘肃省"]],
             "礼县": [["陇南市", "甘肃省"]], "徽县": [["陇南市", "甘肃省"]], "两当县": [["陇南市", "甘肃省"]], "临夏市": [["临夏回族自治州", "甘肃省"]],
             "临夏县": [["临夏回族自治州", "甘肃省"]], "康乐县": [["临夏回族自治州", "甘肃省"]], "永靖县": [["临夏回族自治州", "甘肃省"]],
             "广河县": [["临夏回族自治州", "甘肃省"]], "和政县": [["临夏回族自治州", "甘肃省"]],"东乡族县": [["临夏回族自治州", "甘肃省"]], "东乡族自治县": [["临夏回族自治州", "甘肃省"]],
             "积石山县": [["临夏回族自治州", "甘肃省"]],"积石山保安族东乡族撒拉族自治县": [["临夏回族自治州", "甘肃省"]], "合作市": [["甘南藏族自治州", "甘肃省"]], "临潭县": [["甘南藏族自治州", "甘肃省"]],
             "卓尼县": [["甘南藏族自治州", "甘肃省"]], "舟曲县": [["甘南藏族自治州", "甘肃省"]], "迭部县": [["甘南藏族自治州", "甘肃省"]],
             "玛曲县": [["甘南藏族自治州", "甘肃省"]], "碌曲县": [["甘南藏族自治州", "甘肃省"]], "夏河县": [["甘南藏族自治州", "甘肃省"]],
             "城东区": [["西宁市", "青海省"]], "城西区": [["西宁市", "青海省"]], "城北区": [["西宁市", "青海省"]],"大通县": [["西宁市", "青海省"]], "大通回族土族自治县": [["西宁市", "青海省"]],
             "湟中县": [["西宁市", "青海省"]], "湟源县": [["西宁市", "青海省"]], "乐都区": [["海东市", "青海省"]], "平安区": [["海东市", "青海省"]],
             "民和县": [["海东市", "青海省"]],"民和回族土族自治县": [["海东市", "青海省"]], "互助县": [["海东市", "青海省"]], "互助土族自治县": [["海东市", "青海省"]],"化隆县": [["海东市", "青海省"]], "化隆回族自治县": [["海东市", "青海省"]],
             "循化撒拉族自治县": [["海东市", "青海省"]], "门源回族自治县": [["海北藏族自治州", "青海省"]], "祁连县": [["海北藏族自治州", "青海省"]],
             "海晏县": [["海北藏族自治州", "青海省"]], "刚察县": [["海北藏族自治州", "青海省"]], "同仁县": [["黄南藏族自治州", "青海省"]],
             "尖扎县": [["黄南藏族自治州", "青海省"]], "泽库县": [["黄南藏族自治州", "青海省"]], "河南县": [["黄南藏族自治州", "青海省"]],"河南蒙古族自治县": [["黄南藏族自治州", "青海省"]],
             "共和县": [["海南藏族自治州", "青海省"]], "同德县": [["海南藏族自治州", "青海省"]], "贵德县": [["海南藏族自治州", "青海省"]],
             "兴海县": [["海南藏族自治州", "青海省"]], "贵南县": [["海南藏族自治州", "青海省"]], "玛沁县": [["果洛藏族自治州", "青海省"]],
             "班玛县": [["果洛藏族自治州", "青海省"]], "甘德县": [["果洛藏族自治州", "青海省"]], "达日县": [["果洛藏族自治州", "青海省"]],
             "久治县": [["果洛藏族自治州", "青海省"]], "玛多县": [["果洛藏族自治州", "青海省"]], "玉树市": [["玉树藏族自治州", "青海省"]],
             "杂多县": [["玉树藏族自治州", "青海省"]], "称多县": [["玉树藏族自治州", "青海省"]], "治多县": [["玉树藏族自治州", "青海省"]],
             "囊谦县": [["玉树藏族自治州", "青海省"]], "曲麻莱县": [["玉树藏族自治州", "青海省"]], "格尔木市": [["海西蒙古族藏族自治州", "青海省"]],
             "德令哈市": [["海西蒙古族藏族自治州", "青海省"]], "茫崖市": [["海西蒙古族藏族自治州", "青海省"]], "乌兰县": [["海西蒙古族藏族自治州", "青海省"]],
             "都兰县": [["海西蒙古族藏族自治州", "青海省"]], "天峻县": [["海西蒙古族藏族自治州", "青海省"]], "大柴旦": [["海西蒙古族藏族自治州", "青海省"]],
             "大柴旦行政委员会": [["海西蒙古族藏族自治州", "青海省"]],
             "兴庆区": [["银川市", "宁夏回族自治区"]], "西夏区": [["银川市", "宁夏回族自治区"]], "金凤区": [["银川市", "宁夏回族自治区"]],
             "永宁县": [["银川市", "宁夏回族自治区"]], "贺兰县": [["银川市", "宁夏回族自治区"]], "灵武市": [["银川市", "宁夏回族自治区"]],
             "大武口区": [["石嘴山市", "宁夏回族自治区"]], "惠农区": [["石嘴山市", "宁夏回族自治区"]], "平罗县": [["石嘴山市", "宁夏回族自治区"]],
             "利通区": [["吴忠市", "宁夏回族自治区"]], "红寺堡区": [["吴忠市", "宁夏回族自治区"]], "盐池县": [["吴忠市", "宁夏回族自治区"]],
             "同心县": [["吴忠市", "宁夏回族自治区"]], "青铜峡市": [["吴忠市", "宁夏回族自治区"]], "原州区": [["固原市", "宁夏回族自治区"]],
             "西吉县": [["固原市", "宁夏回族自治区"]], "隆德县": [["固原市", "宁夏回族自治区"]], "泾源县": [["固原市", "宁夏回族自治区"]],
             "彭阳县": [["固原市", "宁夏回族自治区"]], "沙坡头区": [["中卫市", "宁夏回族自治区"]], "中宁县": [["中卫市", "宁夏回族自治区"]],
             "海原县": [["中卫市", "宁夏回族自治区"]], "天山区": [["乌鲁木齐市", "新疆维吾尔自治区"]], "沙依巴克区": [["乌鲁木齐市", "新疆维吾尔自治区"]],
             "新市区": [["乌鲁木齐市", "新疆维吾尔自治区"]], "水磨沟区": [["乌鲁木齐市", "新疆维吾尔自治区"]], "头屯河区": [["乌鲁木齐市", "新疆维吾尔自治区"]],
             "达坂城区": [["乌鲁木齐市", "新疆维吾尔自治区"]], "米东区": [["乌鲁木齐市", "新疆维吾尔自治区"]], "乌鲁木齐县": [["乌鲁木齐市", "新疆维吾尔自治区"]],
             "独山子区": [["克拉玛依市", "新疆维吾尔自治区"]], "克拉玛依区": [["克拉玛依市", "新疆维吾尔自治区"]], "白碱滩区": [["克拉玛依市", "新疆维吾尔自治区"]],
             "乌尔禾区": [["克拉玛依市", "新疆维吾尔自治区"]], "高昌区": [["吐鲁番市", "新疆维吾尔自治区"]], "鄯善县": [["吐鲁番市", "新疆维吾尔自治区"]],
             "托克逊县": [["吐鲁番市", "新疆维吾尔自治区"]], "伊州区": [["哈密市", "新疆维吾尔自治区"]],"巴里坤县": [["哈密市", "新疆维吾尔自治区"]], "巴里坤哈萨克自治县": [["哈密市", "新疆维吾尔自治区"]],
             "伊吾县": [["哈密市", "新疆维吾尔自治区"]], "昌吉市": [["昌吉回族自治州", "新疆维吾尔自治区"]], "阜康市": [["昌吉回族自治州", "新疆维吾尔自治区"]],
             "呼图壁县": [["昌吉回族自治州", "新疆维吾尔自治区"]], "玛纳斯县": [["昌吉回族自治州", "新疆维吾尔自治区"]], "奇台县": [["昌吉回族自治州", "新疆维吾尔自治区"]],
             "吉木萨尔县": [["昌吉回族自治州", "新疆维吾尔自治区"]],"木垒县": [["昌吉回族自治州", "新疆维吾尔自治区"]], "木垒哈萨克自治县": [["昌吉回族自治州", "新疆维吾尔自治区"]],
             "博乐市": [["博尔塔拉蒙古自治州", "新疆维吾尔自治区"]], "阿拉山口市": [["博尔塔拉蒙古自治州", "新疆维吾尔自治区"]],
             "精河县": [["博尔塔拉蒙古自治州", "新疆维吾尔自治区"]], "温泉县": [["博尔塔拉蒙古自治州", "新疆维吾尔自治区"]],
             "库尔勒市": [["巴音郭楞蒙古自治州", "新疆维吾尔自治区"]], "轮台县": [["巴音郭楞蒙古自治州", "新疆维吾尔自治区"]],
             "尉犁县": [["巴音郭楞蒙古自治州", "新疆维吾尔自治区"]], "若羌县": [["巴音郭楞蒙古自治州", "新疆维吾尔自治区"]], "且末县": [["巴音郭楞蒙古自治州", "新疆维吾尔自治区"]],
             "焉耆县": [["巴音郭楞蒙古自治州", "新疆维吾尔自治区"]], "焉耆回族自治县": [["巴音郭楞蒙古自治州", "新疆维吾尔自治区"]], "和静县": [["巴音郭楞蒙古自治州", "新疆维吾尔自治区"]],
             "和硕县": [["巴音郭楞蒙古自治州", "新疆维吾尔自治区"]], "博湖县": [["巴音郭楞蒙古自治州", "新疆维吾尔自治区"]],
             "库尔勒经济技术开发区": [["巴音郭楞蒙古自治州", "新疆维吾尔自治区"]], "阿克苏市": [["阿克苏地区", "新疆维吾尔自治区"]], "温宿县": [["阿克苏地区", "新疆维吾尔自治区"]],
             "库车县": [["阿克苏地区", "新疆维吾尔自治区"]], "沙雅县": [["阿克苏地区", "新疆维吾尔自治区"]], "新和县": [["阿克苏地区", "新疆维吾尔自治区"]],
             "拜城县": [["阿克苏地区", "新疆维吾尔自治区"]], "乌什县": [["阿克苏地区", "新疆维吾尔自治区"]], "阿瓦提县": [["阿克苏地区", "新疆维吾尔自治区"]],
             "柯坪县": [["阿克苏地区", "新疆维吾尔自治区"]], "阿图什市": [["克孜勒苏柯尔克孜自治州", "新疆维吾尔自治区"]],
             "阿克陶县": [["克孜勒苏柯尔克孜自治州", "新疆维吾尔自治区"]], "阿合奇县": [["克孜勒苏柯尔克孜自治州", "新疆维吾尔自治区"]],
             "乌恰县": [["克孜勒苏柯尔克孜自治州", "新疆维吾尔自治区"]], "喀什市": [["喀什地区", "新疆维吾尔自治区"]], "疏附县": [["喀什地区", "新疆维吾尔自治区"]],
             "疏勒县": [["喀什地区", "新疆维吾尔自治区"]], "英吉沙县": [["喀什地区", "新疆维吾尔自治区"]], "泽普县": [["喀什地区", "新疆维吾尔自治区"]],
             "莎车县": [["喀什地区", "新疆维吾尔自治区"]], "叶城县": [["喀什地区", "新疆维吾尔自治区"]], "麦盖提县": [["喀什地区", "新疆维吾尔自治区"]],
             "岳普湖县": [["喀什地区", "新疆维吾尔自治区"]], "伽师县": [["喀什地区", "新疆维吾尔自治区"]], "巴楚县": [["喀什地区", "新疆维吾尔自治区"]],
             "塔什库尔干县": [["喀什地区", "新疆维吾尔自治区"]],"塔什库尔干塔吉克自治县": [["喀什地区", "新疆维吾尔自治区"]], "和田市": [["和田地区", "新疆维吾尔自治区"]], "和田县": [["和田地区", "新疆维吾尔自治区"]],
             "墨玉县": [["和田地区", "新疆维吾尔自治区"]], "皮山县": [["和田地区", "新疆维吾尔自治区"]], "洛浦县": [["和田地区", "新疆维吾尔自治区"]],
             "策勒县": [["和田地区", "新疆维吾尔自治区"]], "于田县": [["和田地区", "新疆维吾尔自治区"]], "民丰县": [["和田地区", "新疆维吾尔自治区"]],
             "伊宁市": [["伊犁哈萨克自治州", "新疆维吾尔自治区"]], "奎屯市": [["伊犁哈萨克自治州", "新疆维吾尔自治区"]], "霍尔果斯市": [["伊犁哈萨克自治州", "新疆维吾尔自治区"]],
             "伊宁县": [["伊犁哈萨克自治州", "新疆维吾尔自治区"]], "察布查尔县": [["伊犁哈萨克自治州", "新疆维吾尔自治区"]],"察布查尔锡伯自治县": [["伊犁哈萨克自治州", "新疆维吾尔自治区"]],
             "霍城县": [["伊犁哈萨克自治州", "新疆维吾尔自治区"]], "巩留县": [["伊犁哈萨克自治州", "新疆维吾尔自治区"]], "新源县": [["伊犁哈萨克自治州", "新疆维吾尔自治区"]],
             "昭苏县": [["伊犁哈萨克自治州", "新疆维吾尔自治区"]], "特克斯县": [["伊犁哈萨克自治州", "新疆维吾尔自治区"]], "尼勒克县": [["伊犁哈萨克自治州", "新疆维吾尔自治区"]],
             "塔城市": [["塔城地区", "新疆维吾尔自治区"]], "乌苏市": [["塔城地区", "新疆维吾尔自治区"]], "额敏县": [["塔城地区", "新疆维吾尔自治区"]],
             "沙湾县": [["塔城地区", "新疆维吾尔自治区"]], "托里县": [["塔城地区", "新疆维吾尔自治区"]], "裕民县": [["塔城地区", "新疆维吾尔自治区"]],
             "和布克赛尔县": [["塔城地区", "新疆维吾尔自治区"]],"和布克赛尔蒙古自治县": [["塔城地区", "新疆维吾尔自治区"]], "阿勒泰市": [["阿勒泰地区", "新疆维吾尔自治区"]], "布尔津县": [["阿勒泰地区", "新疆维吾尔自治区"]],
             "富蕴县": [["阿勒泰地区", "新疆维吾尔自治区"]], "福海县": [["阿勒泰地区", "新疆维吾尔自治区"]], "哈巴河县": [["阿勒泰地区", "新疆维吾尔自治区"]],
             "青河县": [["阿勒泰地区", "新疆维吾尔自治区"]], "吉木乃县": [["阿勒泰地区", "新疆维吾尔自治区"]], "新城街道": [["石河子市", "新疆维吾尔自治区"]],
             "向阳街道": [["石河子市", "新疆维吾尔自治区"]], "红山街道": [["石河子市", "新疆维吾尔自治区"]], "老街街道": [["石河子市", "新疆维吾尔自治区"]],
             "北泉镇": [["石河子市", "新疆维吾尔自治区"]], "石河子镇": [["石河子市", "新疆维吾尔自治区"]], "兵团一五二团": [["石河子市", "新疆维吾尔自治区"]],
             "金银川路街道": [["阿拉尔市", "新疆维吾尔自治区"]], "幸福路街道": [["阿拉尔市", "新疆维吾尔自治区"]], "青松路街道": [["阿拉尔市", "新疆维吾尔自治区"]],
             "南口街道": [["阿拉尔市", "新疆维吾尔自治区"]], "托喀依乡": [["阿拉尔市", "新疆维吾尔自治区"]], "兵团七团": [["阿拉尔市", "新疆维吾尔自治区"]],
             "兵团八团": [["阿拉尔市", "新疆维吾尔自治区"]], "兵团十团": [["阿拉尔市", "新疆维吾尔自治区"]], "兵团十一团": [["阿拉尔市", "新疆维吾尔自治区"]],
             "兵团十二团": [["阿拉尔市", "新疆维吾尔自治区"]], "兵团十三团": [["阿拉尔市", "新疆维吾尔自治区"]], "兵团十四团": [["阿拉尔市", "新疆维吾尔自治区"]],
             "兵团十六团": [["阿拉尔市", "新疆维吾尔自治区"]], "兵团九团": [["阿拉尔市", "新疆维吾尔自治区"]], "兵团第一师水利水电工程处": [["阿拉尔市", "新疆维吾尔自治区"]],
             "兵团第一师塔里木灌区水利管理处": [["阿拉尔市", "新疆维吾尔自治区"]], "兵团一团": [["阿拉尔市", "新疆维吾尔自治区"]],
             "兵团农一师沙井子水利管理处": [["阿拉尔市", "新疆维吾尔自治区"]], "西工业园区管理委员会": [["阿拉尔市", "新疆维吾尔自治区"]],
             "兵团二团": [["阿拉尔市", "新疆维吾尔自治区"]], "兵团三团": [["阿拉尔市", "新疆维吾尔自治区"]], "兵团五团": [["阿拉尔市", "新疆维吾尔自治区"]],
             "兵团六团": [["阿拉尔市", "新疆维吾尔自治区"]], "兵团四团": [["阿拉尔市", "新疆维吾尔自治区"]], "齐干却勒街道": [["图木舒克市", "新疆维吾尔自治区"]],
             "前海街道": [["图木舒克市", "新疆维吾尔自治区"]], "永安坝街道": [["图木舒克市", "新疆维吾尔自治区"]], "兵团四十一团": [["图木舒克市", "新疆维吾尔自治区"]],
             "兵团四十四团": [["图木舒克市", "新疆维吾尔自治区"]], "兵团四十九团": [["图木舒克市", "新疆维吾尔自治区"]], "兵团五十团": [["图木舒克市", "新疆维吾尔自治区"]],
             "兵团五十一团": [["图木舒克市", "新疆维吾尔自治区"]], "兵团五十三团": [["图木舒克市", "新疆维吾尔自治区"]],
             "兵团图木舒克市喀拉拜勒镇": [["图木舒克市", "新疆维吾尔自治区"]], "军垦路街道": [["五家渠市", "新疆维吾尔自治区"]], "青湖路街道": [["五家渠市", "新疆维吾尔自治区"]],
             "人民路街道": [["五家渠市", "新疆维吾尔自治区"]], "兵团一零一团": [["五家渠市", "新疆维吾尔自治区"]], "兵团一零二团": [["五家渠市", "新疆维吾尔自治区"]],
             "兵团一零三团": [["五家渠市", "新疆维吾尔自治区"]], "博古其镇": [["铁门关市", "新疆维吾尔自治区"]], "双丰镇": [["铁门关市", "新疆维吾尔自治区"]]}

NOT_VALUE = ["暂无", "暂未提供", "暂未填写", "未知"]
# 第二级行政区域可能的结尾
CITY_EXTEND = ["市", "自治州", "县", "自治县", "特别行政区", "地区"]
# 第三级行政机构可能的结尾
AREA_EXTEND = ["县", "自治县", "区", "市", "自治州", "乡", "镇", "街道", "经济开发区", "经济技术开发区", "技术产业开发区", "管理区"]
# 通过编辑距离计算是否屏弃  {"key":距离}
CITY_STOP = {"路": 2, "号": 2, "號": 2, "街": 2, "公寓": 2, "公司": 1, "广场": 2, "村": 1, "巷": 2}
# 必须都存在于信息中,主要是针对一些特殊的地区做处理
CITY_JOIN = {
    "东区": ["攀枝花", "攀枝花市"],
    "西区": ["攀枝花", "攀枝花市"],
    "仁和": ["攀枝花", "攀枝花市"],
    "城东区": ["西宁市", "西宁", "青海省", "青海"],
    "城西区": ["西宁市", "西宁", "青海省", "青海"],
    "城北区": ["西宁市", "西宁", "青海省", "青海"],
}

#  城市关键字加权，比如分公司，办事处理，那么对离最近的关键词进行加权
CITY_WEIGHTED_KEYWORD = ("分公司", "办事处", "经营处", "代理处", "分支机构", "分理办", "代办点")


# 自定义词库 ，并返回全国地区词
def __add_jieba_words():
    jie_words = set()
    is_addword = len(jieba.user_word_tag_tab) == 0
    area_path_sort = sorted(AREA_PATH.items(), key=lambda x: len(x[0]), reverse=False)
    for c_item in area_path_sort:
        c = c_item[0]
        jie_words.add(c)
        for _extend in AREA_EXTEND:
            if _extend in c:
                _city = re.sub(re.compile(_extend + "$"), '', c)
                jie_words.add(_city)
                if len(_city) > 1 and is_addword:
                    jieba.add_word(_city, freq=50, tag="ns")
        if is_addword:
            jieba.add_word(c, freq=200 + len(_city), tag="ns")

    for c in ALL_CITYS:
        for _extend in CITY_EXTEND:
            if _extend in c:
                _city = re.sub(re.compile(_extend + "$"), '', c)
                jie_words.add(_city)
                if len(_city) > 1 and is_addword:
                    jieba.add_word(_city, freq=900, tag="ns")
        jie_words.add(c)
        if is_addword:
            jieba.add_word(c, freq=910, tag="ns")

    for c in ALL_PROVINCES:
        for _extend in ("省", "自治区"):
            if _extend in c:
                _city = re.sub(re.compile(_extend + "$"), '', c)
                jie_words.add(_city)
                if len(_city) > 1 and is_addword:
                    jieba.add_word(_city, freq=1000, tag="ns")
        jie_words.add(c)
        if is_addword:
            jieba.add_word(c, freq=1100, tag="ns")
    if is_addword:
        for _extend in CITY_EXTEND:
            jieba.del_word(_extend)
        for _extend in AREA_EXTEND:
            jieba.del_word(_extend)
    return jie_words


# 补全省市
def __completion(pre_str=None, str_type='city', def_val="org"):
    """
    补全城市名，或省份名
    :param pre_str: string,所传的城市名
    :param str_type: 判断是补全城市还是省份
    :param def_val: 如果没有匹配到返回值，org表示原样返回，否则返回空
    :return:string
    """
    if not pre_str:
        return ""
    if not isinstance(pre_str, str):
        raise Exception("pre_str 应该为string类型！")
    try:
        if 'city' in str_type:
            if pre_str in ALL_CITYS:
                return pre_str
            for extend in CITY_EXTEND:
                if pre_str + extend in ALL_CITYS:
                    return pre_str + extend
            if def_val == "org":
                return pre_str
            else:
                return ""

        if 'province' in str_type:
            if pre_str in ALL_PROVINCES:
                return pre_str
            # 普通的少了省
            elif pre_str + "省" in ALL_PROVINCES:
                return pre_str + "省"
            # 直辖市
            elif pre_str + "市" in ALL_PROVINCES:
                return pre_str + "市"
            # 自治区
            elif pre_str + "特别行政区" in ALL_PROVINCES:
                return pre_str + "特别行政区"
            elif pre_str in ("内蒙", "内蒙古"):
                return "内蒙古自治区"
            elif pre_str in ("广西", "广西壮族"):
                return "广西壮族自治区"
            elif pre_str in ("西藏"):
                return "西藏自治区"
            elif pre_str in ("宁夏", "宁夏回族"):
                return "宁夏回族自治区"
            elif pre_str in ("新疆", "新疆维吾尔"):
                return "新疆维吾尔自治区"
            else:
                if def_val == "org":
                    return pre_str
                else:
                    return ""
    except:
        return ""


# 通过city查找省
def __find_province(city):
    """
    根据城市找对应的省份
    """
    try:
        return CITY_TO_PROVINCE.get(city, "")
    except:
        return ""


# 推测 当 find_city 找到不对应的city的时候，从第三级中推测，看是否是第三级
def __surmise_area_city(city, org_city, org_province, **kwargs):
    '''
    查看是否第三级城市，也就是县，直辖区，县级市，返回对应的二级城市，如果有冲突，则原样返回
    :param area:
    :param org_province:
    :return:
    '''
    if not isinstance(city, str):
        city = ""
    if not isinstance(org_province, str):
        org_province = ""
    # 可能匹配的路径
    match_area_path_list = []
    new_city_province = ()
    if city in AREA_PATH.keys():
        match_area_list_tmp = AREA_PATH.get(city)
        for area_item in match_area_list_tmp:
            match_area_path_list.append((city, area_item[1], area_item[0], 5.0))
    else:
        # 去掉结尾的关键词再猜
        for extend in AREA_EXTEND:
            # print("city:",city,"extend:",extend)
            city = re.sub(re.compile(extend + "$"), '', city)
        if len(city) > 1:
            for extend in AREA_EXTEND:
                _city = city + extend
                if _city in AREA_PATH.keys():
                    match_area_list_tmp = AREA_PATH.get(_city)
                    for area_item in match_area_list_tmp:
                        match_score = 1.5
                        if area_item[1] == org_province:
                            match_score = 2.5
                        match_area_path_list.append((_city, area_item[1], area_item[0], match_score))
    # print("city:", city, " province:", org_province, " match_area_path_list:", match_area_path_list)
    if match_area_path_list:
        # 只有一个匹配到
        if len(match_area_path_list) == 1:
            match_area_path = match_area_path_list[0]
            _match_area_score= match_area_path[3]
            if _match_area_score < 3.5:
                _match_area_score = 3.5
            new_city_province = (match_area_path[0], match_area_path[1], match_area_path[2], _match_area_score)
        # 多个匹配到，但没有省份信息，暂时无法处理，原样返回 todo 预留 **kwargs辅助推测
        elif len(match_area_path_list) > 1 and not org_province:
            new_city_province = (city, org_province, org_city, 0)
        # 多个匹配，有省份信息，todo 预留 **kwargs辅助推测
        elif len(match_area_path_list) > 1 and org_province:
            find_cnt = 0
            for area_path_item in match_area_path_list:
                if org_province == area_path_item[1] and org_city == area_path_item[2]:
                    find_cnt = 1
                    new_city_province = (area_path_item[0], area_path_item[1], area_path_item[2], area_path_item[3])
                    break
                if org_province == area_path_item[1]:
                    find_cnt += 1
                    new_city_province = (area_path_item[0], area_path_item[1], area_path_item[2], area_path_item[3])
            # 多个匹配到，有省份信息，暂时无法处理，原样返回
            if find_cnt > 1:
                new_city_province = (city, org_province, org_city, 1)
            elif find_cnt == 0:
                # 一个也没匹配到，原样返回
                new_city_province = (city, org_province, org_city, 0.1)
    # print("new_city_province:", new_city_province)
    return new_city_province


# 返回字符串中的所有省市信息
def __find_all_provinces_city(val, org_city, org_province):
    '''

    :param val:
    :return:  省，市
    '''
    if not val:
        return None
    val = val.strip()
    seg_list = pseg.lcut(val)
    # print("val:", val, " seg_list:", seg_list)
    ns_list = []
    for ns in seg_list:
        if ns.flag == "ns":
            org_val = ns.word
            if len(org_val) < 2:
                continue
            # 阻止成为第三级
            is_stop = False
            org_val_index = val.index(org_val)
            org_val_len = len(org_val)
            if org_val not in ALL_CITYS:
                for c in CITY_STOP.keys():
                    stop_index = 0
                    try:
                        stop_index = val.index(c, org_val_index)
                    except ValueError:
                        stop_index = 0
                    _distance = CITY_STOP[c]
                    if org_val_index == 0 and _distance >= 2:
                        _distance -= 1
                    if stop_index and stop_index - (org_val_index + org_val_len) < _distance:
                        is_stop = True
                        break
            if is_stop:
                # print("is stop")
                continue
            new_val = __completion(org_val, "city", "null")
            new_province = __completion(org_val, "province", "null")
            # score
            # 6 第二级城市匹配上
            # 5 第三级城市匹配上
            # 1.5 第三级名称推算成功，如果省份相同，则为2.5分
            # 1 第三级名称未推算出,只是提取到了疑似地址

            if new_val:
                _province = __find_province(new_val)
                ns_list.append({"province": _province, "city": new_val, "score": 6.0, "ns": ns})
            elif new_province and not new_val:
                ns_list.append({"province": new_province, "city": "", "score": 0.0, "ns": ns})
            else:
                # 是否第三级
                surmise_set = __surmise_area_city(org_val, org_city, org_province)
                # print("surmise_set：", surmise_set)

                if surmise_set:
                    _find_city = surmise_set[0]
                    _province = surmise_set[1]
                    _city = surmise_set[2]
                    _score = surmise_set[3]
                    # 如果省的相关信息出现过，权重提升一倍
                    _sort_province = _province
                    for _sort_extend in ("省", "市", "县", "自治区"):
                        _sort_province = _sort_province.replace(_sort_extend, "")
                    if _province and _province in val or _sort_province in val:
                        _score = _score * 2

                    if _find_city in CITY_JOIN.keys() and _city != org_city:
                        for c_join in CITY_JOIN.get(_find_city):
                            if c_join in val:
                                ns_list.append(
                                    {"province": _province, "city": _city, "score": _score, "ns": ns})
                            break
                    else:
                        ns_list.append(
                            {"province": _province, "city": _city, "score": _score, "ns": ns})

    return ns_list

# 返回字符串中的所有省市信息 (不带词性，根据省市表判断是否地址)
def __find_all_provinces_city_b(val, org_city, org_province, city_maps):
    '''
    :param val:
    :return:  省，市
    '''
    if not val:
        return None
    val = val.strip()
    seg_list = jieba.cut(val, cut_all=True)  # jieba.cut_for_search(val)  # jieba.cut(val)
    # print("val:", val, " seg_list:", seg_list)
    ns_list = []
    for ns in seg_list:
        # print("val:", val, " ns:", ns, " is in city_maps:", (ns in city_maps))
        if ns in city_maps:
            org_val = ns
            if len(org_val) < 2:
                continue
            # 阻止成为第三级
            is_stop = False
            org_val_index = val.index(org_val)
            org_val_len = len(org_val)
            if org_val not in ALL_CITYS:
                for c in CITY_STOP.keys():
                    stop_index = 0
                    try:
                        stop_index = val.index(c, org_val_index)
                    except ValueError:
                        stop_index = 0
                    _distance = CITY_STOP[c]
                    if org_val_index == 0 and _distance >= 2:
                        _distance = 1
                    # print("c,stop_index,org_val_index,org_val_len ",c,stop_index,org_val_index,org_val_len)
                    if stop_index and stop_index - (org_val_index + org_val_len) < _distance:
                        is_stop = True
                        break

            if is_stop:
                # print("is stop")
                continue
            new_val = __completion(org_val, "city", "null")
            new_province = __completion(org_val, "province", "null")
            # score
            # 6 第二级城市匹配上
            # 5 第三级城市匹配上
            # 1.5 第三级名称推算成功 ，如果省份相同，则为2.5分
            # 1 第三级名称未推算出,只是提取到了疑似地址
            # print("new_val:",new_val," new_province:",new_province)
            if new_val:
                _province = __find_province(new_val)
                ns_list.append({"province": _province, "city": new_val, "score": 6.0, "ns": ns})
            elif new_province and not new_val:
                ns_list.append({"province": new_province, "city": "", "score": 0.0, "ns": ns})
            else:
                # 是否第三级
                surmise_set = __surmise_area_city(org_val, org_city, org_province)
                # print("surmise_set：", surmise_set)
                if surmise_set:

                    _find_city = surmise_set[0]
                    _province = surmise_set[1]
                    _city = surmise_set[2]
                    _score = surmise_set[3]
                    # 如果省的相关信息出现过，权重提升一倍
                    _sort_province = _province
                    for _sort_extend in ("省", "市", "县", "自治区"):
                        _sort_province = _sort_province.replace(_sort_extend, "")
                    if _province and _province in val or _sort_province in val:
                        _score = _score * 2
                    if _find_city in CITY_JOIN.keys() and _city != org_city:
                        for c_join in CITY_JOIN.get(_find_city):
                            if c_join in val:
                                ns_list.append(
                                    {"province": _province, "city": _city, "score": _score, "ns": ns})
                            break
                    else:
                        ns_list.append(
                            {"province": _province, "city": _city, "score": _score, "ns": ns})
    return ns_list



# 计算城市信息
def compute_city(item_iter, model, city_map):
    compute_field = {
        "company_name": 2,
        "address": 1.5,
        "reg_authority": 3,
    }
    city_sore = {}
    for field_item in compute_field.keys():
        if model == 0:
            ns_list = __find_all_provinces_city(item_iter.get(field_item), item_iter.get("city"),
                                                item_iter.get("province"))
        else:
            ns_list = __find_all_provinces_city_b(item_iter.get(field_item), item_iter.get("city"),
                                                  item_iter.get("province"), city_map)

        if ns_list:
            for ns in ns_list:
                # print("ns:", ns)
                ns_key = "{}_{}".format(ns.get("province"), ns.get("city"))
                if ns_key not in city_sore.keys():
                    city_sore[ns_key] = compute_field.get(field_item) * ns.get("score")
                else:
                    city_sore[ns_key] = city_sore[ns_key] + compute_field.get(field_item) * ns.get("score")
    city_sore_list = sorted(city_sore.items(), key=lambda x: x[1], reverse=True)
    # print("city_sore:", city_sore)
    if city_sore_list:
        province_city = city_sore_list[0][0].split("_")
        choose_city_score = city_sore_list[0][1]
        # print("province_city:", province_city)
        return province_city[0], province_city[1], choose_city_score, city_sore
    else:
        return False, False, False, False



if __name__ == "__main__":
    print("开始自定义分词 ")
    city_map = __add_jieba_words()
    print("自定义分词结束 ")
    model = 1  # 0 用词性判断，1 用城市列表判断
    item_iter = {
        "company_name": "联想手机客户服务中心(凯里市北京东路店)",
        "province": "重庆市",
        "city": "重庆市",
        "address": "北京东路一号电信大厅二楼",
    }

    province, city, choose_city_score, city_sore = compute_city(item_iter, model, city_map)
    print(province, city, choose_city_score, city_sore)
